$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'openjpeg.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjp2.so.2.3.1',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'cio.c' => 1,
                         'image.c' => 1,
                         'openjpeg.c' => 1,
                         'thread.c' => 1
                       },
          'SymbolInfo' => {
                            '14432' => {
                                         'Header' => 'openjpeg.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'p_buffer_size',
                                                               'type' => '9059'
                                                             },
                                                      '1' => {
                                                               'name' => 'l_is_input',

                                                    'opj_get_decoded_tile' => 1,
                                                    'opj_get_num_cpus' => 1,
                                                    'opj_has_thread_support' => 1,
                                                    'opj_image_create' => 1,
                                                    'opj_image_data_alloc' => 1,
                                                    'opj_image_data_free' => 1,
                                                    'opj_image_destroy' => 1,
                                                    'opj_image_tile_create' => 1,
                                                    'opj_read_header' => 1,
                                                    'opj_read_tile_header' => 1,
                                                    'opj_set_MCT' => 1,
                                                    'opj_set_decode_area' => 1,
                                                    'opj_set_decoded_components' => 1,
                                                    'opj_set_decoded_resolution_factor' => 1,
                                                    'opj_set_default_decoder_parameters' => 1,
                                                    'opj_set_default_encoder_parameters' => 1,
                                                    'opj_set_error_handler' => 1,
                                                    'opj_set_info_handler' => 1,
                                                    'opj_set_warning_handler' => 1,
                                                    'opj_setup_decoder' => 1,
                                                    'opj_setup_encoder' => 1,
                                                    'opj_start_compress' => 1,
                                                    'opj_stream_create' => 1,
                                                    'opj_stream_create_default_file_stream' => 1,
                                                    'opj_stream_create_file_stream' => 1,
                                                    'opj_stream_default_create' => 1,
                                                    'opj_stream_destroy' => 1,
                                                    'opj_stream_set_read_function' => 1,
                                                    'opj_stream_set_seek_function' => 1,
                                                    'opj_stream_set_skip_function' => 1,
                                                    'opj_stream_set_user_data' => 1,
                                                    'opj_stream_set_user_data_length' => 1,
                                                    'opj_stream_set_write_function' => 1,
                                                    'opj_version' => 1,
                                                    'opj_write_tile' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101' => {
                                     'BaseType' => '94',
                                     'Header' => 'types.h',
                                     'Line' => '141',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '11122' => {
                                       'BaseType' => '2236',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '115',
                                       'Name' => 'OPJ_FLOAT32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11166' => {
                                       'BaseType' => '94',
                                       'Header' => 'stdint.h',
                                       'Line' => '41',
                                       'Name' => 'int64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11188' => {
                                       'BaseType' => '66',
                                       'Header' => 'stdint.h',
                                       'Line' => '56',
                                       'Name' => 'uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '112' => {
                                     'BaseType' => '94',
                                     'Header' => 'types.h',
                                     'Line' => '142',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '11221' => {
                                       'BaseType' => '11188',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '128',
                                       'Name' => 'OPJ_UINT64',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11232' => {
                                       'BaseType' => '11166',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '130',
                                       'Name' => 'OPJ_OFF_T',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11254' => {
                                       'BaseType' => '11266',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '343',
                                       'Name' => 'opj_msg_callback',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11266' => {
                                       'Name' => 'void(*)(char const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '156'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11288' => {
                                       'BaseType' => '11300',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '631',
                                       'Name' => 'opj_stream_read_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11300' => {
                                       'Name' => 'OPJ_SIZE_T(*)(void*, OPJ_SIZE_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '130'
                                                           },
                                                    '1' => {
                                                             'type' => '9059'
                                                           },
                                                    '2' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '9059',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11331' => {
                                       'BaseType' => '11300',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '637',
                                       'Name' => 'opj_stream_write_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11343' => {
                                       'BaseType' => '11355',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '643',
                                       'Name' => 'opj_stream_skip_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11355' => {
                                       'Name' => 'OPJ_OFF_T(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11232'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '11232',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11381' => {
                                       'BaseType' => '11393',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '649',
                                       'Name' => 'opj_stream_seek_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11393' => {
                                       'Name' => 'OPJ_BOOL(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11232'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '2747',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11419' => {
                                       'BaseType' => '781',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '655',
                                       'Name' => 'opj_stream_free_user_data_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11448' => {
                                       'BaseType' => '130',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '660',
                                       'Name' => 'opj_stream_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11846' => {
                                       'BaseType' => '11122',
                                       'Name' => 'OPJ_FLOAT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11852' => {
                                       'BaseType' => '9048',
                                       'Name' => 'OPJ_UINT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '130' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '132' => {
                                     'BaseType' => '138',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '138' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '145' => {
                                     'BaseType' => '66',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '14584' => {
                                       'BaseType' => '11448',
                                       'Name' => 'opj_stream_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '156' => {
                                     'BaseType' => '162',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '162' => {
                                     'BaseType' => '138',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '174285' => {
                                        'BaseType' => '76994',
                                        'Name' => 'opj_codestream_info_v2_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '18236' => {
                                       'BaseType' => '138',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '114',
                                       'Name' => 'OPJ_CHAR',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '18280' => {
                                       'BaseType' => '52',
                                       'Header' => 'stdint.h',
                                       'Line' => '50',
                                       'Name' => 'uint16_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '18313' => {
                                       'BaseType' => '18280',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '124',
                                       'Name' => 'OPJ_UINT16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '18379' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '297',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_PROG_UNKNOWN',
                                                            'value' => '18446744073709551615'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_LRCP',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_RLCP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_RPCL',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_PCRL',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CPRL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18429' => {
                                       'BaseType' => '18379',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '304',
                                       'Name' => 'OPJ_PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '18441' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '309',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_CLRSPC_UNKNOWN',
                                                            'value' => '18446744073709551615'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CLRSPC_UNSPECIFIED',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CLRSPC_SRGB',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CLRSPC_GRAY',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_CLRSPC_SYCC',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CLRSPC_EYCC',
                                                            'value' => '4'
                                                          },
                                                   '6' => {
                                                            'name' => 'OPJ_CLRSPC_CMYK',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18497' => {
                                       'BaseType' => '18441',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '317',
                                       'Name' => 'OPJ_COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '18509' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '359',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'resno0',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'compno0',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '10' => {
                                                             'name' => 'progorder',
                                                             'offset' => '40',
                                                             'type' => '18989'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile',
                                                             'offset' => '48',
                                                             'type' => '9048'
                                                           },
                                                   '12' => {
                                                             'name' => 'tx0',
                                                             'offset' => '52',
                                                             'type' => '9037'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx1',
                                                             'offset' => '56',
                                                             'type' => '9037'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '60',
                                                             'type' => '9037'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty1',
                                                             'offset' => '64',
                                                             'type' => '9037'
                                                           },
                                                   '16' => {
                                                             'name' => 'layS',
                                                             'offset' => '68',
                                                             'type' => '9048'
                                                           },
                                                   '17' => {
                                                             'name' => 'resS',
                                                             'offset' => '72',
                                                             'type' => '9048'
                                                           },
                                                   '18' => {
                                                             'name' => 'compS',
                                                             'offset' => '76',
                                                             'type' => '9048'
                                                           },
                                                   '19' => {
                                                             'name' => 'prcS',
                                                             'offset' => '80',
                                                             'type' => '9048'
                                                           },
                                                   '2' => {
                                                            'name' => 'layno1',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '20' => {
                                                             'name' => 'layE',
                                                             'offset' => '84',
                                                             'type' => '9048'
                                                           },
                                                   '21' => {
                                                             'name' => 'resE',
                                                             'offset' => '88',
                                                             'type' => '9048'
                                                           },
                                                   '22' => {
                                                             'name' => 'compE',
                                                             'offset' => '92',
                                                             'type' => '9048'
                                                           },
                                                   '23' => {
                                                             'name' => 'prcE',
                                                             'offset' => '96',
                                                             'type' => '9048'
                                                           },
                                                   '24' => {
                                                             'name' => 'txS',
                                                             'offset' => '100',
                                                             'type' => '9048'
                                                           },
                                                   '25' => {
                                                             'name' => 'txE',
                                                             'offset' => '104',
                                                             'type' => '9048'
                                                           },
                                                   '26' => {
                                                             'name' => 'tyS',
                                                             'offset' => '108',
                                                             'type' => '9048'
                                                           },
                                                   '27' => {
                                                             'name' => 'tyE',
                                                             'offset' => '112',
                                                             'type' => '9048'
                                                           },
                                                   '28' => {
                                                             'name' => 'dx',
                                                             'offset' => '116',
                                                             'type' => '9048'
                                                           },
                                                   '29' => {
                                                             'name' => 'dy',
                                                             'offset' => '120',
                                                             'type' => '9048'
                                                           },
                                                   '3' => {
                                                            'name' => 'resno1',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '30' => {
                                                             'name' => 'lay_t',
                                                             'offset' => '124',
                                                             'type' => '9048'
                                                           },
                                                   '31' => {
                                                             'name' => 'res_t',
                                                             'offset' => '128',
                                                             'type' => '9048'
                                                           },
                                                   '32' => {
                                                             'name' => 'comp_t',
                                                             'offset' => '132',
                                                             'type' => '9048'
                                                           },
                                                   '33' => {
                                                             'name' => 'prc_t',
                                                             'offset' => '136',
                                                             'type' => '9048'
                                                           },
                                                   '34' => {
                                                             'name' => 'tx0_t',
                                                             'offset' => '140',
                                                             'type' => '9048'
                                                           },
                                                   '35' => {
                                                             'name' => 'ty0_t',
                                                             'offset' => '144',
                                                             'type' => '9048'
                                                           },
                                                   '4' => {
                                                            'name' => 'compno1',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'layno0',
                                                            'offset' => '20',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'precno0',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno1',
                                                            'offset' => '28',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'prg1',
                                                            'offset' => '32',
                                                            'type' => '18429'
                                                          },
                                                   '9' => {
                                                            'name' => 'prg',
                                                            'offset' => '36',
                                                            'type' => '18429'
                                                          }
                                                 },
                                       'Name' => 'struct opj_poc',
                                       'Size' => '148',
                                       'Type' => 'Struct'
                                     },
                          '18989' => {
                                       'BaseType' => '18236',
                                       'Name' => 'OPJ_CHAR[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '19005' => {
                                       'BaseType' => '18509',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '382',
                                       'Name' => 'opj_poc_t',
                                       'Size' => '148',
                                       'Type' => 'Typedef'
                                     },
                          '19017' => {
                                       'BaseType' => '19005',
                                       'Name' => 'opj_poc_t[32]',
                                       'Size' => '4736',
                                       'Type' => 'Array'
                                     },
                          '19033' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '671',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '10' => {
                                                             'name' => 'factor',
                                                             'offset' => '40',
                                                             'type' => '9048'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '48',
                                                             'type' => '19208'
                                                           },
                                                   '12' => {
                                                             'name' => 'alpha',
                                                             'offset' => '56',
                                                             'type' => '18313'
                                                           },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '9048'
                                                          },
                                                   '9' => {
                                                            'name' => 'resno_decoded',
                                                            'offset' => '36',
                                                            'type' => '9048'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '19208' => {
                                       'BaseType' => '9037',
                                       'Name' => 'OPJ_INT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19214' => {
                                       'BaseType' => '19033',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '698',
                                       'Name' => 'opj_image_comp_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '19226' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '703',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'color_space',
                                                            'offset' => '20',
                                                            'type' => '18497'
                                                          },
                                                   '6' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '19353'
                                                          },
                                                   '7' => {
                                                            'name' => 'icc_profile_buf',
                                                            'offset' => '32',
                                                            'type' => '9070'
                                                          },
                                                   '8' => {
                                                            'name' => 'icc_profile_len',
                                                            'offset' => '40',
                                                            'type' => '9048'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '19353' => {
                                       'BaseType' => '19214',
                                       'Name' => 'opj_image_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19365' => {
                                       'BaseType' => '19226',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '722',
                                       'Name' => 'opj_image_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '19377' => {
                                       'BaseType' => '9048',
                                       'Name' => 'OPJ_UINT32[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '21147' => {
                                       'BaseType' => '19365',
                                       'Name' => 'opj_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2236' => {
                                      'Name' => 'float',
                                      'Size' => '4',
                                      'Type' => 'Intrinsic'
                                    },
                          '2243' => {
                                      'Name' => 'double',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '2250' => {
                                      'Header' => 'libio.h',
                                      'Line' => '273',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '87'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '132'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '132'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '132'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '2697'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '2703'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '87'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '87'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '101'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '52'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '73'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '2709'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '132'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '2725'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '112'
                                                          },
                                                  '22' => {
                                                            'name' => '__pad1',
                                                            'offset' => '152',
                                                            'type' => '130'
                                                          },
                                                  '23' => {
                                                            'name' => '__pad2',
                                                            'offset' => '160',
                                                            'type' => '130'
                                                          },
                                                  '24' => {
                                                            'name' => '__pad3',
                                                            'offset' => '168',
                                                            'type' => '130'
                                                          },
                                                  '25' => {
                                                            'name' => '__pad4',
                                                            'offset' => '176',
                                                            'type' => '130'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '145'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '87'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '2731'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '132'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '132'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '132'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '132'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '132'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '132'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '132'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '225821' => {
                                        'Header' => 'openjpeg.h',
                                        'Line' => '322',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_CODEC_UNKNOWN',
                                                             'value' => '18446744073709551615'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CODEC_J2K',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CODEC_JPT',
                                                             'value' => '1'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CODEC_JP2',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'OPJ_CODEC_JPP',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'OPJ_CODEC_JPX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '225871' => {
                                        'BaseType' => '225821',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '329',
                                        'Name' => 'OPJ_CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '227628' => {
                                        'BaseType' => '130',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '612',
                                        'Name' => 'opj_codec_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '23247' => {
                                       'BaseType' => '2747',
                                       'Name' => 'OPJ_BOOL*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23281' => {
                                       'BaseType' => '9048',
                                       'Name' => 'OPJ_UINT32 const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '236951' => {
                                        'BaseType' => '227628',
                                        'Name' => 'opj_codec_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '241525' => {
                                        'BaseType' => '74696',
                                        'Name' => 'opj_codestream_index_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2641' => {
                                      'Header' => 'libio.h',
                                      'Line' => '182',
                                      'Name' => '_IO_lock_t',
                                      'Type' => 'Typedef'
                                    },
                          '2648' => {
                                      'Header' => 'libio.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_next',
                                                           'offset' => '0',
                                                           'type' => '2697'
                                                         },
                                                  '1' => {
                                                           'name' => '_sbuf',
                                                           'offset' => '8',
                                                           'type' => '2703'
                                                         },
                                                  '2' => {
                                                           'name' => '_pos',
                                                           'offset' => '16',
                                                           'type' => '87'
                                                         }
                                                },
                                      'Name' => 'struct _IO_marker',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2697' => {
                                      'BaseType' => '2648',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2703' => {
                                      'BaseType' => '2250',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2709' => {
                                      'BaseType' => '138',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '2725' => {
                                      'BaseType' => '2641',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2731' => {
                                      'BaseType' => '138',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '2747' => {
                                      'BaseType' => '87',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '110',
                                      'Name' => 'OPJ_BOOL',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '58997' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '728',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '9048'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '59120' => {
                                       'BaseType' => '58997',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '747',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '61658' => {
                                       'BaseType' => '59120',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '66818' => {
                                       'BaseType' => '2250',
                                       'Header' => 'stdio.h',
                                       'Line' => '49',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '67557' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '276',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_STD_RSIZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA4K',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_MCT',
                                                            'value' => '33024'
                                                          }
                                                 },
                                       'Name' => 'enum RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '67597' => {
                                       'BaseType' => '67557',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '281',
                                       'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '67609' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '287',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K_24',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA2K_48',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CINEMA4K_24',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '67647' => {
                                       'BaseType' => '67609',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '292',
                                       'Name' => 'OPJ_CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '68331' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '387',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '2747'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '87'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '87'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '18429'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '19017'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '4792',
                                                             'type' => '9048'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '4796',
                                                             'type' => '87'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '4800',
                                                             'type' => '69195'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '5200',
                                                             'type' => '69195'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '5600',
                                                             'type' => '87'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '5604',
                                                             'type' => '87'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '5608',
                                                             'type' => '87'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '87'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '5612',
                                                             'type' => '87'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '5616',
                                                             'type' => '87'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '5620',
                                                             'type' => '87'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '5624',
                                                             'type' => '87'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '5628',
                                                             'type' => '87'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '5632',
                                                             'type' => '69211'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '5764',
                                                             'type' => '69211'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '5896',
                                                             'type' => '69227'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '9992',
                                                             'type' => '69227'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '14088',
                                                             'type' => '87'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '87'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '14092',
                                                             'type' => '69227'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '18188',
                                                             'type' => '87'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '18192',
                                                             'type' => '87'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '18196',
                                                             'type' => '87'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '18200',
                                                             'type' => '87'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '18204',
                                                             'type' => '87'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '18208',
                                                             'type' => '87'
                                                           },
                                                   '37' => {
                                                             'name' => 'jpwl_epc_on',
                                                             'offset' => '18212',
                                                             'type' => '2747'
                                                           },
                                                   '38' => {
                                                             'name' => 'jpwl_hprot_MH',
                                                             'offset' => '18216',
                                                             'type' => '87'
                                                           },
                                                   '39' => {
                                                             'name' => 'jpwl_hprot_TPH_tileno',
                                                             'offset' => '18220',
                                                             'type' => '69244'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '87'
                                                          },
                                                   '40' => {
                                                             'name' => 'jpwl_hprot_TPH',
                                                             'offset' => '18284',
                                                             'type' => '69244'
                                                           },
                                                   '41' => {
                                                             'name' => 'jpwl_pprot_tileno',
                                                             'offset' => '18348',
                                                             'type' => '69244'
                                                           },
                                                   '42' => {
                                                             'name' => 'jpwl_pprot_packno',
                                                             'offset' => '18412',
                                                             'type' => '69244'
                                                           },
                                                   '43' => {
                                                             'name' => 'jpwl_pprot',
                                                             'offset' => '18476',
                                                             'type' => '69244'
                                                           },
                                                   '44' => {
                                                             'name' => 'jpwl_sens_size',
                                                             'offset' => '18540',
                                                             'type' => '87'
                                                           },
                                                   '45' => {
                                                             'name' => 'jpwl_sens_addr',
                                                             'offset' => '18544',
                                                             'type' => '87'
                                                           },
                                                   '46' => {
                                                             'name' => 'jpwl_sens_range',
                                                             'offset' => '18548',
                                                             'type' => '87'
                                                           },
                                                   '47' => {
                                                             'name' => 'jpwl_sens_MH',
                                                             'offset' => '18552',
                                                             'type' => '87'
                                                           },
                                                   '48' => {
                                                             'name' => 'jpwl_sens_TPH_tileno',
                                                             'offset' => '18556',
                                                             'type' => '69244'
                                                           },
                                                   '49' => {
                                                             'name' => 'jpwl_sens_TPH',
                                                             'offset' => '18620',
                                                             'type' => '69244'
                                                           },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '87'
                                                          },
                                                   '50' => {
                                                             'name' => 'cp_cinema',
                                                             'offset' => '18684',
                                                             'type' => '67647'
                                                           },
                                                   '51' => {
                                                             'name' => 'max_comp_size',
                                                             'offset' => '18688',
                                                             'type' => '87'
                                                           },
                                                   '52' => {
                                                             'name' => 'cp_rsiz',
                                                             'offset' => '18692',
                                                             'type' => '67597'
                                                           },
                                                   '53' => {
                                                             'name' => 'tp_on',
                                                             'offset' => '18696',
                                                             'type' => '138'
                                                           },
                                                   '54' => {
                                                             'name' => 'tp_flag',
                                                             'offset' => '18697',
                                                             'type' => '138'
                                                           },
                                                   '55' => {
                                                             'name' => 'tcp_mct',
                                                             'offset' => '18698',
                                                             'type' => '138'
                                                           },
                                                   '56' => {
                                                             'name' => 'jpip_on',
                                                             'offset' => '18700',
                                                             'type' => '2747'
                                                           },
                                                   '57' => {
                                                             'name' => 'mct_data',
                                                             'offset' => '18704',
                                                             'type' => '130'
                                                           },
                                                   '58' => {
                                                             'name' => 'max_cs_size',
                                                             'offset' => '18712',
                                                             'type' => '87'
                                                           },
                                                   '59' => {
                                                             'name' => 'rsiz',
                                                             'offset' => '18716',
                                                             'type' => '18313'
                                                           },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '87'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '87'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '69173'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '132'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '18720',
                                       'Type' => 'Struct'
                                     },
                          '69173' => {
                                       'BaseType' => '87',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69195' => {
                                       'BaseType' => '2236',
                                       'Name' => 'float[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '69211' => {
                                       'BaseType' => '87',
                                       'Name' => 'int[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '69227' => {
                                       'BaseType' => '138',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '69244' => {
                                       'BaseType' => '87',
                                       'Name' => 'int[16]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '69260' => {
                                       'BaseType' => '68331',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '538',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '18720',
                                       'Type' => 'Typedef'
                                     },
                          '69272' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '546',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '10' => {
                                                             'name' => 'm_verbose',
                                                             'offset' => '8224',
                                                             'type' => '2747'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile_index',
                                                             'offset' => '8228',
                                                             'type' => '9048'
                                                           },
                                                   '12' => {
                                                             'name' => 'nb_tile_to_decode',
                                                             'offset' => '8232',
                                                             'type' => '9048'
                                                           },
                                                   '13' => {
                                                             'name' => 'jpwl_correct',
                                                             'offset' => '8236',
                                                             'type' => '2747'
                                                           },
                                                   '14' => {
                                                             'name' => 'jpwl_exp_comps',
                                                             'offset' => '8240',
                                                             'type' => '87'
                                                           },
                                                   '15' => {
                                                             'name' => 'jpwl_max_tiles',
                                                             'offset' => '8244',
                                                             'type' => '87'
                                                           },
                                                   '16' => {
                                                             'name' => 'flags',
                                                             'offset' => '8248',
                                                             'type' => '59'
                                                           },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '69227'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '69227'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '87'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '87'
                                                          },
                                                   '6' => {
                                                            'name' => 'DA_x0',
                                                            'offset' => '8208',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'DA_x1',
                                                            'offset' => '8212',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'DA_y0',
                                                            'offset' => '8216',
                                                            'type' => '9048'
                                                          },
                                                   '9' => {
                                                            'name' => 'DA_y1',
                                                            'offset' => '8220',
                                                            'type' => '9048'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8252',
                                       'Type' => 'Struct'
                                     },
                          '69522' => {
                                       'BaseType' => '69272',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '606',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8252',
                                       'Type' => 'Typedef'
                                     },
                          '70038' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '760',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '11232'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_ph_pos',
                                                            'offset' => '8',
                                                            'type' => '11232'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '11232'
                                                          },
                                                   '3' => {
                                                            'name' => 'disto',
                                                            'offset' => '24',
                                                            'type' => '2243'
                                                          }
                                                 },
                                       'Name' => 'struct opj_packet_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '70104' => {
                                       'BaseType' => '70038',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '769',
                                       'Name' => 'opj_packet_info_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '70116' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '776',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '52'
                                                          },
                                                   '1' => {
                                                            'name' => 'pos',
                                                            'offset' => '8',
                                                            'type' => '11232'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '87'
                                                          }
                                                 },
                                       'Name' => 'struct opj_marker_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '70169' => {
                                       'BaseType' => '70116',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '783',
                                       'Name' => 'opj_marker_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '70521' => {
                                       'BaseType' => '70104',
                                       'Name' => 'opj_packet_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70527' => {
                                       'BaseType' => '70169',
                                       'Name' => 'opj_marker_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70867' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '900',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'compno',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '10' => {
                                                             'name' => 'numgbits',
                                                             'offset' => '808',
                                                             'type' => '9048'
                                                           },
                                                   '11' => {
                                                             'name' => 'roishift',
                                                             'offset' => '812',
                                                             'type' => '9037'
                                                           },
                                                   '12' => {
                                                             'name' => 'prcw',
                                                             'offset' => '816',
                                                             'type' => '19377'
                                                           },
                                                   '13' => {
                                                             'name' => 'prch',
                                                             'offset' => '948',
                                                             'type' => '19377'
                                                           },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'cblkw',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'cblkh',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'cblksty',
                                                            'offset' => '20',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'qmfbid',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'qntsty',
                                                            'offset' => '28',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'stepsizes_mant',
                                                            'offset' => '32',
                                                            'type' => '71069'
                                                          },
                                                   '9' => {
                                                            'name' => 'stepsizes_expn',
                                                            'offset' => '420',
                                                            'type' => '71069'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tccp_info',
                                       'Size' => '1080',
                                       'Type' => 'Struct'
                                     },
                          '71069' => {
                                       'BaseType' => '9048',
                                       'Name' => 'OPJ_UINT32[97]',
                                       'Size' => '388',
                                       'Type' => 'Array'
                                     },
                          '71101' => {
                                       'BaseType' => '70867',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '930',
                                       'Name' => 'opj_tccp_info_t',
                                       'Size' => '1080',
                                       'Type' => 'Typedef'
                                     },
                          '71113' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '935',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '87'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '2' => {
                                                            'name' => 'prg',
                                                            'offset' => '8',
                                                            'type' => '18429'
                                                          },
                                                   '3' => {
                                                            'name' => 'numlayers',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'mct',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'tccp_info',
                                                            'offset' => '24',
                                                            'type' => '71205'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_v2_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '71205' => {
                                       'BaseType' => '71101',
                                       'Name' => 'opj_tccp_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71211' => {
                                       'BaseType' => '71113',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '951',
                                       'Name' => 'opj_tile_info_v2_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '71223' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '956',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tx0',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'ty0',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '2' => {
                                                            'name' => 'tdx',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'tdy',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'tw',
                                                            'offset' => '16',
                                                            'type' => '9048'
                                                          },
                                                   '5' => {
                                                            'name' => 'th',
                                                            'offset' => '20',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbcomps',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'm_default_tile_info',
                                                            'offset' => '32',
                                                            'type' => '71211'
                                                          },
                                                   '8' => {
                                                            'name' => 'tile_info',
                                                            'offset' => '64',
                                                            'type' => '71352'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_info_v2',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '71352' => {
                                       'BaseType' => '71211',
                                       'Name' => 'opj_tile_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71358' => {
                                       'BaseType' => '71223',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '980',
                                       'Name' => 'opj_codestream_info_v2_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '71370' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '986',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '11232'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_header',
                                                            'offset' => '8',
                                                            'type' => '11232'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '11232'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tp_index',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '71423' => {
                                       'BaseType' => '71370',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '994',
                                       'Name' => 'opj_tp_index_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '71435' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '999',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '9048'
                                                          },
                                                   '1' => {
                                                            'name' => 'nb_tps',
                                                            'offset' => '4',
                                                            'type' => '9048'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_nb_tps',
                                                            'offset' => '8',
                                                            'type' => '9048'
                                                          },
                                                   '3' => {
                                                            'name' => 'current_tpsno',
                                                            'offset' => '12',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'tp_index',
                                                            'offset' => '16',
                                                            'type' => '71579'
                                                          },
                                                   '5' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '70527'
                                                          },
                                                   '7' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '9048'
                                                          },
                                                   '8' => {
                                                            'name' => 'nb_packet',
                                                            'offset' => '44',
                                                            'type' => '9048'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_index',
                                                            'offset' => '48',
                                                            'type' => '70521'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '71579' => {
                                       'BaseType' => '71423',
                                       'Name' => 'opj_tp_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71585' => {
                                       'BaseType' => '71435',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '1026',
                                       'Name' => 'opj_tile_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '71597' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '1031',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'main_head_start',
                                                            'offset' => '0',
                                                            'type' => '11232'
                                                          },
                                                   '1' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '8',
                                                            'type' => '11232'
                                                          },
                                                   '2' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '16',
                                                            'type' => '11221'
                                                          },
                                                   '3' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '9048'
                                                          },
                                                   '4' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '70527'
                                                          },
                                                   '5' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '9048'
                                                          },
                                                   '6' => {
                                                            'name' => 'nb_of_tiles',
                                                            'offset' => '44',
                                                            'type' => '9048'
                                                          },
                                                   '7' => {
                                                            'name' => 'tile_index',
                                                            'offset' => '48',
                                                            'type' => '71715'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '71715' => {
                                       'BaseType' => '71585',
                                       'Name' => 'opj_tile_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71721' => {
                                       'BaseType' => '71597',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '1054',
                                       'Name' => 'opj_codestream_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '73' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '74696' => {
                                       'BaseType' => '71721',
                                       'Name' => 'opj_codestream_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76942' => {
                                       'BaseType' => '21147',
                                       'Name' => 'opj_image_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76948' => {
                                       'BaseType' => '69522',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76960' => {
                                       'BaseType' => '23281',
                                       'Name' => 'OPJ_UINT32 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76971' => {
                                       'BaseType' => '69260',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76977' => {
                                       'BaseType' => '76983',
                                       'Name' => 'char const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76983' => {
                                       'BaseType' => '156',
                                       'Name' => 'char const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '76988' => {
                                       'BaseType' => '66818',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76994' => {
                                       'BaseType' => '71358',
                                       'Name' => 'opj_codestream_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '781' => {
                                     'Name' => 'void(*)(void*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '130'
                                                         }
                                                },
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '87' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '9004' => {
                                      'BaseType' => '45',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '117',
                                      'Name' => 'OPJ_BYTE',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '9015' => {
                                      'BaseType' => '87',
                                      'Header' => 'stdint.h',
                                      'Line' => '39',
                                      'Name' => 'int32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9026' => {
                                      'BaseType' => '59',
                                      'Header' => 'stdint.h',
                                      'Line' => '52',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9037' => {
                                      'BaseType' => '9015',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '125',
                                      'Name' => 'OPJ_INT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9048' => {
                                      'BaseType' => '9026',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '126',
                                      'Name' => 'OPJ_UINT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9059' => {
                                      'BaseType' => '145',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '133',
                                      'Name' => 'OPJ_SIZE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9070' => {
                                      'BaseType' => '9004',
                                      'Name' => 'OPJ_BYTE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '94' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjp2.so.2.3.1' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '_Jv_RegisterClasses' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'ceilf@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'floor@GLIBC_2.2.5' => 0,
                                                             'floorf@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fseeko@GLIBC_2.2.5' => 0,
                                                             'ftello@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memmove@GLIBC_2.2.5' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'posix_memalign@GLIBC_2.2.5' => 0,
                                                             'pow@GLIBC_2.2.5' => 0,
                                                             'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                             'pthread_attr_setdetachstate@GLIBC_2.2.5' => 0,
                                                             'pthread_cond_destroy@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_init@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_signal@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_wait@GLIBC_2.3.2' => 0,
                                                             'pthread_create@GLIBC_2.2.5' => 0,
                                                             'pthread_join@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'realloc@GLIBC_2.2.5' => 0,
                                                             'sqrt@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strcpy@GLIBC_2.2.5' => 0,
                                                             'strtol@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
