$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.9.2',
          'Headers' => {
                         'bio.h' => 1,
                         'cio.h' => 1,
                         'dwt.h' => 1,
                         'event.h' => 1,
                         'image.h' => 1,
                         'j2k.h' => 1,
                         'j2k_lib.h' => 1,
                         'jp2.h' => 1,
                         'jpt.h' => 1,
                         'mct.h' => 1,
                         'mqc.h' => 1,
                         'openjpeg.h' => 1,
                         'pi.h' => 1,
                         'raw.h' => 1,
                         't1.h' => 1,
                         't2.h' => 1,
                         'tcd.h' => 1,
                         'tgt.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjpeg.so',
          'LibraryVersion' => '1.2',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'bio.c' => 1,
                         'cio.c' => 1,
                         'dwt.c' => 1,
                         'event.c' => 1,
                         'image.c' => 1,
                         'j2k.c' => 1,
                         'j2k_lib.c' => 1,

                                               'opj_setup_decoder' => 1,
                                               'opj_setup_encoder' => 1,
                                               'opj_version' => 1,
                                               'pi_check_next_level' => 1,
                                               'pi_create_decode' => 1,
                                               'pi_create_encode' => 1,
                                               'pi_destroy' => 1,
                                               'pi_initialise_encode' => 1,
                                               'pi_next' => 1,
                                               'raw_create' => 1,
                                               'raw_decode' => 1,
                                               'raw_destroy' => 1,
                                               'raw_init_dec' => 1,
                                               'raw_numbytes' => 1,
                                               't1_create' => 1,
                                               't1_decode_cblks' => 1,
                                               't1_destroy' => 1,
                                               't1_encode_cblks' => 1,
                                               't2_create' => 1,
                                               't2_decode_packets' => 1,
                                               't2_destroy' => 1,
                                               't2_encode_packets' => 1,
                                               'tcd_create' => 1,
                                               'tcd_decode_tile' => 1,
                                               'tcd_destroy' => 1,
                                               'tcd_dump' => 1,
                                               'tcd_encode_tile' => 1,
                                               'tcd_free_decode' => 1,
                                               'tcd_free_encode' => 1,
                                               'tcd_init_encode' => 1,
                                               'tcd_makelayer' => 1,
                                               'tcd_makelayer_fixed' => 1,
                                               'tcd_malloc_decode' => 1,
                                               'tcd_malloc_encode' => 1,
                                               'tcd_rateallocate' => 1,
                                               'tcd_rateallocate_fixed' => 1,
                                               'tgt_create' => 1,
                                               'tgt_decode' => 1,
                                               'tgt_destroy' => 1,
                                               'tgt_encode' => 1,
                                               'tgt_reset' => 1,
                                               'tgt_setvalue' => 1
                                             }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '109331' => {
                                        'Header' => 't2.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cinfo',
                                                             'offset' => '0',
                                                             'type' => '3487'
                                                           },
                                                    '1' => {
                                                             'name' => 'image',
                                                             'offset' => '8',
                                                             'type' => '5600'
                                                           },
                                                    '2' => {
                                                             'name' => 'cp',
                                                             'offset' => '16',
                                                             'type' => '5606'
                                                           }
                                                  },
                                        'Name' => 'struct opj_t2',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '109379' => {
                                        'BaseType' => '109331',
                                        'Header' => 't2.h',
                                        'Line' => '53',
                                        'Name' => 'opj_t2_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '112' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '113319' => {
                                        'BaseType' => '109379',
                                        'Name' => 'opj_t2_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '137' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '148' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '84',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '170' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '177' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '18031' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '561',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '18154' => {
                                       'BaseType' => '18031',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '580',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '184' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '77'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '150'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '150'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '150'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '624'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '630'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '77'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '77'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '126'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '105'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '636'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '150'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '652'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '137'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '148'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '148'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '148'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '148'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '77'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '658'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '150'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '150'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '150'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '150'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '150'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '150'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '150'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '1858' => {
                                      'BaseType' => '1864',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '18580' => {
                                       'BaseType' => '18154',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1864' => {
                                      'BaseType' => '84',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '18850' => {
                                       'BaseType' => '184',
                                       'Header' => 'stdio.h',
                                       'Line' => '48',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '1941' => {
                                      'BaseType' => '77',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20202' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '243',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '77'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '2604'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '3316'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '4792',
                                                             'type' => '77'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '4796',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '4800',
                                                             'type' => '3332'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '5200',
                                                             'type' => '3332'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '5600',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '5604',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '5608',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '5612',
                                                             'type' => '77'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '5616',
                                                             'type' => '77'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '5620',
                                                             'type' => '77'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '5624',
                                                             'type' => '77'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '5628',
                                                             'type' => '77'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '5632',
                                                             'type' => '3348'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '5764',
                                                             'type' => '3348'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '5896',
                                                             'type' => '21029'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '9992',
                                                             'type' => '21029'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '14088',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '14092',
                                                             'type' => '21029'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '18188',
                                                             'type' => '77'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '18192',
                                                             'type' => '77'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '18196',
                                                             'type' => '77'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '18200',
                                                             'type' => '77'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '18204',
                                                             'type' => '77'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '18208',
                                                             'type' => '77'
                                                           },
                                                   '37' => {
                                                             'name' => 'jpwl_epc_on',
                                                             'offset' => '18212',
                                                             'type' => '77'
                                                           },
                                                   '38' => {
                                                             'name' => 'jpwl_hprot_MH',
                                                             'offset' => '18216',
                                                             'type' => '77'
                                                           },
                                                   '39' => {
                                                             'name' => 'jpwl_hprot_TPH_tileno',
                                                             'offset' => '18220',
                                                             'type' => '21046'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '40' => {
                                                             'name' => 'jpwl_hprot_TPH',
                                                             'offset' => '18284',
                                                             'type' => '21046'
                                                           },
                                                   '41' => {
                                                             'name' => 'jpwl_pprot_tileno',
                                                             'offset' => '18348',
                                                             'type' => '21046'
                                                           },
                                                   '42' => {
                                                             'name' => 'jpwl_pprot_packno',
                                                             'offset' => '18412',
                                                             'type' => '21046'
                                                           },
                                                   '43' => {
                                                             'name' => 'jpwl_pprot',
                                                             'offset' => '18476',
                                                             'type' => '21046'
                                                           },
                                                   '44' => {
                                                             'name' => 'jpwl_sens_size',
                                                             'offset' => '18540',
                                                             'type' => '77'
                                                           },
                                                   '45' => {
                                                             'name' => 'jpwl_sens_addr',
                                                             'offset' => '18544',
                                                             'type' => '77'
                                                           },
                                                   '46' => {
                                                             'name' => 'jpwl_sens_range',
                                                             'offset' => '18548',
                                                             'type' => '77'
                                                           },
                                                   '47' => {
                                                             'name' => 'jpwl_sens_MH',
                                                             'offset' => '18552',
                                                             'type' => '77'
                                                           },
                                                   '48' => {
                                                             'name' => 'jpwl_sens_TPH_tileno',
                                                             'offset' => '18556',
                                                             'type' => '21046'
                                                           },
                                                   '49' => {
                                                             'name' => 'jpwl_sens_TPH',
                                                             'offset' => '18620',
                                                             'type' => '21046'
                                                           },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '50' => {
                                                             'name' => 'cp_cinema',
                                                             'offset' => '18684',
                                                             'type' => '2544'
                                                           },
                                                   '51' => {
                                                             'name' => 'max_comp_size',
                                                             'offset' => '18688',
                                                             'type' => '77'
                                                           },
                                                   '52' => {
                                                             'name' => 'cp_rsiz',
                                                             'offset' => '18692',
                                                             'type' => '2496'
                                                           },
                                                   '53' => {
                                                             'name' => 'tp_on',
                                                             'offset' => '18696',
                                                             'type' => '84'
                                                           },
                                                   '54' => {
                                                             'name' => 'tp_flag',
                                                             'offset' => '18697',
                                                             'type' => '84'
                                                           },
                                                   '55' => {
                                                             'name' => 'tcp_mct',
                                                             'offset' => '18698',
                                                             'type' => '84'
                                                           },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '1941'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '18704',
                                       'Type' => 'Struct'
                                     },
                          '21029' => {
                                       'BaseType' => '84',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '21046' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[16]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '21062' => {
                                       'BaseType' => '20202',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '367',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '18704',
                                       'Type' => 'Typedef'
                                     },
                          '21074' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '21029'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '21029'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'jpwl_correct',
                                                            'offset' => '8208',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'jpwl_exp_comps',
                                                            'offset' => '8212',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'jpwl_max_tiles',
                                                            'offset' => '8216',
                                                            'type' => '77'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_limit_decoding',
                                                            'offset' => '8220',
                                                            'type' => '2742'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8224',
                                       'Type' => 'Struct'
                                     },
                          '21226' => {
                                       'BaseType' => '21074',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '421',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8224',
                                       'Type' => 'Typedef'
                                     },
                          '21850' => {
                                       'Header' => 'j2k.h',
                                       'Line' => '110',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'THRESH_CALC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'FINAL_PASS',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum T2_MODE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '21875' => {
                                       'BaseType' => '21850',
                                       'Header' => 'j2k.h',
                                       'Line' => '113',
                                       'Name' => 'J2K_T2_MODE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '23608' => {
                                       'Header' => 'jpt.h',
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'Id',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_byte',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'Class_Id',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'CSn_Id',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'Msg_offset',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '5' => {
                                                            'name' => 'Msg_length',
                                                            'offset' => '20',
                                                            'type' => '98'
                                                          },
                                                   '6' => {
                                                            'name' => 'Layer_nb',
                                                            'offset' => '24',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct opj_jpt_msg_header',
                                       'Size' => '28',
                                       'Type' => 'Struct'
                                     },
                          '23704' => {
                                       'BaseType' => '23608',
                                       'Header' => 'jpt.h',
                                       'Line' => '57',
                                       'Name' => 'opj_jpt_msg_header_t',
                                       'Size' => '28',
                                       'Type' => 'Typedef'
                                     },
                          '23871' => {
                                       'Header' => 'pi.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'pdy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'pw',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'ph',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_resolution',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23930' => {
                                       'BaseType' => '23871',
                                       'Header' => 'pi.h',
                                       'Line' => '52',
                                       'Name' => 'opj_pi_resolution_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '23941' => {
                                       'Header' => 'pi.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'resolutions',
                                                            'offset' => '16',
                                                            'type' => '24000'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_comp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '24000' => {
                                       'BaseType' => '23930',
                                       'Name' => 'opj_pi_resolution_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24006' => {
                                       'BaseType' => '23941',
                                       'Header' => 'pi.h',
                                       'Line' => '62',
                                       'Name' => 'opj_pi_comp_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '24017' => {
                                       'Header' => 'pi.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tp_on',
                                                            'offset' => '0',
                                                            'type' => '84'
                                                          },
                                                   '1' => {
                                                            'name' => 'include',
                                                            'offset' => '8',
                                                            'type' => '24288'
                                                          },
                                                   '10' => {
                                                             'name' => 'first',
                                                             'offset' => '48',
                                                             'type' => '77'
                                                           },
                                                   '11' => {
                                                             'name' => 'poc',
                                                             'offset' => '52',
                                                             'type' => '3305'
                                                           },
                                                   '12' => {
                                                             'name' => 'numcomps',
                                                             'offset' => '200',
                                                             'type' => '77'
                                                           },
                                                   '13' => {
                                                             'name' => 'comps',
                                                             'offset' => '208',
                                                             'type' => '24294'
                                                           },
                                                   '14' => {
                                                             'name' => 'tx0',
                                                             'offset' => '216',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty0',
                                                             'offset' => '220',
                                                             'type' => '77'
                                                           },
                                                   '16' => {
                                                             'name' => 'tx1',
                                                             'offset' => '224',
                                                             'type' => '77'
                                                           },
                                                   '17' => {
                                                             'name' => 'ty1',
                                                             'offset' => '228',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'x',
                                                             'offset' => '232',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'y',
                                                             'offset' => '236',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'step_l',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'dx',
                                                             'offset' => '240',
                                                             'type' => '77'
                                                           },
                                                   '21' => {
                                                             'name' => 'dy',
                                                             'offset' => '244',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'step_r',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'step_c',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'step_p',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'compno',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'resno',
                                                            'offset' => '36',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'precno',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          },
                                                   '9' => {
                                                            'name' => 'layno',
                                                            'offset' => '44',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_iterator',
                                       'Size' => '248',
                                       'Type' => 'Struct'
                                     },
                          '24288' => {
                                       'BaseType' => '112',
                                       'Name' => 'short*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24294' => {
                                       'BaseType' => '24006',
                                       'Name' => 'opj_pi_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24300' => {
                                       'BaseType' => '24017',
                                       'Header' => 'pi.h',
                                       'Line' => '98',
                                       'Name' => 'opj_pi_iterator_t',
                                       'Size' => '248',
                                       'Type' => 'Typedef'
                                     },
                          '2465' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '117',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'STD_RSIZ',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'CINEMA2K',
                                                           'value' => '3'
                                                         },
                                                  '2' => {
                                                           'name' => 'CINEMA4K',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum RSIZ_CAPABILITIES',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2496' => {
                                      'BaseType' => '2465',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '121',
                                      'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2507' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '126',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'OFF',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'CINEMA2K_24',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'CINEMA2K_48',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'CINEMA4K_24',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum CINEMA_MODE',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '25346' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '9113'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbpix',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'distotile',
                                                            'offset' => '40',
                                                            'type' => '177'
                                                          },
                                                   '8' => {
                                                            'name' => 'distolayer',
                                                            'offset' => '48',
                                                            'type' => '25470'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd_tile',
                                       'Size' => '848',
                                       'Type' => 'Struct'
                                     },
                          '2544' => {
                                      'BaseType' => '2507',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '131',
                                      'Name' => 'OPJ_CINEMA_MODE',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '25470' => {
                                       'BaseType' => '177',
                                       'Name' => 'double[100]',
                                       'Size' => '800',
                                       'Type' => 'Array'
                                     },
                          '25486' => {
                                       'BaseType' => '25346',
                                       'Header' => 'tcd.h',
                                       'Line' => '147',
                                       'Name' => 'opj_tcd_tile_t',
                                       'Size' => '848',
                                       'Type' => 'Typedef'
                                     },
                          '25497' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tw',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'th',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'tiles',
                                                            'offset' => '8',
                                                            'type' => '25544'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd_image',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '25544' => {
                                       'BaseType' => '25486',
                                       'Name' => 'opj_tcd_tile_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2555' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '136',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PROG_UNKNOWN',
                                                           'value' => '18446744073709551615'
                                                         },
                                                  '1' => {
                                                           'name' => 'LRCP',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'RLCP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'RPCL',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'PCRL',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'CPRL',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum PROG_ORDER',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '25550' => {
                                       'BaseType' => '25497',
                                       'Header' => 'tcd.h',
                                       'Line' => '155',
                                       'Name' => 'opj_tcd_image_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '25561' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '160',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tp_pos',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'tp_num',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'tcp',
                                                             'offset' => '64',
                                                             'type' => '4776'
                                                           },
                                                   '11' => {
                                                             'name' => 'tcd_tileno',
                                                             'offset' => '72',
                                                             'type' => '77'
                                                           },
                                                   '12' => {
                                                             'name' => 'encoding_time',
                                                             'offset' => '80',
                                                             'type' => '177'
                                                           },
                                                   '2' => {
                                                            'name' => 'cur_tp_num',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'cur_totnum_tp',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'cur_pino',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cinfo',
                                                            'offset' => '24',
                                                            'type' => '3487'
                                                          },
                                                   '6' => {
                                                            'name' => 'tcd_image',
                                                            'offset' => '32',
                                                            'type' => '25729'
                                                          },
                                                   '7' => {
                                                            'name' => 'image',
                                                            'offset' => '40',
                                                            'type' => '5600'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp',
                                                            'offset' => '48',
                                                            'type' => '5606'
                                                          },
                                                   '9' => {
                                                            'name' => 'tcd_tile',
                                                            'offset' => '56',
                                                            'type' => '25544'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '25729' => {
                                       'BaseType' => '25550',
                                       'Name' => 'opj_tcd_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25735' => {
                                       'BaseType' => '25561',
                                       'Header' => 'tcd.h',
                                       'Line' => '188',
                                       'Name' => 'opj_tcd_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '2604' => {
                                      'BaseType' => '2555',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '143',
                                      'Name' => 'OPJ_PROG_ORDER',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2615' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '148',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'CLRSPC_UNKNOWN',
                                                           'value' => '18446744073709551615'
                                                         },
                                                  '1' => {
                                                           'name' => 'CLRSPC_SRGB',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'CLRSPC_GRAY',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'CLRSPC_SYCC',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum COLOR_SPACE',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2652' => {
                                      'BaseType' => '2615',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '153',
                                      'Name' => 'OPJ_COLOR_SPACE',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2663' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '158',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'CODEC_UNKNOWN',
                                                           'value' => '18446744073709551615'
                                                         },
                                                  '1' => {
                                                           'name' => 'CODEC_J2K',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'CODEC_JPT',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'CODEC_JP2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum CODEC_FORMAT',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2700' => {
                                      'BaseType' => '2663',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '163',
                                      'Name' => 'OPJ_CODEC_FORMAT',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2711' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '168',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'NO_LIMITATION',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LIMIT_TO_MAIN_HEADER',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'DECODE_ALL_BUT_PACKETS',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum LIMIT_DECODING',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2742' => {
                                      'BaseType' => '2711',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '172',
                                      'Name' => 'OPJ_LIMIT_DECODING',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2753' => {
                                      'BaseType' => '2764',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '185',
                                      'Name' => 'opj_msg_callback',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2764' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1858'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2786' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '196',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'error_handler',
                                                           'offset' => '0',
                                                           'type' => '2753'
                                                         },
                                                  '1' => {
                                                           'name' => 'warning_handler',
                                                           'offset' => '8',
                                                           'type' => '2753'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_handler',
                                                           'offset' => '16',
                                                           'type' => '2753'
                                                         }
                                                },
                                      'Name' => 'struct opj_event_mgr',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2835' => {
                                      'BaseType' => '2786',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '203',
                                      'Name' => 'opj_event_mgr_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '2846' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '215',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'resno0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'compno0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'progorder',
                                                            'offset' => '40',
                                                            'type' => '3289'
                                                          },
                                                  '11' => {
                                                            'name' => 'tile',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'tx0',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'tx1',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'ty0',
                                                            'offset' => '60',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'ty1',
                                                            'offset' => '64',
                                                            'type' => '77'
                                                          },
                                                  '16' => {
                                                            'name' => 'layS',
                                                            'offset' => '68',
                                                            'type' => '77'
                                                          },
                                                  '17' => {
                                                            'name' => 'resS',
                                                            'offset' => '72',
                                                            'type' => '77'
                                                          },
                                                  '18' => {
                                                            'name' => 'compS',
                                                            'offset' => '76',
                                                            'type' => '77'
                                                          },
                                                  '19' => {
                                                            'name' => 'prcS',
                                                            'offset' => '80',
                                                            'type' => '77'
                                                          },
                                                  '2' => {
                                                           'name' => 'layno1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '20' => {
                                                            'name' => 'layE',
                                                            'offset' => '84',
                                                            'type' => '77'
                                                          },
                                                  '21' => {
                                                            'name' => 'resE',
                                                            'offset' => '88',
                                                            'type' => '77'
                                                          },
                                                  '22' => {
                                                            'name' => 'compE',
                                                            'offset' => '92',
                                                            'type' => '77'
                                                          },
                                                  '23' => {
                                                            'name' => 'prcE',
                                                            'offset' => '96',
                                                            'type' => '77'
                                                          },
                                                  '24' => {
                                                            'name' => 'txS',
                                                            'offset' => '100',
                                                            'type' => '77'
                                                          },
                                                  '25' => {
                                                            'name' => 'txE',
                                                            'offset' => '104',
                                                            'type' => '77'
                                                          },
                                                  '26' => {
                                                            'name' => 'tyS',
                                                            'offset' => '108',
                                                            'type' => '77'
                                                          },
                                                  '27' => {
                                                            'name' => 'tyE',
                                                            'offset' => '112',
                                                            'type' => '77'
                                                          },
                                                  '28' => {
                                                            'name' => 'dx',
                                                            'offset' => '116',
                                                            'type' => '77'
                                                          },
                                                  '29' => {
                                                            'name' => 'dy',
                                                            'offset' => '120',
                                                            'type' => '77'
                                                          },
                                                  '3' => {
                                                           'name' => 'resno1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '30' => {
                                                            'name' => 'lay_t',
                                                            'offset' => '124',
                                                            'type' => '77'
                                                          },
                                                  '31' => {
                                                            'name' => 'res_t',
                                                            'offset' => '128',
                                                            'type' => '77'
                                                          },
                                                  '32' => {
                                                            'name' => 'comp_t',
                                                            'offset' => '132',
                                                            'type' => '77'
                                                          },
                                                  '33' => {
                                                            'name' => 'prc_t',
                                                            'offset' => '136',
                                                            'type' => '77'
                                                          },
                                                  '34' => {
                                                            'name' => 'tx0_t',
                                                            'offset' => '140',
                                                            'type' => '77'
                                                          },
                                                  '35' => {
                                                            'name' => 'ty0_t',
                                                            'offset' => '144',
                                                            'type' => '77'
                                                          },
                                                  '4' => {
                                                           'name' => 'compno1',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'layno0',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'precno0',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'precno1',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'prg1',
                                                           'offset' => '32',
                                                           'type' => '2604'
                                                         },
                                                  '9' => {
                                                           'name' => 'prg',
                                                           'offset' => '36',
                                                           'type' => '2604'
                                                         }
                                                },
                                      'Name' => 'struct opj_poc',
                                      'Size' => '148',
                                      'Type' => 'Struct'
                                    },
                          '31558' => {
                                       'BaseType' => '21062',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '31810' => {
                                       'BaseType' => '25735',
                                       'Name' => 'opj_tcd_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3289' => {
                                      'BaseType' => '84',
                                      'Name' => 'char[5]',
                                      'Size' => '5',
                                      'Type' => 'Array'
                                    },
                          '3305' => {
                                      'BaseType' => '2846',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '238',
                                      'Name' => 'opj_poc_t',
                                      'Size' => '148',
                                      'Type' => 'Typedef'
                                    },
                          '3316' => {
                                      'BaseType' => '3305',
                                      'Name' => 'opj_poc_t[32]',
                                      'Size' => '4736',
                                      'Type' => 'Array'
                                    },
                          '3332' => {
                                      'BaseType' => '170',
                                      'Name' => 'float[100]',
                                      'Size' => '400',
                                      'Type' => 'Array'
                                    },
                          '3348' => {
                                      'BaseType' => '77',
                                      'Name' => 'int[33]',
                                      'Size' => '132',
                                      'Type' => 'Array'
                                    },
                          '3364' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '438',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'event_mgr',
                                                           'offset' => '0',
                                                           'type' => '3469'
                                                         },
                                                  '1' => {
                                                           'name' => 'client_data',
                                                           'offset' => '8',
                                                           'type' => '148'
                                                         },
                                                  '2' => {
                                                           'name' => 'is_decompressor',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'codec_format',
                                                           'offset' => '20',
                                                           'type' => '2700'
                                                         },
                                                  '4' => {
                                                           'name' => 'j2k_handle',
                                                           'offset' => '24',
                                                           'type' => '148'
                                                         },
                                                  '5' => {
                                                           'name' => 'jp2_handle',
                                                           'offset' => '32',
                                                           'type' => '148'
                                                         },
                                                  '6' => {
                                                           'name' => 'mj2_handle',
                                                           'offset' => '40',
                                                           'type' => '148'
                                                         }
                                                },
                                      'Name' => 'struct opj_common_struct',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '3469' => {
                                      'BaseType' => '2835',
                                      'Name' => 'opj_event_mgr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3475' => {
                                      'BaseType' => '3364',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '444',
                                      'Name' => 'opj_common_struct_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '3487' => {
                                      'BaseType' => '3499',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '446',
                                      'Name' => 'opj_common_ptr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3499' => {
                                      'BaseType' => '3475',
                                      'Name' => 'opj_common_struct_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3505' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '483',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3487'
                                                         },
                                                  '1' => {
                                                           'name' => 'openmode',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'buffer',
                                                           'offset' => '16',
                                                           'type' => '674'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'start',
                                                           'offset' => '32',
                                                           'type' => '674'
                                                         },
                                                  '5' => {
                                                           'name' => 'end',
                                                           'offset' => '40',
                                                           'type' => '674'
                                                         },
                                                  '6' => {
                                                           'name' => 'bp',
                                                           'offset' => '48',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_cio',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3615' => {
                                      'BaseType' => '3505',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '500',
                                      'Name' => 'opj_cio_t',
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '3627' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '511',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dx',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'dy',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'factor',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'data',
                                                            'offset' => '48',
                                                            'type' => '1941'
                                                          },
                                                  '2' => {
                                                           'name' => 'w',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'h',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'x0',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'y0',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'prec',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'bpp',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'sgnd',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'resno_decoded',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_image_comp',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3789' => {
                                      'BaseType' => '3627',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '536',
                                      'Name' => 'opj_image_comp_t',
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '3801' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '541',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numcomps',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'color_space',
                                                           'offset' => '20',
                                                           'type' => '2652'
                                                         },
                                                  '6' => {
                                                           'name' => 'comps',
                                                           'offset' => '24',
                                                           'type' => '3902'
                                                         }
                                                },
                                      'Name' => 'struct opj_image',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3902' => {
                                      'BaseType' => '3789',
                                      'Name' => 'opj_image_comp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3908' => {
                                      'BaseType' => '3801',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '556',
                                      'Name' => 'opj_image_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '3920' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '118',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expn',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'mant',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_stepsize',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '3957' => {
                                      'BaseType' => '3920',
                                      'Header' => 'j2k.h',
                                      'Line' => '123',
                                      'Name' => 'opj_stepsize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3968' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'csty',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'numresolutions',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'prcw',
                                                            'offset' => '812',
                                                            'type' => '3348'
                                                          },
                                                  '11' => {
                                                            'name' => 'prch',
                                                            'offset' => '944',
                                                            'type' => '3348'
                                                          },
                                                  '2' => {
                                                           'name' => 'cblkw',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'cblkh',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'cblksty',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'qmfbid',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'qntsty',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'stepsizes',
                                                           'offset' => '28',
                                                           'type' => '4130'
                                                         },
                                                  '8' => {
                                                           'name' => 'numgbits',
                                                           'offset' => '804',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'roishift',
                                                           'offset' => '808',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tccp',
                                      'Size' => '1076',
                                      'Type' => 'Struct'
                                    },
                          '40560' => {
                                       'BaseType' => '18850',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4130' => {
                                      'BaseType' => '3957',
                                      'Name' => 'opj_stepsize_t[97]',
                                      'Size' => '776',
                                      'Type' => 'Array'
                                    },
                          '4146' => {
                                      'BaseType' => '3968',
                                      'Header' => 'j2k.h',
                                      'Line' => '153',
                                      'Name' => 'opj_tccp_t',
                                      'Size' => '1076',
                                      'Type' => 'Typedef'
                                    },
                          '4157' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '160',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'first',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'csty',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'ppt_data_first',
                                                            'offset' => '5176',
                                                            'type' => '674'
                                                          },
                                                  '11' => {
                                                            'name' => 'ppt',
                                                            'offset' => '5184',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'ppt_store',
                                                            'offset' => '5188',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'ppt_len',
                                                            'offset' => '5192',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'distoratio',
                                                            'offset' => '5196',
                                                            'type' => '3332'
                                                          },
                                                  '15' => {
                                                            'name' => 'tccps',
                                                            'offset' => '5600',
                                                            'type' => '4373'
                                                          },
                                                  '2' => {
                                                           'name' => 'prg',
                                                           'offset' => '8',
                                                           'type' => '2604'
                                                         },
                                                  '3' => {
                                                           'name' => 'numlayers',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'mct',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'rates',
                                                           'offset' => '20',
                                                           'type' => '3332'
                                                         },
                                                  '6' => {
                                                           'name' => 'numpocs',
                                                           'offset' => '420',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'POC',
                                                           'offset' => '424',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'pocs',
                                                           'offset' => '428',
                                                           'type' => '3316'
                                                         },
                                                  '9' => {
                                                           'name' => 'ppt_data',
                                                           'offset' => '5168',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcp',
                                      'Size' => '5608',
                                      'Type' => 'Struct'
                                    },
                          '43203' => {
                                       'BaseType' => '24300',
                                       'Name' => 'opj_pi_iterator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4373' => {
                                      'BaseType' => '4146',
                                      'Name' => 'opj_tccp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '43754' => {
                                       'BaseType' => '21226',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4379' => {
                                      'BaseType' => '4157',
                                      'Header' => 'j2k.h',
                                      'Line' => '193',
                                      'Name' => 'opj_tcp_t',
                                      'Size' => '5608',
                                      'Type' => 'Typedef'
                                    },
                          '4390' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '198',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinema',
                                                           'offset' => '0',
                                                           'type' => '2544'
                                                         },
                                                  '1' => {
                                                           'name' => 'max_comp_size',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'reduce',
                                                            'offset' => '36',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'layer',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'limit_decoding',
                                                            'offset' => '44',
                                                            'type' => '2742'
                                                          },
                                                  '13' => {
                                                            'name' => 'index_on',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'tx0',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'ty0',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          },
                                                  '16' => {
                                                            'name' => 'tdx',
                                                            'offset' => '60',
                                                            'type' => '77'
                                                          },
                                                  '17' => {
                                                            'name' => 'tdy',
                                                            'offset' => '64',
                                                            'type' => '77'
                                                          },
                                                  '18' => {
                                                            'name' => 'comment',
                                                            'offset' => '72',
                                                            'type' => '150'
                                                          },
                                                  '19' => {
                                                            'name' => 'tw',
                                                            'offset' => '80',
                                                            'type' => '77'
                                                          },
                                                  '2' => {
                                                           'name' => 'img_size',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '20' => {
                                                            'name' => 'th',
                                                            'offset' => '84',
                                                            'type' => '77'
                                                          },
                                                  '21' => {
                                                            'name' => 'tileno',
                                                            'offset' => '88',
                                                            'type' => '1941'
                                                          },
                                                  '22' => {
                                                            'name' => 'tileno_size',
                                                            'offset' => '96',
                                                            'type' => '77'
                                                          },
                                                  '23' => {
                                                            'name' => 'ppm_data',
                                                            'offset' => '104',
                                                            'type' => '674'
                                                          },
                                                  '24' => {
                                                            'name' => 'ppm_data_first',
                                                            'offset' => '112',
                                                            'type' => '674'
                                                          },
                                                  '25' => {
                                                            'name' => 'ppm',
                                                            'offset' => '120',
                                                            'type' => '77'
                                                          },
                                                  '26' => {
                                                            'name' => 'ppm_store',
                                                            'offset' => '124',
                                                            'type' => '77'
                                                          },
                                                  '27' => {
                                                            'name' => 'ppm_previous',
                                                            'offset' => '128',
                                                            'type' => '77'
                                                          },
                                                  '28' => {
                                                            'name' => 'ppm_len',
                                                            'offset' => '132',
                                                            'type' => '77'
                                                          },
                                                  '29' => {
                                                            'name' => 'tcps',
                                                            'offset' => '136',
                                                            'type' => '4776'
                                                          },
                                                  '3' => {
                                                           'name' => 'rsiz',
                                                           'offset' => '12',
                                                           'type' => '2496'
                                                         },
                                                  '30' => {
                                                            'name' => 'matrice',
                                                            'offset' => '144',
                                                            'type' => '1941'
                                                          },
                                                  '4' => {
                                                           'name' => 'tp_on',
                                                           'offset' => '16',
                                                           'type' => '84'
                                                         },
                                                  '5' => {
                                                           'name' => 'tp_flag',
                                                           'offset' => '17',
                                                           'type' => '84'
                                                         },
                                                  '6' => {
                                                           'name' => 'tp_pos',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'disto_alloc',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'fixed_alloc',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'fixed_quality',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_cp',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '212',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4776' => {
                                      'BaseType' => '4379',
                                      'Name' => 'opj_tcp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4782' => {
                                      'BaseType' => '4390',
                                      'Header' => 'j2k.h',
                                      'Line' => '305',
                                      'Name' => 'opj_cp_t',
                                      'Size' => '152',
                                      'Type' => 'Typedef'
                                    },
                          '4794' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '310',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'start_pos',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'end_pos',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'disto',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         }
                                                },
                                      'Name' => 'struct opj_packet_info',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '48142' => {
                                       'BaseType' => '23704',
                                       'Name' => 'opj_jpt_msg_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4847' => {
                                      'BaseType' => '4794',
                                      'Header' => 'j2k.h',
                                      'Line' => '317',
                                      'Name' => 'opj_packet_info_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '4859' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '322',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'thresh',
                                                           'offset' => '0',
                                                           'type' => '5033'
                                                         },
                                                  '1' => {
                                                           'name' => 'num_tile',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'nbpix',
                                                            'offset' => '560',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'distotile',
                                                            'offset' => '568',
                                                            'type' => '177'
                                                          },
                                                  '2' => {
                                                           'name' => 'start_pos',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'end_header',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'end_pos',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'pw',
                                                           'offset' => '24',
                                                           'type' => '3348'
                                                         },
                                                  '6' => {
                                                           'name' => 'ph',
                                                           'offset' => '156',
                                                           'type' => '3348'
                                                         },
                                                  '7' => {
                                                           'name' => 'pdx',
                                                           'offset' => '288',
                                                           'type' => '3348'
                                                         },
                                                  '8' => {
                                                           'name' => 'pdy',
                                                           'offset' => '420',
                                                           'type' => '3348'
                                                         },
                                                  '9' => {
                                                           'name' => 'packet',
                                                           'offset' => '552',
                                                           'type' => '5039'
                                                         }
                                                },
                                      'Name' => 'struct opj_tile_info',
                                      'Size' => '576',
                                      'Type' => 'Struct'
                                    },
                          '5033' => {
                                      'BaseType' => '177',
                                      'Name' => 'double*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5039' => {
                                      'BaseType' => '4847',
                                      'Name' => 'opj_packet_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5045' => {
                                      'BaseType' => '4859',
                                      'Header' => 'j2k.h',
                                      'Line' => '347',
                                      'Name' => 'opj_tile_info_t',
                                      'Size' => '576',
                                      'Type' => 'Typedef'
                                    },
                          '5057' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '352',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'index_on',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'D_max',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '10' => {
                                                            'name' => 'tile_Oy',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'tw',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'th',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'comp',
                                                            'offset' => '60',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'layer',
                                                            'offset' => '64',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'decomposition',
                                                            'offset' => '68',
                                                            'type' => '77'
                                                          },
                                                  '16' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '72',
                                                            'type' => '77'
                                                          },
                                                  '17' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '76',
                                                            'type' => '77'
                                                          },
                                                  '18' => {
                                                            'name' => 'tile',
                                                            'offset' => '80',
                                                            'type' => '5316'
                                                          },
                                                  '2' => {
                                                           'name' => 'num',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'index_write',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'image_w',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'image_h',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'prog',
                                                           'offset' => '32',
                                                           'type' => '2604'
                                                         },
                                                  '7' => {
                                                           'name' => 'tile_x',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'tile_y',
                                                           'offset' => '40',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'tile_Ox',
                                                           'offset' => '44',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_image_info',
                                      'Size' => '88',
                                      'Type' => 'Struct'
                                    },
                          '5316' => {
                                      'BaseType' => '5045',
                                      'Name' => 'opj_tile_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5322' => {
                                      'BaseType' => '5057',
                                      'Header' => 'j2k.h',
                                      'Line' => '391',
                                      'Name' => 'opj_image_info_t',
                                      'Size' => '88',
                                      'Type' => 'Typedef'
                                    },
                          '5334' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '396',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3487'
                                                         },
                                                  '1' => {
                                                           'name' => 'state',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'sod_start',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'pos_correction',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'tile_data',
                                                            'offset' => '64',
                                                            'type' => '5594'
                                                          },
                                                  '13' => {
                                                            'name' => 'tile_len',
                                                            'offset' => '72',
                                                            'type' => '1941'
                                                          },
                                                  '14' => {
                                                            'name' => 'default_tcp',
                                                            'offset' => '80',
                                                            'type' => '4776'
                                                          },
                                                  '15' => {
                                                            'name' => 'image',
                                                            'offset' => '88',
                                                            'type' => '5600'
                                                          },
                                                  '16' => {
                                                            'name' => 'cp',
                                                            'offset' => '96',
                                                            'type' => '5606'
                                                          },
                                                  '17' => {
                                                            'name' => 'image_info',
                                                            'offset' => '104',
                                                            'type' => '5612'
                                                          },
                                                  '18' => {
                                                            'name' => 'cio',
                                                            'offset' => '112',
                                                            'type' => '5618'
                                                          },
                                                  '2' => {
                                                           'name' => 'curtileno',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'tp_num',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'cur_tp_num',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'cur_totnum_tp',
                                                           'offset' => '24',
                                                           'type' => '1941'
                                                         },
                                                  '6' => {
                                                           'name' => 'tlm_start',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'totnum_tp',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'eot',
                                                           'offset' => '40',
                                                           'type' => '674'
                                                         },
                                                  '9' => {
                                                           'name' => 'sot_start',
                                                           'offset' => '48',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_j2k',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '55802' => {
                                       'BaseType' => '5960',
                                       'Name' => 'opj_jp2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5594' => {
                                      'BaseType' => '674',
                                      'Name' => 'unsigned char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5600' => {
                                      'BaseType' => '3908',
                                      'Name' => 'opj_image_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5606' => {
                                      'BaseType' => '4782',
                                      'Name' => 'opj_cp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5612' => {
                                      'BaseType' => '5322',
                                      'Name' => 'opj_image_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5618' => {
                                      'BaseType' => '3615',
                                      'Name' => 'opj_cio_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5624' => {
                                      'BaseType' => '5334',
                                      'Header' => 'j2k.h',
                                      'Line' => '451',
                                      'Name' => 'opj_j2k_t',
                                      'Size' => '120',
                                      'Type' => 'Typedef'
                                    },
                          '5636' => {
                                      'Header' => 'jp2.h',
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'depth',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'sgnd',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'bpcc',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_jp2_comps',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '568' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '5685' => {
                                      'BaseType' => '5636',
                                      'Header' => 'jp2.h',
                                      'Line' => '62',
                                      'Name' => 'opj_jp2_comps_t',
                                      'Size' => '12',
                                      'Type' => 'Typedef'
                                    },
                          '5696' => {
                                      'Header' => 'jp2.h',
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3487'
                                                         },
                                                  '1' => {
                                                           'name' => 'j2k',
                                                           'offset' => '8',
                                                           'type' => '5942'
                                                         },
                                                  '10' => {
                                                            'name' => 'approx',
                                                            'offset' => '48',
                                                            'type' => '98'
                                                          },
                                                  '11' => {
                                                            'name' => 'enumcs',
                                                            'offset' => '52',
                                                            'type' => '98'
                                                          },
                                                  '12' => {
                                                            'name' => 'precedence',
                                                            'offset' => '56',
                                                            'type' => '98'
                                                          },
                                                  '13' => {
                                                            'name' => 'brand',
                                                            'offset' => '60',
                                                            'type' => '98'
                                                          },
                                                  '14' => {
                                                            'name' => 'minversion',
                                                            'offset' => '64',
                                                            'type' => '98'
                                                          },
                                                  '15' => {
                                                            'name' => 'numcl',
                                                            'offset' => '68',
                                                            'type' => '98'
                                                          },
                                                  '16' => {
                                                            'name' => 'cl',
                                                            'offset' => '72',
                                                            'type' => '5948'
                                                          },
                                                  '17' => {
                                                            'name' => 'comps',
                                                            'offset' => '80',
                                                            'type' => '5954'
                                                          },
                                                  '18' => {
                                                            'name' => 'j2k_codestream_offset',
                                                            'offset' => '88',
                                                            'type' => '98'
                                                          },
                                                  '19' => {
                                                            'name' => 'j2k_codestream_length',
                                                            'offset' => '92',
                                                            'type' => '98'
                                                          },
                                                  '2' => {
                                                           'name' => 'w',
                                                           'offset' => '16',
                                                           'type' => '98'
                                                         },
                                                  '3' => {
                                                           'name' => 'h',
                                                           'offset' => '20',
                                                           'type' => '98'
                                                         },
                                                  '4' => {
                                                           'name' => 'numcomps',
                                                           'offset' => '24',
                                                           'type' => '98'
                                                         },
                                                  '5' => {
                                                           'name' => 'bpc',
                                                           'offset' => '28',
                                                           'type' => '98'
                                                         },
                                                  '6' => {
                                                           'name' => 'C',
                                                           'offset' => '32',
                                                           'type' => '98'
                                                         },
                                                  '7' => {
                                                           'name' => 'UnkC',
                                                           'offset' => '36',
                                                           'type' => '98'
                                                         },
                                                  '8' => {
                                                           'name' => 'IPR',
                                                           'offset' => '40',
                                                           'type' => '98'
                                                         },
                                                  '9' => {
                                                           'name' => 'meth',
                                                           'offset' => '44',
                                                           'type' => '98'
                                                         }
                                                },
                                      'Name' => 'struct opj_jp2',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '575' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '624'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '630'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '5942' => {
                                      'BaseType' => '5624',
                                      'Name' => 'opj_j2k_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5948' => {
                                      'BaseType' => '98',
                                      'Name' => 'unsigned int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5954' => {
                                      'BaseType' => '5685',
                                      'Name' => 'opj_jp2_comps_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5960' => {
                                      'BaseType' => '5696',
                                      'Header' => 'jp2.h',
                                      'Line' => '90',
                                      'Name' => 'opj_jp2_t',
                                      'Size' => '96',
                                      'Type' => 'Typedef'
                                    },
                          '624' => {
                                     'BaseType' => '575',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '630' => {
                                     'BaseType' => '184',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '636' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '652' => {
                                     'BaseType' => '568',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '658' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '674' => {
                                     'BaseType' => '91',
                                     'Name' => 'unsigned char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '67777' => {
                                       'Header' => 'mqc.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qeval',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'mps',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'nmps',
                                                            'offset' => '8',
                                                            'type' => '67838'
                                                          },
                                                   '3' => {
                                                            'name' => 'nlps',
                                                            'offset' => '16',
                                                            'type' => '67838'
                                                          }
                                                 },
                                       'Name' => 'struct opj_mqc_state',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '67838' => {
                                       'BaseType' => '67777',
                                       'Name' => 'struct opj_mqc_state*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67844' => {
                                       'BaseType' => '67777',
                                       'Header' => 'mqc.h',
                                       'Line' => '57',
                                       'Name' => 'opj_mqc_state_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '67855' => {
                                       'Header' => 'mqc.h',
                                       'Line' => '64',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'c',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'a',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'ct',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'bp',
                                                            'offset' => '16',
                                                            'type' => '674'
                                                          },
                                                   '4' => {
                                                            'name' => 'start',
                                                            'offset' => '24',
                                                            'type' => '674'
                                                          },
                                                   '5' => {
                                                            'name' => 'end',
                                                            'offset' => '32',
                                                            'type' => '674'
                                                          },
                                                   '6' => {
                                                            'name' => 'ctxs',
                                                            'offset' => '40',
                                                            'type' => '67960'
                                                          },
                                                   '7' => {
                                                            'name' => 'curctx',
                                                            'offset' => '296',
                                                            'type' => '67982'
                                                          }
                                                 },
                                       'Name' => 'struct opj_mqc',
                                       'Size' => '304',
                                       'Type' => 'Struct'
                                     },
                          '67960' => {
                                       'BaseType' => '67976',
                                       'Name' => 'opj_mqc_state_t*[32]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '67976' => {
                                       'BaseType' => '67844',
                                       'Name' => 'opj_mqc_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67982' => {
                                       'BaseType' => '67976',
                                       'Name' => 'opj_mqc_state_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67988' => {
                                       'BaseType' => '67855',
                                       'Header' => 'mqc.h',
                                       'Line' => '73',
                                       'Name' => 'opj_mqc_t',
                                       'Size' => '304',
                                       'Type' => 'Typedef'
                                     },
                          '67999' => {
                                       'BaseType' => '67988',
                                       'Name' => 'opj_mqc_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '680' => {
                                     'Header' => 'bio.h',
                                     'Line' => '47',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'start',
                                                          'offset' => '0',
                                                          'type' => '674'
                                                        },
                                                 '1' => {
                                                          'name' => 'end',
                                                          'offset' => '8',
                                                          'type' => '674'
                                                        },
                                                 '2' => {
                                                          'name' => 'bp',
                                                          'offset' => '16',
                                                          'type' => '674'
                                                        },
                                                 '3' => {
                                                          'name' => 'buf',
                                                          'offset' => '24',
                                                          'type' => '98'
                                                        },
                                                 '4' => {
                                                          'name' => 'ct',
                                                          'offset' => '28',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct opj_bio',
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '73131' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '451',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_mgr',
                                                            'offset' => '0',
                                                            'type' => '3469'
                                                          },
                                                   '1' => {
                                                            'name' => 'client_data',
                                                            'offset' => '8',
                                                            'type' => '148'
                                                          },
                                                   '2' => {
                                                            'name' => 'is_decompressor',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'codec_format',
                                                            'offset' => '20',
                                                            'type' => '2700'
                                                          },
                                                   '4' => {
                                                            'name' => 'j2k_handle',
                                                            'offset' => '24',
                                                            'type' => '148'
                                                          },
                                                   '5' => {
                                                            'name' => 'jp2_handle',
                                                            'offset' => '32',
                                                            'type' => '148'
                                                          },
                                                   '6' => {
                                                            'name' => 'mj2_handle',
                                                            'offset' => '40',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cinfo',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '73236' => {
                                       'BaseType' => '73131',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '455',
                                       'Name' => 'opj_cinfo_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '73248' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '460',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_mgr',
                                                            'offset' => '0',
                                                            'type' => '3469'
                                                          },
                                                   '1' => {
                                                            'name' => 'client_data',
                                                            'offset' => '8',
                                                            'type' => '148'
                                                          },
                                                   '2' => {
                                                            'name' => 'is_decompressor',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'codec_format',
                                                            'offset' => '20',
                                                            'type' => '2700'
                                                          },
                                                   '4' => {
                                                            'name' => 'j2k_handle',
                                                            'offset' => '24',
                                                            'type' => '148'
                                                          },
                                                   '5' => {
                                                            'name' => 'jp2_handle',
                                                            'offset' => '32',
                                                            'type' => '148'
                                                          },
                                                   '6' => {
                                                            'name' => 'mj2_handle',
                                                            'offset' => '40',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dinfo',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '73353' => {
                                       'BaseType' => '73248',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '464',
                                       'Name' => 'opj_dinfo_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '751' => {
                                     'BaseType' => '680',
                                     'Header' => 'bio.h',
                                     'Line' => '58',
                                     'Name' => 'opj_bio_t',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '76064' => {
                                       'BaseType' => '73353',
                                       'Name' => 'opj_dinfo_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76567' => {
                                       'BaseType' => '73236',
                                       'Name' => 'opj_cinfo_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7922' => {
                                      'Header' => 'tgt.h',
                                      'Line' => '48',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent',
                                                           'offset' => '0',
                                                           'type' => '7983'
                                                         },
                                                  '1' => {
                                                           'name' => 'value',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'low',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'known',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tgt_node',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7983' => {
                                      'BaseType' => '7922',
                                      'Name' => 'struct opj_tgt_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7989' => {
                                      'BaseType' => '7922',
                                      'Header' => 'tgt.h',
                                      'Line' => '53',
                                      'Name' => 'opj_tgt_node_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '8000' => {
                                      'Header' => 'tgt.h',
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numleafsh',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'numleafsv',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'numnodes',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'nodes',
                                                           'offset' => '16',
                                                           'type' => '8061'
                                                         }
                                                },
                                      'Name' => 'struct opj_tgt_tree',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8061' => {
                                      'BaseType' => '7989',
                                      'Name' => 'opj_tgt_node_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8067' => {
                                      'BaseType' => '8000',
                                      'Header' => 'tgt.h',
                                      'Line' => '63',
                                      'Name' => 'opj_tgt_tree_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '8078' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '47',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '674'
                                                         },
                                                  '3' => {
                                                           'name' => 'maxpasses',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numnewpasses',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'newlen',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_seg',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '809' => {
                                     'BaseType' => '751',
                                     'Name' => 'opj_bio_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '8163' => {
                                      'BaseType' => '8078',
                                      'Header' => 'tcd.h',
                                      'Line' => '54',
                                      'Name' => 'opj_tcd_seg_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '8174' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '59',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rate',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'distortiondec',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '2' => {
                                                           'name' => 'term',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'len',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_pass',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8235' => {
                                      'BaseType' => '8174',
                                      'Header' => 'tcd.h',
                                      'Line' => '63',
                                      'Name' => 'opj_tcd_pass_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '8246' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '68',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'disto',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '16',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_layer',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8307' => {
                                      'BaseType' => '8246',
                                      'Header' => 'tcd.h',
                                      'Line' => '73',
                                      'Name' => 'opj_tcd_layer_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '8318' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '78',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'segs',
                                                            'offset' => '40',
                                                            'type' => '8525'
                                                          },
                                                  '11' => {
                                                            'name' => 'data',
                                                            'offset' => '3240',
                                                            'type' => '8541'
                                                          },
                                                  '12' => {
                                                            'name' => 'numpassesinlayers',
                                                            'offset' => '11432',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'layers',
                                                            'offset' => '11440',
                                                            'type' => '8558'
                                                          },
                                                  '14' => {
                                                            'name' => 'totalpasses',
                                                            'offset' => '13840',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'passes',
                                                            'offset' => '13848',
                                                            'type' => '8574'
                                                          },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numbps',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'numlenbits',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'len',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'numnewpasses',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'numsegs',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_cblk',
                                      'Size' => '16248',
                                      'Type' => 'Struct'
                                    },
                          '84' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8525' => {
                                      'BaseType' => '8163',
                                      'Name' => 'opj_tcd_seg_t[100]',
                                      'Size' => '3200',
                                      'Type' => 'Array'
                                    },
                          '8541' => {
                                      'BaseType' => '91',
                                      'Name' => 'unsigned char[8192]',
                                      'Size' => '8192',
                                      'Type' => 'Array'
                                    },
                          '8558' => {
                                      'BaseType' => '8307',
                                      'Name' => 'opj_tcd_layer_t[100]',
                                      'Size' => '2400',
                                      'Type' => 'Array'
                                    },
                          '8574' => {
                                      'BaseType' => '8235',
                                      'Name' => 'opj_tcd_pass_t[100]',
                                      'Size' => '2400',
                                      'Type' => 'Array'
                                    },
                          '8590' => {
                                      'BaseType' => '8318',
                                      'Header' => 'tcd.h',
                                      'Line' => '92',
                                      'Name' => 'opj_tcd_cblk_t',
                                      'Size' => '16248',
                                      'Type' => 'Typedef'
                                    },
                          '8601' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '97',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'cw',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'ch',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'cblks',
                                                           'offset' => '24',
                                                           'type' => '8716'
                                                         },
                                                  '7' => {
                                                           'name' => 'incltree',
                                                           'offset' => '32',
                                                           'type' => '8722'
                                                         },
                                                  '8' => {
                                                           'name' => 'imsbtree',
                                                           'offset' => '40',
                                                           'type' => '8722'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_precinct',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '8716' => {
                                      'BaseType' => '8590',
                                      'Name' => 'opj_tcd_cblk_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8722' => {
                                      'BaseType' => '8067',
                                      'Name' => 'opj_tgt_tree_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8728' => {
                                      'BaseType' => '8601',
                                      'Header' => 'tcd.h',
                                      'Line' => '103',
                                      'Name' => 'opj_tcd_precinct_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '8739' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'bandno',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'precincts',
                                                           'offset' => '24',
                                                           'type' => '8844'
                                                         },
                                                  '6' => {
                                                           'name' => 'numbps',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'stepsize',
                                                           'offset' => '36',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_band',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8844' => {
                                      'BaseType' => '8728',
                                      'Name' => 'opj_tcd_precinct_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8850' => {
                                      'BaseType' => '8739',
                                      'Header' => 'tcd.h',
                                      'Line' => '114',
                                      'Name' => 'opj_tcd_band_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '8861' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'pw',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'ph',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'numbands',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'bands',
                                                           'offset' => '32',
                                                           'type' => '8964'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_resolution',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '88740' => {
                                       'Header' => 'raw.h',
                                       'Line' => '46',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'c',
                                                            'offset' => '0',
                                                            'type' => '91'
                                                          },
                                                   '1' => {
                                                            'name' => 'ct',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'lenmax',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'len',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'bp',
                                                            'offset' => '16',
                                                            'type' => '674'
                                                          },
                                                   '5' => {
                                                            'name' => 'start',
                                                            'offset' => '24',
                                                            'type' => '674'
                                                          },
                                                   '6' => {
                                                            'name' => 'end',
                                                            'offset' => '32',
                                                            'type' => '674'
                                                          }
                                                 },
                                       'Name' => 'struct opj_raw',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '88833' => {
                                       'BaseType' => '88740',
                                       'Header' => 'raw.h',
                                       'Line' => '61',
                                       'Name' => 'opj_raw_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '88844' => {
                                       'BaseType' => '88833',
                                       'Name' => 'opj_raw_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8964' => {
                                      'BaseType' => '8850',
                                      'Name' => 'opj_tcd_band_t[3]',
                                      'Size' => '120',
                                      'Type' => 'Array'
                                    },
                          '8980' => {
                                      'BaseType' => '8861',
                                      'Header' => 'tcd.h',
                                      'Line' => '124',
                                      'Name' => 'opj_tcd_resolution_t',
                                      'Size' => '152',
                                      'Type' => 'Typedef'
                                    },
                          '8991' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '129',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numresolutions',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'resolutions',
                                                           'offset' => '24',
                                                           'type' => '9096'
                                                         },
                                                  '6' => {
                                                           'name' => 'data',
                                                           'offset' => '32',
                                                           'type' => '1941'
                                                         },
                                                  '7' => {
                                                           'name' => 'nbpix',
                                                           'offset' => '40',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_tilecomp',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '9096' => {
                                      'BaseType' => '8980',
                                      'Name' => 'opj_tcd_resolution_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '91' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '9102' => {
                                      'BaseType' => '8991',
                                      'Header' => 'tcd.h',
                                      'Line' => '135',
                                      'Name' => 'opj_tcd_tilecomp_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '9113' => {
                                      'BaseType' => '9102',
                                      'Name' => 'opj_tcd_tilecomp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '92944' => {
                                       'BaseType' => '112',
                                       'Header' => 't1.h',
                                       'Line' => '88',
                                       'Name' => 'flag_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '92955' => {
                                       'Header' => 't1.h',
                                       'Line' => '93',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cinfo',
                                                            'offset' => '0',
                                                            'type' => '3487'
                                                          },
                                                   '1' => {
                                                            'name' => 'mqc',
                                                            'offset' => '8',
                                                            'type' => '67999'
                                                          },
                                                   '2' => {
                                                            'name' => 'raw',
                                                            'offset' => '16',
                                                            'type' => '88844'
                                                          },
                                                   '3' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '1941'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '93096'
                                                          },
                                                   '5' => {
                                                            'name' => 'w',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'h',
                                                            'offset' => '44',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'datasize',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'flagssize',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags_stride',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_t1',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '93096' => {
                                       'BaseType' => '92944',
                                       'Name' => 'flag_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '93102' => {
                                       'BaseType' => '92955',
                                       'Header' => 't1.h',
                                       'Line' => '109',
                                       'Name' => 'opj_t1_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '94031' => {
                                       'BaseType' => '93102',
                                       'Name' => 'opj_t1_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjpeg.so' => {
                                                        '_ITM_deregisterTMCloneTable' => 0,
                                                        '_ITM_registerTMCloneTable' => 0,
                                                        '_Jv_RegisterClasses' => 0,
                                                        '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                        '__gmon_start__' => 0,
                                                        'ceilf' => 0,
                                                        'fclose@GLIBC_2.2.5' => 0,
                                                        'floor' => 0,
                                                        'floorf' => 0,
                                                        'fopen@GLIBC_2.2.5' => 0,
                                                        'fprintf@GLIBC_2.2.5' => 0,
                                                        'fputc@GLIBC_2.2.5' => 0,
                                                        'free@GLIBC_2.2.5' => 0,
                                                        'fwrite@GLIBC_2.2.5' => 0,
                                                        'getrusage@GLIBC_2.2.5' => 0,
                                                        'malloc@GLIBC_2.2.5' => 0,
                                                        'memcpy@GLIBC_2.14' => 0,
                                                        'memset@GLIBC_2.2.5' => 0,
                                                        'pow' => 0,
                                                        'puts@GLIBC_2.2.5' => 0,
                                                        'realloc@GLIBC_2.2.5' => 0,
                                                        'stderr@GLIBC_2.2.5' => 0,
                                                        'stdout@GLIBC_2.2.5' => 0,
                                                        'strcpy@GLIBC_2.2.5' => 0,
                                                        'trunc' => 0,
                                                        'truncf' => 0,
                                                        'vsprintf@GLIBC_2.2.5' => 0
                                                      }
                                },
          'WordSize' => '8'
        };
