$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.13',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.9.2',
          'Headers' => {
                         'openjpeg.h' => 1,
                         'opj_stdint.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjp2.so.2.0.0',
          'LibraryVersion' => '2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libm.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'cio.c' => 1,
                         'image.c' => 1,
                         'openjpeg.c' => 1
                       },
          'SymbolInfo' => {
                            '109725' => {
                                          'Header' => 'openjpeg.h',
                                          'Line' => '1354',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'cstr_info',
                                                                'type' => '109743'
                                                              }
                                                     },
                                          'Reg' => {

                                                    'opj_t1_decode_cblks' => 1,
                                                    'opj_t1_destroy' => 1,
                                                    'opj_t1_encode_cblks' => 1,
                                                    'opj_t2_create' => 1,
                                                    'opj_t2_decode_packets' => 1,
                                                    'opj_t2_destroy' => 1,
                                                    'opj_t2_encode_packets' => 1,
                                                    'opj_tcd_copy_tile_data' => 1,
                                                    'opj_tcd_create' => 1,
                                                    'opj_tcd_decode_tile' => 1,
                                                    'opj_tcd_destroy' => 1,
                                                    'opj_tcd_encode_tile' => 1,
                                                    'opj_tcd_get_decoded_tile_size' => 1,
                                                    'opj_tcd_get_encoded_tile_size' => 1,
                                                    'opj_tcd_init' => 1,
                                                    'opj_tcd_init_decode_tile' => 1,
                                                    'opj_tcd_init_encode_tile' => 1,
                                                    'opj_tcd_makelayer' => 1,
                                                    'opj_tcd_makelayer_fixed' => 1,
                                                    'opj_tcd_rateallocate' => 1,
                                                    'opj_tcd_rateallocate_fixed' => 1,
                                                    'opj_tcd_update_tile_data' => 1,
                                                    'opj_tgt_create' => 1,
                                                    'opj_tgt_decode' => 1,
                                                    'opj_tgt_destroy' => 1,
                                                    'opj_tgt_encode' => 1,
                                                    'opj_tgt_init' => 1,
                                                    'opj_tgt_reset' => 1,
                                                    'opj_tgt_setvalue' => 1,
                                                    'opj_version' => 1,
                                                    'opj_write_bytes_BE' => 1,
                                                    'opj_write_bytes_LE' => 1,
                                                    'opj_write_double_BE' => 1,
                                                    'opj_write_double_LE' => 1,
                                                    'opj_write_float_BE' => 1,
                                                    'opj_write_float_LE' => 1,
                                                    'opj_write_tile' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '104781' => {
                                        'BaseType' => '32391',
                                        'Name' => 'opj_codestream_info_v2_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '105' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '109743' => {
                                        'BaseType' => '104781',
                                        'Name' => 'opj_codestream_info_v2_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '137' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '148' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '84',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150834' => {
                                        'Header' => 'openjpeg.h',
                                        'Line' => '200',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_CODEC_UNKNOWN',
                                                             'value' => '-1'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CODEC_J2K',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CODEC_JPT',
                                                             'value' => '1'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CODEC_JP2',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '150871' => {
                                        'BaseType' => '150834',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '205',
                                        'Name' => 'OPJ_CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '152554' => {
                                        'BaseType' => '148',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '460',
                                        'Name' => 'opj_codec_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '160932' => {
                                        'BaseType' => '152554',
                                        'Name' => 'opj_codec_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163' => {
                                     'BaseType' => '77',
                                     'Header' => 'types.h',
                                     'Line' => '196',
                                     'Name' => 'int32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '164776' => {
                                        'BaseType' => '35493',
                                        'Name' => 'opj_codestream_index_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '181' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '188' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1937' => {
                                      'BaseType' => '1943',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1943' => {
                                      'BaseType' => '84',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '195' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '77'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '150'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '150'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '150'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '635'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '641'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '77'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '77'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '126'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '105'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '647'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '150'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '663'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '137'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '148'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '148'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '148'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '148'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '77'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '669'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '150'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '150'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '150'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '150'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '150'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '150'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '150'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '20358' => {
                                       'BaseType' => '84',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '87',
                                       'Name' => 'OPJ_CHAR',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '2038' => {
                                      'BaseType' => '119',
                                      'Header' => 'types.h',
                                      'Line' => '197',
                                      'Name' => 'int64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20435' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_STD_RSIZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA4K',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_MCT',
                                                            'value' => '33024'
                                                          }
                                                 },
                                       'Name' => 'enum RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20474' => {
                                       'BaseType' => '20435',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '162',
                                       'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20485' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '167',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K_24',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA2K_48',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CINEMA4K_24',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20522' => {
                                       'BaseType' => '20485',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '172',
                                       'Name' => 'OPJ_CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20533' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '177',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_PROG_UNKNOWN',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_LRCP',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_RLCP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_RPCL',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_PCRL',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CPRL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20582' => {
                                       'BaseType' => '20533',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '184',
                                       'Name' => 'OPJ_PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20593' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '189',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_CLRSPC_UNKNOWN',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CLRSPC_UNSPECIFIED',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CLRSPC_SRGB',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CLRSPC_GRAY',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_CLRSPC_SYCC',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20636' => {
                                       'BaseType' => '20593',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '195',
                                       'Name' => 'OPJ_COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20647' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '231',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'resno0',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'compno0',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '10' => {
                                                             'name' => 'progorder',
                                                             'offset' => '40',
                                                             'type' => '21090'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile',
                                                             'offset' => '48',
                                                             'type' => '729'
                                                           },
                                                   '12' => {
                                                             'name' => 'tx0',
                                                             'offset' => '52',
                                                             'type' => '718'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx1',
                                                             'offset' => '56',
                                                             'type' => '718'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '60',
                                                             'type' => '718'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty1',
                                                             'offset' => '64',
                                                             'type' => '718'
                                                           },
                                                   '16' => {
                                                             'name' => 'layS',
                                                             'offset' => '68',
                                                             'type' => '729'
                                                           },
                                                   '17' => {
                                                             'name' => 'resS',
                                                             'offset' => '72',
                                                             'type' => '729'
                                                           },
                                                   '18' => {
                                                             'name' => 'compS',
                                                             'offset' => '76',
                                                             'type' => '729'
                                                           },
                                                   '19' => {
                                                             'name' => 'prcS',
                                                             'offset' => '80',
                                                             'type' => '729'
                                                           },
                                                   '2' => {
                                                            'name' => 'layno1',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '20' => {
                                                             'name' => 'layE',
                                                             'offset' => '84',
                                                             'type' => '729'
                                                           },
                                                   '21' => {
                                                             'name' => 'resE',
                                                             'offset' => '88',
                                                             'type' => '729'
                                                           },
                                                   '22' => {
                                                             'name' => 'compE',
                                                             'offset' => '92',
                                                             'type' => '729'
                                                           },
                                                   '23' => {
                                                             'name' => 'prcE',
                                                             'offset' => '96',
                                                             'type' => '729'
                                                           },
                                                   '24' => {
                                                             'name' => 'txS',
                                                             'offset' => '100',
                                                             'type' => '729'
                                                           },
                                                   '25' => {
                                                             'name' => 'txE',
                                                             'offset' => '104',
                                                             'type' => '729'
                                                           },
                                                   '26' => {
                                                             'name' => 'tyS',
                                                             'offset' => '108',
                                                             'type' => '729'
                                                           },
                                                   '27' => {
                                                             'name' => 'tyE',
                                                             'offset' => '112',
                                                             'type' => '729'
                                                           },
                                                   '28' => {
                                                             'name' => 'dx',
                                                             'offset' => '116',
                                                             'type' => '729'
                                                           },
                                                   '29' => {
                                                             'name' => 'dy',
                                                             'offset' => '120',
                                                             'type' => '729'
                                                           },
                                                   '3' => {
                                                            'name' => 'resno1',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '30' => {
                                                             'name' => 'lay_t',
                                                             'offset' => '124',
                                                             'type' => '729'
                                                           },
                                                   '31' => {
                                                             'name' => 'res_t',
                                                             'offset' => '128',
                                                             'type' => '729'
                                                           },
                                                   '32' => {
                                                             'name' => 'comp_t',
                                                             'offset' => '132',
                                                             'type' => '729'
                                                           },
                                                   '33' => {
                                                             'name' => 'prc_t',
                                                             'offset' => '136',
                                                             'type' => '729'
                                                           },
                                                   '34' => {
                                                             'name' => 'tx0_t',
                                                             'offset' => '140',
                                                             'type' => '729'
                                                           },
                                                   '35' => {
                                                             'name' => 'ty0_t',
                                                             'offset' => '144',
                                                             'type' => '729'
                                                           },
                                                   '4' => {
                                                            'name' => 'compno1',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'layno0',
                                                            'offset' => '20',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'precno0',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno1',
                                                            'offset' => '28',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'prg1',
                                                            'offset' => '32',
                                                            'type' => '20582'
                                                          },
                                                   '9' => {
                                                            'name' => 'prg',
                                                            'offset' => '36',
                                                            'type' => '20582'
                                                          }
                                                 },
                                       'Name' => 'struct opj_poc',
                                       'Size' => '148',
                                       'Type' => 'Struct'
                                     },
                          '21090' => {
                                       'BaseType' => '20358',
                                       'Name' => 'OPJ_CHAR[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '21106' => {
                                       'BaseType' => '20647',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '254',
                                       'Name' => 'opj_poc_t',
                                       'Size' => '148',
                                       'Type' => 'Typedef'
                                     },
                          '21117' => {
                                       'BaseType' => '21106',
                                       'Name' => 'opj_poc_t[32]',
                                       'Size' => '4736',
                                       'Type' => 'Array'
                                     },
                          '21133' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '510',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '10' => {
                                                             'name' => 'factor',
                                                             'offset' => '40',
                                                             'type' => '729'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '48',
                                                             'type' => '8892'
                                                           },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '729'
                                                          },
                                                   '9' => {
                                                            'name' => 'resno_decoded',
                                                            'offset' => '36',
                                                            'type' => '729'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comp',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '21301' => {
                                       'BaseType' => '21133',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '535',
                                       'Name' => 'opj_image_comp_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '21313' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '540',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'color_space',
                                                            'offset' => '20',
                                                            'type' => '20636'
                                                          },
                                                   '6' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '21440'
                                                          },
                                                   '7' => {
                                                            'name' => 'icc_profile_buf',
                                                            'offset' => '32',
                                                            'type' => '740'
                                                          },
                                                   '8' => {
                                                            'name' => 'icc_profile_len',
                                                            'offset' => '40',
                                                            'type' => '729'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '21440' => {
                                       'BaseType' => '21301',
                                       'Name' => 'opj_image_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21452' => {
                                       'BaseType' => '21313',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '559',
                                       'Name' => 'opj_image_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '21464' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '565',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '729'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '21587' => {
                                       'BaseType' => '21464',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '584',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '23123' => {
                                       'BaseType' => '21452',
                                       'Name' => 'opj_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23789' => {
                                       'BaseType' => '21587',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2594' => {
                                      'BaseType' => '181',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '88',
                                      'Name' => 'OPJ_FLOAT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2638' => {
                                      'BaseType' => '56',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2649' => {
                                      'BaseType' => '45',
                                      'Header' => 'opj_stdint.h',
                                      'Line' => '46',
                                      'Name' => 'OPJ_SIZE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2660' => {
                                      'BaseType' => '2038',
                                      'Header' => 'opj_stdint.h',
                                      'Line' => '49',
                                      'Name' => 'OPJ_OFF_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2693' => {
                                      'BaseType' => '2638',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '101',
                                      'Name' => 'OPJ_UINT64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2704' => {
                                      'BaseType' => '2715',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '219',
                                      'Name' => 'opj_msg_callback',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2715' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1937'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2737' => {
                                      'BaseType' => '2749',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '479',
                                      'Name' => 'opj_stream_read_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2749' => {
                                      'Name' => 'OPJ_SIZE_T(*)(void*, OPJ_SIZE_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '148'
                                                          },
                                                   '1' => {
                                                            'type' => '2649'
                                                          },
                                                   '2' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '2649',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2780' => {
                                      'BaseType' => '2749',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '484',
                                      'Name' => 'opj_stream_write_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2792' => {
                                      'BaseType' => '2804',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '489',
                                      'Name' => 'opj_stream_skip_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '27969' => {
                                       'BaseType' => '77',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2804' => {
                                      'Name' => 'OPJ_OFF_T(*)(OPJ_OFF_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '2660',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '28059' => {
                                       'BaseType' => '195',
                                       'Header' => 'stdio.h',
                                       'Line' => '48',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '2830' => {
                                      'BaseType' => '2842',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '494',
                                      'Name' => 'opj_stream_seek_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2842' => {
                                      'Name' => 'OPJ_BOOL(*)(OPJ_OFF_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '685',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2868' => {
                                      'BaseType' => '148',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '499',
                                      'Name' => 'opj_stream_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '29440' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '259',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '685'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '77'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '20582'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '21117'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '4792',
                                                             'type' => '729'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '4796',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '4800',
                                                             'type' => '30270'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '5200',
                                                             'type' => '30270'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '5600',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '5604',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '5608',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '5612',
                                                             'type' => '77'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '5616',
                                                             'type' => '77'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '5620',
                                                             'type' => '77'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '5624',
                                                             'type' => '77'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '5628',
                                                             'type' => '77'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '5632',
                                                             'type' => '30286'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '5764',
                                                             'type' => '30286'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '5896',
                                                             'type' => '30302'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '9992',
                                                             'type' => '30302'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '14088',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '14092',
                                                             'type' => '30302'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '18188',
                                                             'type' => '77'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '18192',
                                                             'type' => '77'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '18196',
                                                             'type' => '77'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '18200',
                                                             'type' => '77'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '18204',
                                                             'type' => '77'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '18208',
                                                             'type' => '77'
                                                           },
                                                   '37' => {
                                                             'name' => 'jpwl_epc_on',
                                                             'offset' => '18212',
                                                             'type' => '685'
                                                           },
                                                   '38' => {
                                                             'name' => 'jpwl_hprot_MH',
                                                             'offset' => '18216',
                                                             'type' => '77'
                                                           },
                                                   '39' => {
                                                             'name' => 'jpwl_hprot_TPH_tileno',
                                                             'offset' => '18220',
                                                             'type' => '30319'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '40' => {
                                                             'name' => 'jpwl_hprot_TPH',
                                                             'offset' => '18284',
                                                             'type' => '30319'
                                                           },
                                                   '41' => {
                                                             'name' => 'jpwl_pprot_tileno',
                                                             'offset' => '18348',
                                                             'type' => '30319'
                                                           },
                                                   '42' => {
                                                             'name' => 'jpwl_pprot_packno',
                                                             'offset' => '18412',
                                                             'type' => '30319'
                                                           },
                                                   '43' => {
                                                             'name' => 'jpwl_pprot',
                                                             'offset' => '18476',
                                                             'type' => '30319'
                                                           },
                                                   '44' => {
                                                             'name' => 'jpwl_sens_size',
                                                             'offset' => '18540',
                                                             'type' => '77'
                                                           },
                                                   '45' => {
                                                             'name' => 'jpwl_sens_addr',
                                                             'offset' => '18544',
                                                             'type' => '77'
                                                           },
                                                   '46' => {
                                                             'name' => 'jpwl_sens_range',
                                                             'offset' => '18548',
                                                             'type' => '77'
                                                           },
                                                   '47' => {
                                                             'name' => 'jpwl_sens_MH',
                                                             'offset' => '18552',
                                                             'type' => '77'
                                                           },
                                                   '48' => {
                                                             'name' => 'jpwl_sens_TPH_tileno',
                                                             'offset' => '18556',
                                                             'type' => '30319'
                                                           },
                                                   '49' => {
                                                             'name' => 'jpwl_sens_TPH',
                                                             'offset' => '18620',
                                                             'type' => '30319'
                                                           },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '50' => {
                                                             'name' => 'cp_cinema',
                                                             'offset' => '18684',
                                                             'type' => '20522'
                                                           },
                                                   '51' => {
                                                             'name' => 'max_comp_size',
                                                             'offset' => '18688',
                                                             'type' => '77'
                                                           },
                                                   '52' => {
                                                             'name' => 'cp_rsiz',
                                                             'offset' => '18692',
                                                             'type' => '20474'
                                                           },
                                                   '53' => {
                                                             'name' => 'tp_on',
                                                             'offset' => '18696',
                                                             'type' => '84'
                                                           },
                                                   '54' => {
                                                             'name' => 'tp_flag',
                                                             'offset' => '18697',
                                                             'type' => '84'
                                                           },
                                                   '55' => {
                                                             'name' => 'tcp_mct',
                                                             'offset' => '18698',
                                                             'type' => '84'
                                                           },
                                                   '56' => {
                                                             'name' => 'jpip_on',
                                                             'offset' => '18700',
                                                             'type' => '685'
                                                           },
                                                   '57' => {
                                                             'name' => 'mct_data',
                                                             'offset' => '18704',
                                                             'type' => '148'
                                                           },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '27969'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '18712',
                                       'Type' => 'Struct'
                                     },
                          '30270' => {
                                       'BaseType' => '181',
                                       'Name' => 'float[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '30286' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '30302' => {
                                       'BaseType' => '84',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '30319' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[16]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '30335' => {
                                       'BaseType' => '29440',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '387',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '18712',
                                       'Type' => 'Typedef'
                                     },
                          '30347' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '394',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '10' => {
                                                             'name' => 'm_verbose',
                                                             'offset' => '8224',
                                                             'type' => '685'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile_index',
                                                             'offset' => '8228',
                                                             'type' => '729'
                                                           },
                                                   '12' => {
                                                             'name' => 'nb_tile_to_decode',
                                                             'offset' => '8232',
                                                             'type' => '729'
                                                           },
                                                   '13' => {
                                                             'name' => 'jpwl_correct',
                                                             'offset' => '8236',
                                                             'type' => '685'
                                                           },
                                                   '14' => {
                                                             'name' => 'jpwl_exp_comps',
                                                             'offset' => '8240',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'jpwl_max_tiles',
                                                             'offset' => '8244',
                                                             'type' => '77'
                                                           },
                                                   '16' => {
                                                             'name' => 'flags',
                                                             'offset' => '8248',
                                                             'type' => '98'
                                                           },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '30302'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '30302'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'DA_x0',
                                                            'offset' => '8208',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'DA_x1',
                                                            'offset' => '8212',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'DA_y0',
                                                            'offset' => '8216',
                                                            'type' => '729'
                                                          },
                                                   '9' => {
                                                            'name' => 'DA_y1',
                                                            'offset' => '8220',
                                                            'type' => '729'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8252',
                                       'Type' => 'Struct'
                                     },
                          '30597' => {
                                       'BaseType' => '30347',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '454',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8252',
                                       'Type' => 'Typedef'
                                     },
                          '31071' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '597',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_ph_pos',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '2660'
                                                          },
                                                   '3' => {
                                                            'name' => 'disto',
                                                            'offset' => '24',
                                                            'type' => '188'
                                                          }
                                                 },
                                       'Name' => 'struct opj_packet_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '31137' => {
                                       'BaseType' => '31071',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '606',
                                       'Name' => 'opj_packet_info_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '31149' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '613',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '70'
                                                          },
                                                   '1' => {
                                                            'name' => 'pos',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_marker_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '31202' => {
                                       'BaseType' => '31149',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '620',
                                       'Name' => 'opj_marker_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '31554' => {
                                       'BaseType' => '31137',
                                       'Name' => 'opj_packet_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '31560' => {
                                       'BaseType' => '31202',
                                       'Name' => 'opj_marker_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '31900' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '737',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'compno',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '10' => {
                                                             'name' => 'numgbits',
                                                             'offset' => '808',
                                                             'type' => '729'
                                                           },
                                                   '11' => {
                                                             'name' => 'roishift',
                                                             'offset' => '812',
                                                             'type' => '718'
                                                           },
                                                   '12' => {
                                                             'name' => 'prcw',
                                                             'offset' => '816',
                                                             'type' => '8904'
                                                           },
                                                   '13' => {
                                                             'name' => 'prch',
                                                             'offset' => '948',
                                                             'type' => '8904'
                                                           },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'cblkw',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'cblkh',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'cblksty',
                                                            'offset' => '20',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'qmfbid',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'qntsty',
                                                            'offset' => '28',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'stepsizes_mant',
                                                            'offset' => '32',
                                                            'type' => '32102'
                                                          },
                                                   '9' => {
                                                            'name' => 'stepsizes_expn',
                                                            'offset' => '420',
                                                            'type' => '32102'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tccp_info',
                                       'Size' => '1080',
                                       'Type' => 'Struct'
                                     },
                          '32102' => {
                                       'BaseType' => '729',
                                       'Name' => 'OPJ_UINT32[97]',
                                       'Size' => '388',
                                       'Type' => 'Array'
                                     },
                          '32134' => {
                                       'BaseType' => '31900',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '768',
                                       'Name' => 'opj_tccp_info_t',
                                       'Size' => '1080',
                                       'Type' => 'Typedef'
                                     },
                          '32146' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '773',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '2' => {
                                                            'name' => 'prg',
                                                            'offset' => '8',
                                                            'type' => '20582'
                                                          },
                                                   '3' => {
                                                            'name' => 'numlayers',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'mct',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'tccp_info',
                                                            'offset' => '24',
                                                            'type' => '32238'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_v2_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '32238' => {
                                       'BaseType' => '32134',
                                       'Name' => 'opj_tccp_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32244' => {
                                       'BaseType' => '32146',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '789',
                                       'Name' => 'opj_tile_info_v2_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '32256' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '794',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tx0',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'ty0',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '2' => {
                                                            'name' => 'tdx',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'tdy',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'tw',
                                                            'offset' => '16',
                                                            'type' => '729'
                                                          },
                                                   '5' => {
                                                            'name' => 'th',
                                                            'offset' => '20',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbcomps',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'm_default_tile_info',
                                                            'offset' => '32',
                                                            'type' => '32244'
                                                          },
                                                   '8' => {
                                                            'name' => 'tile_info',
                                                            'offset' => '64',
                                                            'type' => '32385'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_info_v2',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '32385' => {
                                       'BaseType' => '32244',
                                       'Name' => 'opj_tile_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32391' => {
                                       'BaseType' => '32256',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '818',
                                       'Name' => 'opj_codestream_info_v2_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '32403' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '824',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_header',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '2660'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tp_index',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '32456' => {
                                       'BaseType' => '32403',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '832',
                                       'Name' => 'opj_tp_index_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '32468' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '837',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '729'
                                                          },
                                                   '1' => {
                                                            'name' => 'nb_tps',
                                                            'offset' => '4',
                                                            'type' => '729'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_nb_tps',
                                                            'offset' => '8',
                                                            'type' => '729'
                                                          },
                                                   '3' => {
                                                            'name' => 'current_tpsno',
                                                            'offset' => '12',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'tp_index',
                                                            'offset' => '16',
                                                            'type' => '32612'
                                                          },
                                                   '5' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '31560'
                                                          },
                                                   '7' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '729'
                                                          },
                                                   '8' => {
                                                            'name' => 'nb_packet',
                                                            'offset' => '44',
                                                            'type' => '729'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_index',
                                                            'offset' => '48',
                                                            'type' => '31554'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '32612' => {
                                       'BaseType' => '32456',
                                       'Name' => 'opj_tp_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32618' => {
                                       'BaseType' => '32468',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '864',
                                       'Name' => 'opj_tile_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '32630' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '869',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'main_head_start',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '16',
                                                            'type' => '2693'
                                                          },
                                                   '3' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '729'
                                                          },
                                                   '4' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '31560'
                                                          },
                                                   '5' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '729'
                                                          },
                                                   '6' => {
                                                            'name' => 'nb_of_tiles',
                                                            'offset' => '44',
                                                            'type' => '729'
                                                          },
                                                   '7' => {
                                                            'name' => 'tile_index',
                                                            'offset' => '48',
                                                            'type' => '32748'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '32748' => {
                                       'BaseType' => '32618',
                                       'Name' => 'opj_tile_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32754' => {
                                       'BaseType' => '32630',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '892',
                                       'Name' => 'opj_codestream_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '3304' => {
                                      'BaseType' => '2594',
                                      'Name' => 'OPJ_FLOAT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3310' => {
                                      'BaseType' => '729',
                                      'Name' => 'OPJ_UINT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '35493' => {
                                       'BaseType' => '32754',
                                       'Name' => 'opj_codestream_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '212',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5600' => {
                                      'BaseType' => '2868',
                                      'Name' => 'opj_stream_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '579' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '586' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '635'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '641'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '635' => {
                                     'BaseType' => '586',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '641' => {
                                     'BaseType' => '195',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '647' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '663' => {
                                     'BaseType' => '579',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '669' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '685' => {
                                     'BaseType' => '77',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '83',
                                     'Name' => 'OPJ_BOOL',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '696' => {
                                     'BaseType' => '91',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '90',
                                     'Name' => 'OPJ_BYTE',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '707' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint.h',
                                     'Line' => '51',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '718' => {
                                     'BaseType' => '163',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '98',
                                     'Name' => 'OPJ_INT32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '729' => {
                                     'BaseType' => '707',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '99',
                                     'Name' => 'OPJ_UINT32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '740' => {
                                     'BaseType' => '696',
                                     'Name' => 'OPJ_BYTE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '77' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '77488' => {
                                       'BaseType' => '28059',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8892' => {
                                      'BaseType' => '718',
                                      'Name' => 'OPJ_INT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8904' => {
                                      'BaseType' => '729',
                                      'Name' => 'OPJ_UINT32[33]',
                                      'Size' => '132',
                                      'Type' => 'Array'
                                    },
                          '91' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '94758' => {
                                       'BaseType' => '30597',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95356' => {
                                       'BaseType' => '23123',
                                       'Name' => 'opj_image_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97052' => {
                                       'BaseType' => '30335',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '99015' => {
                                       'BaseType' => '685',
                                       'Name' => 'OPJ_BOOL*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libopenjp2.so.2.0.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '_Jv_RegisterClasses' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'ceilf@GLIBC_2.2.5' => 0,
                                                             'floor@GLIBC_2.2.5' => 0,
                                                             'floorf@GLIBC_2.2.5' => 0,
                                                             'fprintf@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fseeko@GLIBC_2.2.5' => 0,
                                                             'ftello@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'lrintf@GLIBC_2.2.5' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'pow@GLIBC_2.2.5' => 0,
                                                             'puts@GLIBC_2.2.5' => 0,
                                                             'realloc@GLIBC_2.2.5' => 0,
                                                             'sqrt@GLIBC_2.2.5' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strcpy@GLIBC_2.2.5' => 0,
                                                             'vsprintf@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
