$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.13',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.9.2',
          'Headers' => {
                         'openjpeg.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjp2.so.2.1.0',
          'LibraryVersion' => '2.1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libm.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'cio.c' => 1,
                         'image.c' => 1,
                         'openjpeg.c' => 1
                       },
          'SymbolInfo' => {
                            '109967' => {
                                          'Header' => 'openjpeg.h',
                                          'Line' => '1473',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'cstr_info',
                                                                'type' => '109985'
                                                              }
                                                     },
                                          'Reg' => {
                                                     '0' => 'rdi'

                                                    'opj_encode' => 1,
                                                    'opj_end_compress' => 1,
                                                    'opj_end_decompress' => 1,
                                                    'opj_get_cstr_index' => 1,
                                                    'opj_get_cstr_info' => 1,
                                                    'opj_get_decoded_tile' => 1,
                                                    'opj_image_create' => 1,
                                                    'opj_image_destroy' => 1,
                                                    'opj_image_tile_create' => 1,
                                                    'opj_read_header' => 1,
                                                    'opj_read_tile_header' => 1,
                                                    'opj_set_MCT' => 1,
                                                    'opj_set_decode_area' => 1,
                                                    'opj_set_decoded_resolution_factor' => 1,
                                                    'opj_set_default_decoder_parameters' => 1,
                                                    'opj_set_default_encoder_parameters' => 1,
                                                    'opj_set_error_handler' => 1,
                                                    'opj_set_info_handler' => 1,
                                                    'opj_set_warning_handler' => 1,
                                                    'opj_setup_decoder' => 1,
                                                    'opj_setup_encoder' => 1,
                                                    'opj_start_compress' => 1,
                                                    'opj_stream_create' => 1,
                                                    'opj_stream_create_default_file_stream' => 1,
                                                    'opj_stream_create_file_stream' => 1,
                                                    'opj_stream_default_create' => 1,
                                                    'opj_stream_destroy' => 1,
                                                    'opj_stream_set_read_function' => 1,
                                                    'opj_stream_set_seek_function' => 1,
                                                    'opj_stream_set_skip_function' => 1,
                                                    'opj_stream_set_user_data' => 1,
                                                    'opj_stream_set_user_data_length' => 1,
                                                    'opj_stream_set_write_function' => 1,
                                                    'opj_version' => 1,
                                                    'opj_write_tile' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '109985' => {
                                        'BaseType' => '37976',
                                        'Name' => 'opj_codestream_info_v2_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '137' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '148' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '84',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '153221' => {
                                        'Header' => 'openjpeg.h',
                                        'Line' => '288',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_CODEC_UNKNOWN',
                                                             'value' => '-1'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CODEC_J2K',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CODEC_JPT',
                                                             'value' => '1'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CODEC_JP2',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'OPJ_CODEC_JPP',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'OPJ_CODEC_JPX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '153271' => {
                                        'BaseType' => '153221',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '295',
                                        'Name' => 'OPJ_CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '155022' => {
                                        'BaseType' => '148',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '570',
                                        'Name' => 'opj_codec_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '163417' => {
                                        'BaseType' => '155022',
                                        'Name' => 'opj_codec_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '167241' => {
                                        'BaseType' => '36096',
                                        'Name' => 'opj_codestream_index_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '170' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '177' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '184' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '77'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '150'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '150'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '150'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '624'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '630'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '77'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '77'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '126'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '105'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '636'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '150'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '652'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '137'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '148'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '148'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '148'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '148'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '77'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '658'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '150'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '150'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '150'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '150'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '150'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '150'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '150'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '1915' => {
                                      'BaseType' => '1921',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1921' => {
                                      'BaseType' => '84',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '2005' => {
                                      'BaseType' => '77',
                                      'Header' => 'types.h',
                                      'Line' => '196',
                                      'Name' => 'int32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2016' => {
                                      'BaseType' => '119',
                                      'Header' => 'types.h',
                                      'Line' => '197',
                                      'Name' => 'int64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20421' => {
                                       'BaseType' => '84',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '110',
                                       'Name' => 'OPJ_CHAR',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '20465' => {
                                       'BaseType' => '70',
                                       'Header' => 'stdint.h',
                                       'Line' => '49',
                                       'Name' => 'uint16_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '20487' => {
                                       'BaseType' => '20465',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '120',
                                       'Name' => 'OPJ_UINT16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '20531' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '263',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_PROG_UNKNOWN',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_LRCP',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_RLCP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_RPCL',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_PCRL',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CPRL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20581' => {
                                       'BaseType' => '20531',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '270',
                                       'Name' => 'OPJ_PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20593' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '275',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_CLRSPC_UNKNOWN',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CLRSPC_UNSPECIFIED',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CLRSPC_SRGB',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CLRSPC_GRAY',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_CLRSPC_SYCC',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CLRSPC_EYCC',
                                                            'value' => '4'
                                                          },
                                                   '6' => {
                                                            'name' => 'OPJ_CLRSPC_CMYK',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20649' => {
                                       'BaseType' => '20593',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '283',
                                       'Name' => 'OPJ_COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20661' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '321',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'resno0',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'compno0',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '10' => {
                                                             'name' => 'progorder',
                                                             'offset' => '40',
                                                             'type' => '21141'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile',
                                                             'offset' => '48',
                                                             'type' => '707'
                                                           },
                                                   '12' => {
                                                             'name' => 'tx0',
                                                             'offset' => '52',
                                                             'type' => '2627'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx1',
                                                             'offset' => '56',
                                                             'type' => '2627'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '60',
                                                             'type' => '2627'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty1',
                                                             'offset' => '64',
                                                             'type' => '2627'
                                                           },
                                                   '16' => {
                                                             'name' => 'layS',
                                                             'offset' => '68',
                                                             'type' => '707'
                                                           },
                                                   '17' => {
                                                             'name' => 'resS',
                                                             'offset' => '72',
                                                             'type' => '707'
                                                           },
                                                   '18' => {
                                                             'name' => 'compS',
                                                             'offset' => '76',
                                                             'type' => '707'
                                                           },
                                                   '19' => {
                                                             'name' => 'prcS',
                                                             'offset' => '80',
                                                             'type' => '707'
                                                           },
                                                   '2' => {
                                                            'name' => 'layno1',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '20' => {
                                                             'name' => 'layE',
                                                             'offset' => '84',
                                                             'type' => '707'
                                                           },
                                                   '21' => {
                                                             'name' => 'resE',
                                                             'offset' => '88',
                                                             'type' => '707'
                                                           },
                                                   '22' => {
                                                             'name' => 'compE',
                                                             'offset' => '92',
                                                             'type' => '707'
                                                           },
                                                   '23' => {
                                                             'name' => 'prcE',
                                                             'offset' => '96',
                                                             'type' => '707'
                                                           },
                                                   '24' => {
                                                             'name' => 'txS',
                                                             'offset' => '100',
                                                             'type' => '707'
                                                           },
                                                   '25' => {
                                                             'name' => 'txE',
                                                             'offset' => '104',
                                                             'type' => '707'
                                                           },
                                                   '26' => {
                                                             'name' => 'tyS',
                                                             'offset' => '108',
                                                             'type' => '707'
                                                           },
                                                   '27' => {
                                                             'name' => 'tyE',
                                                             'offset' => '112',
                                                             'type' => '707'
                                                           },
                                                   '28' => {
                                                             'name' => 'dx',
                                                             'offset' => '116',
                                                             'type' => '707'
                                                           },
                                                   '29' => {
                                                             'name' => 'dy',
                                                             'offset' => '120',
                                                             'type' => '707'
                                                           },
                                                   '3' => {
                                                            'name' => 'resno1',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '30' => {
                                                             'name' => 'lay_t',
                                                             'offset' => '124',
                                                             'type' => '707'
                                                           },
                                                   '31' => {
                                                             'name' => 'res_t',
                                                             'offset' => '128',
                                                             'type' => '707'
                                                           },
                                                   '32' => {
                                                             'name' => 'comp_t',
                                                             'offset' => '132',
                                                             'type' => '707'
                                                           },
                                                   '33' => {
                                                             'name' => 'prc_t',
                                                             'offset' => '136',
                                                             'type' => '707'
                                                           },
                                                   '34' => {
                                                             'name' => 'tx0_t',
                                                             'offset' => '140',
                                                             'type' => '707'
                                                           },
                                                   '35' => {
                                                             'name' => 'ty0_t',
                                                             'offset' => '144',
                                                             'type' => '707'
                                                           },
                                                   '4' => {
                                                            'name' => 'compno1',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'layno0',
                                                            'offset' => '20',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'precno0',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno1',
                                                            'offset' => '28',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'prg1',
                                                            'offset' => '32',
                                                            'type' => '20581'
                                                          },
                                                   '9' => {
                                                            'name' => 'prg',
                                                            'offset' => '36',
                                                            'type' => '20581'
                                                          }
                                                 },
                                       'Name' => 'struct opj_poc',
                                       'Size' => '148',
                                       'Type' => 'Struct'
                                     },
                          '21141' => {
                                       'BaseType' => '20421',
                                       'Name' => 'OPJ_CHAR[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '21157' => {
                                       'BaseType' => '20661',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '344',
                                       'Name' => 'opj_poc_t',
                                       'Size' => '148',
                                       'Type' => 'Typedef'
                                     },
                          '21169' => {
                                       'BaseType' => '21157',
                                       'Name' => 'opj_poc_t[32]',
                                       'Size' => '4736',
                                       'Type' => 'Array'
                                     },
                          '21185' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '625',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '10' => {
                                                             'name' => 'factor',
                                                             'offset' => '40',
                                                             'type' => '707'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '48',
                                                             'type' => '8935'
                                                           },
                                                   '12' => {
                                                             'name' => 'alpha',
                                                             'offset' => '56',
                                                             'type' => '20487'
                                                           },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '707'
                                                          },
                                                   '9' => {
                                                            'name' => 'resno_decoded',
                                                            'offset' => '36',
                                                            'type' => '707'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '21366' => {
                                       'BaseType' => '21185',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '652',
                                       'Name' => 'opj_image_comp_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '21378' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '657',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'color_space',
                                                            'offset' => '20',
                                                            'type' => '20649'
                                                          },
                                                   '6' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '21505'
                                                          },
                                                   '7' => {
                                                            'name' => 'icc_profile_buf',
                                                            'offset' => '32',
                                                            'type' => '718'
                                                          },
                                                   '8' => {
                                                            'name' => 'icc_profile_len',
                                                            'offset' => '40',
                                                            'type' => '707'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '21505' => {
                                       'BaseType' => '21366',
                                       'Name' => 'opj_image_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21517' => {
                                       'BaseType' => '21378',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '676',
                                       'Name' => 'opj_image_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '21529' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '682',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '707'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '21652' => {
                                       'BaseType' => '21529',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '701',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '23179' => {
                                       'BaseType' => '21517',
                                       'Name' => 'opj_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23814' => {
                                       'BaseType' => '21652',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2572' => {
                                      'BaseType' => '170',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '111',
                                      'Name' => 'OPJ_FLOAT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2616' => {
                                      'BaseType' => '56',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2627' => {
                                      'BaseType' => '2005',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '121',
                                      'Name' => 'OPJ_INT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2649' => {
                                      'BaseType' => '2616',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '124',
                                      'Name' => 'OPJ_UINT64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2660' => {
                                      'BaseType' => '2016',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '126',
                                      'Name' => 'OPJ_OFF_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2671' => {
                                      'BaseType' => '45',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '129',
                                      'Name' => 'OPJ_SIZE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2682' => {
                                      'BaseType' => '2694',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '309',
                                      'Name' => 'opj_msg_callback',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2694' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1915'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2716' => {
                                      'BaseType' => '2728',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '589',
                                      'Name' => 'opj_stream_read_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2728' => {
                                      'Name' => 'OPJ_SIZE_T(*)(void*, OPJ_SIZE_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '148'
                                                          },
                                                   '1' => {
                                                            'type' => '2671'
                                                          },
                                                   '2' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '2671',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2759' => {
                                      'BaseType' => '2728',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '594',
                                      'Name' => 'opj_stream_write_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2771' => {
                                      'BaseType' => '2783',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '599',
                                      'Name' => 'opj_stream_skip_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2783' => {
                                      'Name' => 'OPJ_OFF_T(*)(OPJ_OFF_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '2660',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2809' => {
                                      'BaseType' => '2821',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '604',
                                      'Name' => 'opj_stream_seek_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2821' => {
                                      'Name' => 'OPJ_BOOL(*)(OPJ_OFF_T, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '674',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '28433' => {
                                       'BaseType' => '77',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2847' => {
                                      'BaseType' => '2859',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '609',
                                      'Name' => 'opj_stream_free_user_data_fn',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '28523' => {
                                       'BaseType' => '184',
                                       'Header' => 'stdio.h',
                                       'Line' => '48',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '2859' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2876' => {
                                      'BaseType' => '148',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '614',
                                      'Name' => 'opj_stream_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '29200' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '242',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_STD_RSIZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA4K',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_MCT',
                                                            'value' => '33024'
                                                          }
                                                 },
                                       'Name' => 'enum RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '29239' => {
                                       'BaseType' => '29200',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '247',
                                       'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '29250' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '253',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K_24',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA2K_48',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CINEMA4K_24',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '29287' => {
                                       'BaseType' => '29250',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '258',
                                       'Name' => 'OPJ_CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '29971' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '674'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '77'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '20581'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '21169'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '4792',
                                                             'type' => '707'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '4796',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '4800',
                                                             'type' => '30829'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '5200',
                                                             'type' => '30829'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '5600',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '5604',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '5608',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '5612',
                                                             'type' => '77'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '5616',
                                                             'type' => '77'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '5620',
                                                             'type' => '77'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '5624',
                                                             'type' => '77'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '5628',
                                                             'type' => '77'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '5632',
                                                             'type' => '30845'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '5764',
                                                             'type' => '30845'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '5896',
                                                             'type' => '30861'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '9992',
                                                             'type' => '30861'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '14088',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '14092',
                                                             'type' => '30861'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '18188',
                                                             'type' => '77'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '18192',
                                                             'type' => '77'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '18196',
                                                             'type' => '77'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '18200',
                                                             'type' => '77'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '18204',
                                                             'type' => '77'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '18208',
                                                             'type' => '77'
                                                           },
                                                   '37' => {
                                                             'name' => 'jpwl_epc_on',
                                                             'offset' => '18212',
                                                             'type' => '674'
                                                           },
                                                   '38' => {
                                                             'name' => 'jpwl_hprot_MH',
                                                             'offset' => '18216',
                                                             'type' => '77'
                                                           },
                                                   '39' => {
                                                             'name' => 'jpwl_hprot_TPH_tileno',
                                                             'offset' => '18220',
                                                             'type' => '30878'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '40' => {
                                                             'name' => 'jpwl_hprot_TPH',
                                                             'offset' => '18284',
                                                             'type' => '30878'
                                                           },
                                                   '41' => {
                                                             'name' => 'jpwl_pprot_tileno',
                                                             'offset' => '18348',
                                                             'type' => '30878'
                                                           },
                                                   '42' => {
                                                             'name' => 'jpwl_pprot_packno',
                                                             'offset' => '18412',
                                                             'type' => '30878'
                                                           },
                                                   '43' => {
                                                             'name' => 'jpwl_pprot',
                                                             'offset' => '18476',
                                                             'type' => '30878'
                                                           },
                                                   '44' => {
                                                             'name' => 'jpwl_sens_size',
                                                             'offset' => '18540',
                                                             'type' => '77'
                                                           },
                                                   '45' => {
                                                             'name' => 'jpwl_sens_addr',
                                                             'offset' => '18544',
                                                             'type' => '77'
                                                           },
                                                   '46' => {
                                                             'name' => 'jpwl_sens_range',
                                                             'offset' => '18548',
                                                             'type' => '77'
                                                           },
                                                   '47' => {
                                                             'name' => 'jpwl_sens_MH',
                                                             'offset' => '18552',
                                                             'type' => '77'
                                                           },
                                                   '48' => {
                                                             'name' => 'jpwl_sens_TPH_tileno',
                                                             'offset' => '18556',
                                                             'type' => '30878'
                                                           },
                                                   '49' => {
                                                             'name' => 'jpwl_sens_TPH',
                                                             'offset' => '18620',
                                                             'type' => '30878'
                                                           },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '50' => {
                                                             'name' => 'cp_cinema',
                                                             'offset' => '18684',
                                                             'type' => '29287'
                                                           },
                                                   '51' => {
                                                             'name' => 'max_comp_size',
                                                             'offset' => '18688',
                                                             'type' => '77'
                                                           },
                                                   '52' => {
                                                             'name' => 'cp_rsiz',
                                                             'offset' => '18692',
                                                             'type' => '29239'
                                                           },
                                                   '53' => {
                                                             'name' => 'tp_on',
                                                             'offset' => '18696',
                                                             'type' => '84'
                                                           },
                                                   '54' => {
                                                             'name' => 'tp_flag',
                                                             'offset' => '18697',
                                                             'type' => '84'
                                                           },
                                                   '55' => {
                                                             'name' => 'tcp_mct',
                                                             'offset' => '18698',
                                                             'type' => '84'
                                                           },
                                                   '56' => {
                                                             'name' => 'jpip_on',
                                                             'offset' => '18700',
                                                             'type' => '674'
                                                           },
                                                   '57' => {
                                                             'name' => 'mct_data',
                                                             'offset' => '18704',
                                                             'type' => '148'
                                                           },
                                                   '58' => {
                                                             'name' => 'max_cs_size',
                                                             'offset' => '18712',
                                                             'type' => '77'
                                                           },
                                                   '59' => {
                                                             'name' => 'rsiz',
                                                             'offset' => '18716',
                                                             'type' => '20487'
                                                           },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '28433'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '18720',
                                       'Type' => 'Struct'
                                     },
                          '30829' => {
                                       'BaseType' => '170',
                                       'Name' => 'float[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '30845' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '30861' => {
                                       'BaseType' => '84',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '30878' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[16]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '30894' => {
                                       'BaseType' => '29971',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '497',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '18720',
                                       'Type' => 'Typedef'
                                     },
                          '30906' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '504',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '10' => {
                                                             'name' => 'm_verbose',
                                                             'offset' => '8224',
                                                             'type' => '674'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile_index',
                                                             'offset' => '8228',
                                                             'type' => '707'
                                                           },
                                                   '12' => {
                                                             'name' => 'nb_tile_to_decode',
                                                             'offset' => '8232',
                                                             'type' => '707'
                                                           },
                                                   '13' => {
                                                             'name' => 'jpwl_correct',
                                                             'offset' => '8236',
                                                             'type' => '674'
                                                           },
                                                   '14' => {
                                                             'name' => 'jpwl_exp_comps',
                                                             'offset' => '8240',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'jpwl_max_tiles',
                                                             'offset' => '8244',
                                                             'type' => '77'
                                                           },
                                                   '16' => {
                                                             'name' => 'flags',
                                                             'offset' => '8248',
                                                             'type' => '98'
                                                           },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '30861'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '30861'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'DA_x0',
                                                            'offset' => '8208',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'DA_x1',
                                                            'offset' => '8212',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'DA_y0',
                                                            'offset' => '8216',
                                                            'type' => '707'
                                                          },
                                                   '9' => {
                                                            'name' => 'DA_y1',
                                                            'offset' => '8220',
                                                            'type' => '707'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8252',
                                       'Type' => 'Struct'
                                     },
                          '31156' => {
                                       'BaseType' => '30906',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '564',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8252',
                                       'Type' => 'Typedef'
                                     },
                          '31672' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '714',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_ph_pos',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '2660'
                                                          },
                                                   '3' => {
                                                            'name' => 'disto',
                                                            'offset' => '24',
                                                            'type' => '177'
                                                          }
                                                 },
                                       'Name' => 'struct opj_packet_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '31738' => {
                                       'BaseType' => '31672',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '723',
                                       'Name' => 'opj_packet_info_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '31750' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '730',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '70'
                                                          },
                                                   '1' => {
                                                            'name' => 'pos',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_marker_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '31803' => {
                                       'BaseType' => '31750',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '737',
                                       'Name' => 'opj_marker_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '32155' => {
                                       'BaseType' => '31738',
                                       'Name' => 'opj_packet_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32161' => {
                                       'BaseType' => '31803',
                                       'Name' => 'opj_marker_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32501' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '854',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'compno',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '10' => {
                                                             'name' => 'numgbits',
                                                             'offset' => '808',
                                                             'type' => '707'
                                                           },
                                                   '11' => {
                                                             'name' => 'roishift',
                                                             'offset' => '812',
                                                             'type' => '2627'
                                                           },
                                                   '12' => {
                                                             'name' => 'prcw',
                                                             'offset' => '816',
                                                             'type' => '8947'
                                                           },
                                                   '13' => {
                                                             'name' => 'prch',
                                                             'offset' => '948',
                                                             'type' => '8947'
                                                           },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'cblkw',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'cblkh',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'cblksty',
                                                            'offset' => '20',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'qmfbid',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'qntsty',
                                                            'offset' => '28',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'stepsizes_mant',
                                                            'offset' => '32',
                                                            'type' => '32703'
                                                          },
                                                   '9' => {
                                                            'name' => 'stepsizes_expn',
                                                            'offset' => '420',
                                                            'type' => '32703'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tccp_info',
                                       'Size' => '1080',
                                       'Type' => 'Struct'
                                     },
                          '32703' => {
                                       'BaseType' => '707',
                                       'Name' => 'OPJ_UINT32[97]',
                                       'Size' => '388',
                                       'Type' => 'Array'
                                     },
                          '32735' => {
                                       'BaseType' => '32501',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '885',
                                       'Name' => 'opj_tccp_info_t',
                                       'Size' => '1080',
                                       'Type' => 'Typedef'
                                     },
                          '32747' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '890',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '2' => {
                                                            'name' => 'prg',
                                                            'offset' => '8',
                                                            'type' => '20581'
                                                          },
                                                   '3' => {
                                                            'name' => 'numlayers',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'mct',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'tccp_info',
                                                            'offset' => '24',
                                                            'type' => '32839'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_v2_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '32839' => {
                                       'BaseType' => '32735',
                                       'Name' => 'opj_tccp_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32845' => {
                                       'BaseType' => '32747',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '906',
                                       'Name' => 'opj_tile_info_v2_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '32857' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '911',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tx0',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'ty0',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '2' => {
                                                            'name' => 'tdx',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'tdy',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'tw',
                                                            'offset' => '16',
                                                            'type' => '707'
                                                          },
                                                   '5' => {
                                                            'name' => 'th',
                                                            'offset' => '20',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbcomps',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'm_default_tile_info',
                                                            'offset' => '32',
                                                            'type' => '32845'
                                                          },
                                                   '8' => {
                                                            'name' => 'tile_info',
                                                            'offset' => '64',
                                                            'type' => '32986'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_info_v2',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '32986' => {
                                       'BaseType' => '32845',
                                       'Name' => 'opj_tile_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32992' => {
                                       'BaseType' => '32857',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '935',
                                       'Name' => 'opj_codestream_info_v2_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '33004' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '941',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_header',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '2660'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tp_index',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '33057' => {
                                       'BaseType' => '33004',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '949',
                                       'Name' => 'opj_tp_index_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '33069' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '954',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '707'
                                                          },
                                                   '1' => {
                                                            'name' => 'nb_tps',
                                                            'offset' => '4',
                                                            'type' => '707'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_nb_tps',
                                                            'offset' => '8',
                                                            'type' => '707'
                                                          },
                                                   '3' => {
                                                            'name' => 'current_tpsno',
                                                            'offset' => '12',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'tp_index',
                                                            'offset' => '16',
                                                            'type' => '33213'
                                                          },
                                                   '5' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '32161'
                                                          },
                                                   '7' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '707'
                                                          },
                                                   '8' => {
                                                            'name' => 'nb_packet',
                                                            'offset' => '44',
                                                            'type' => '707'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_index',
                                                            'offset' => '48',
                                                            'type' => '32155'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '33213' => {
                                       'BaseType' => '33057',
                                       'Name' => 'opj_tp_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33219' => {
                                       'BaseType' => '33069',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '981',
                                       'Name' => 'opj_tile_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '33231' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '986',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'main_head_start',
                                                            'offset' => '0',
                                                            'type' => '2660'
                                                          },
                                                   '1' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '8',
                                                            'type' => '2660'
                                                          },
                                                   '2' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '16',
                                                            'type' => '2649'
                                                          },
                                                   '3' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '707'
                                                          },
                                                   '4' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '32161'
                                                          },
                                                   '5' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '707'
                                                          },
                                                   '6' => {
                                                            'name' => 'nb_of_tiles',
                                                            'offset' => '44',
                                                            'type' => '707'
                                                          },
                                                   '7' => {
                                                            'name' => 'tile_index',
                                                            'offset' => '48',
                                                            'type' => '33349'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '3324' => {
                                      'BaseType' => '2572',
                                      'Name' => 'OPJ_FLOAT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3330' => {
                                      'BaseType' => '707',
                                      'Name' => 'OPJ_UINT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '33349' => {
                                       'BaseType' => '33219',
                                       'Name' => 'opj_tile_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33355' => {
                                       'BaseType' => '33231',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '1009',
                                       'Name' => 'opj_codestream_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '36096' => {
                                       'BaseType' => '33355',
                                       'Name' => 'opj_codestream_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37940' => {
                                       'BaseType' => '23179',
                                       'Name' => 'opj_image_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37946' => {
                                       'BaseType' => '674',
                                       'Name' => 'OPJ_BOOL*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37952' => {
                                       'BaseType' => '31156',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37964' => {
                                       'BaseType' => '30894',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37970' => {
                                       'BaseType' => '28523',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37976' => {
                                       'BaseType' => '32992',
                                       'Name' => 'opj_codestream_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '212',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5620' => {
                                      'BaseType' => '2876',
                                      'Name' => 'opj_stream_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '568' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '575' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '624'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '630'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '624' => {
                                     'BaseType' => '575',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '630' => {
                                     'BaseType' => '184',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '636' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '652' => {
                                     'BaseType' => '568',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '658' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '674' => {
                                     'BaseType' => '77',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '106',
                                     'Name' => 'OPJ_BOOL',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '685' => {
                                     'BaseType' => '91',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '113',
                                     'Name' => 'OPJ_BYTE',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '696' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint.h',
                                     'Line' => '51',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '707' => {
                                     'BaseType' => '696',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '122',
                                     'Name' => 'OPJ_UINT32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '718' => {
                                     'BaseType' => '685',
                                     'Name' => 'OPJ_BYTE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '77' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '84' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8935' => {
                                      'BaseType' => '2627',
                                      'Name' => 'OPJ_INT32*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8947' => {
                                      'BaseType' => '707',
                                      'Name' => 'OPJ_UINT32[33]',
                                      'Size' => '132',
                                      'Type' => 'Array'
                                    },
                          '91' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjp2.so.2.1.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '_Jv_RegisterClasses' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'ceilf@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'floor@GLIBC_2.2.5' => 0,
                                                             'floorf@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fprintf@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fseeko@GLIBC_2.2.5' => 0,
                                                             'ftello@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'lrintf@GLIBC_2.2.5' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'pow@GLIBC_2.2.5' => 0,
                                                             'puts@GLIBC_2.2.5' => 0,
                                                             'realloc@GLIBC_2.2.5' => 0,
                                                             'sqrt@GLIBC_2.2.5' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strcpy@GLIBC_2.2.5' => 0,
                                                             'vsnprintf@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
