$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.9.2',
          'Headers' => {
                         'bio.h' => 1,
                         'cio.h' => 1,
                         'dwt.h' => 1,
                         'event.h' => 1,
                         'image.h' => 1,
                         'j2k.h' => 1,
                         'j2k_lib.h' => 1,
                         'jp2.h' => 1,
                         'jpt.h' => 1,
                         'mct.h' => 1,
                         'mqc.h' => 1,
                         'openjpeg.h' => 1,
                         'pi.h' => 1,
                         'raw.h' => 1,
                         't1.h' => 1,
                         't2.h' => 1,
                         'tcd.h' => 1,
                         'tgt.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjpeg.so',
          'LibraryVersion' => '1.1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'bio.c' => 1,
                         'cio.c' => 1,
                         'dwt.c' => 1,
                         'event.c' => 1,
                         'image.c' => 1,
                         'j2k.c' => 1,
                         'j2k_lib.c' => 1,

                                               'opj_set_default_decoder_parameters' => 1,
                                               'opj_set_default_encoder_parameters' => 1,
                                               'opj_set_event_mgr' => 1,
                                               'opj_setup_decoder' => 1,
                                               'opj_setup_encoder' => 1,
                                               'opj_version' => 1,
                                               'pi_create' => 1,
                                               'pi_destroy' => 1,
                                               'pi_next' => 1,
                                               'raw_create' => 1,
                                               'raw_decode' => 1,
                                               'raw_destroy' => 1,
                                               'raw_init_dec' => 1,
                                               'raw_numbytes' => 1,
                                               't1_create' => 1,
                                               't1_decode_cblks' => 1,
                                               't1_destroy' => 1,
                                               't1_encode_cblks' => 1,
                                               't2_create' => 1,
                                               't2_decode_packets' => 1,
                                               't2_destroy' => 1,
                                               't2_encode_packets' => 1,
                                               'tcd_create' => 1,
                                               'tcd_decode_tile' => 1,
                                               'tcd_destroy' => 1,
                                               'tcd_dump' => 1,
                                               'tcd_encode_tile' => 1,
                                               'tcd_free_decode' => 1,
                                               'tcd_free_encode' => 1,
                                               'tcd_init_encode' => 1,
                                               'tcd_makelayer' => 1,
                                               'tcd_makelayer_fixed' => 1,
                                               'tcd_malloc_decode' => 1,
                                               'tcd_malloc_encode' => 1,
                                               'tcd_rateallocate' => 1,
                                               'tcd_rateallocate_fixed' => 1,
                                               'tgt_create' => 1,
                                               'tgt_decode' => 1,
                                               'tgt_destroy' => 1,
                                               'tgt_encode' => 1,
                                               'tgt_reset' => 1,
                                               'tgt_setvalue' => 1
                                             }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100430' => {
                                        'Header' => 't2.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cinfo',
                                                             'offset' => '0',
                                                             'type' => '3008'
                                                           },
                                                    '1' => {
                                                             'name' => 'image',
                                                             'offset' => '8',
                                                             'type' => '4957'
                                                           },
                                                    '2' => {
                                                             'name' => 'cp',
                                                             'offset' => '16',
                                                             'type' => '4963'
                                                           }
                                                  },
                                        'Name' => 'struct opj_t2',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '100478' => {
                                        'BaseType' => '100430',
                                        'Header' => 't2.h',
                                        'Line' => '53',
                                        'Name' => 'opj_t2_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '104418' => {
                                        'BaseType' => '100478',
                                        'Name' => 'opj_t2_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '105' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '112' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '137' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '148' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '84',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '170' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '17086' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '498',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '17209' => {
                                       'BaseType' => '17086',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '517',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '17635' => {
                                       'BaseType' => '17209',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '177' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '17905' => {
                                       'BaseType' => '184',
                                       'Header' => 'stdio.h',
                                       'Line' => '48',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '184' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '77'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '150'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '150'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '150'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '624'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '630'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '77'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '77'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '126'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '105'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '636'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '150'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '652'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '137'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '148'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '148'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '148'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '148'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '77'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '658'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '150'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '150'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '150'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '150'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '150'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '150'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '150'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '1858' => {
                                      'BaseType' => '1864',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1864' => {
                                      'BaseType' => '84',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '18775' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '198',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '77'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '2530'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '2850'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '1080',
                                                             'type' => '77'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '1084',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '1088',
                                                             'type' => '2866'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '1488',
                                                             'type' => '2866'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '1888',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '1892',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '1896',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '1900',
                                                             'type' => '77'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '1904',
                                                             'type' => '77'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '1908',
                                                             'type' => '77'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '1912',
                                                             'type' => '77'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '1916',
                                                             'type' => '77'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '1920',
                                                             'type' => '2882'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '2052',
                                                             'type' => '2882'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '2184',
                                                             'type' => '19315'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '6280',
                                                             'type' => '19315'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '10376',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '10380',
                                                             'type' => '19315'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '14476',
                                                             'type' => '77'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '14480',
                                                             'type' => '77'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '14484',
                                                             'type' => '77'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '14488',
                                                             'type' => '77'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '14492',
                                                             'type' => '77'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '14496',
                                                             'type' => '77'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '1941'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '14504',
                                       'Type' => 'Struct'
                                     },
                          '19315' => {
                                       'BaseType' => '84',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '19332' => {
                                       'BaseType' => '18775',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '312',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '14504',
                                       'Type' => 'Typedef'
                                     },
                          '19344' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '317',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '19315'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '19315'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8208',
                                       'Type' => 'Struct'
                                     },
                          '1941' => {
                                      'BaseType' => '77',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '19440' => {
                                       'BaseType' => '19344',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '359',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8208',
                                       'Type' => 'Typedef'
                                     },
                          '1954' => {
                                      'BaseType' => '84',
                                      'Name' => 'char[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '21609' => {
                                       'Header' => 'jpt.h',
                                       'Line' => '42',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'Id',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_byte',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'Class_Id',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'CSn_Id',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'Msg_offset',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '5' => {
                                                            'name' => 'Msg_length',
                                                            'offset' => '20',
                                                            'type' => '98'
                                                          },
                                                   '6' => {
                                                            'name' => 'Layer_nb',
                                                            'offset' => '24',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct opj_jpt_msg_header',
                                       'Size' => '28',
                                       'Type' => 'Struct'
                                     },
                          '21705' => {
                                       'BaseType' => '21609',
                                       'Header' => 'jpt.h',
                                       'Line' => '57',
                                       'Name' => 'opj_jpt_msg_header_t',
                                       'Size' => '28',
                                       'Type' => 'Typedef'
                                     },
                          '22907' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '8470'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbpix',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'distotile',
                                                            'offset' => '40',
                                                            'type' => '177'
                                                          },
                                                   '8' => {
                                                            'name' => 'distolayer',
                                                            'offset' => '48',
                                                            'type' => '23031'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd_tile',
                                       'Size' => '848',
                                       'Type' => 'Struct'
                                     },
                          '23031' => {
                                       'BaseType' => '177',
                                       'Name' => 'double[100]',
                                       'Size' => '800',
                                       'Type' => 'Array'
                                     },
                          '23047' => {
                                       'BaseType' => '22907',
                                       'Header' => 'tcd.h',
                                       'Line' => '147',
                                       'Name' => 'opj_tcd_tile_t',
                                       'Size' => '848',
                                       'Type' => 'Typedef'
                                     },
                          '23058' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tw',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'th',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'tiles',
                                                            'offset' => '8',
                                                            'type' => '23105'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd_image',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23105' => {
                                       'BaseType' => '23047',
                                       'Name' => 'opj_tcd_tile_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23111' => {
                                       'BaseType' => '23058',
                                       'Header' => 'tcd.h',
                                       'Line' => '155',
                                       'Name' => 'opj_tcd_image_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '23122' => {
                                       'Header' => 'tcd.h',
                                       'Line' => '160',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cinfo',
                                                            'offset' => '0',
                                                            'type' => '3008'
                                                          },
                                                   '1' => {
                                                            'name' => 'tcd_image',
                                                            'offset' => '8',
                                                            'type' => '23218'
                                                          },
                                                   '2' => {
                                                            'name' => 'image',
                                                            'offset' => '16',
                                                            'type' => '4957'
                                                          },
                                                   '3' => {
                                                            'name' => 'cp',
                                                            'offset' => '24',
                                                            'type' => '4963'
                                                          },
                                                   '4' => {
                                                            'name' => 'tcd_tile',
                                                            'offset' => '32',
                                                            'type' => '23105'
                                                          },
                                                   '5' => {
                                                            'name' => 'tcp',
                                                            'offset' => '40',
                                                            'type' => '4198'
                                                          },
                                                   '6' => {
                                                            'name' => 'tcd_tileno',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tcd',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '23218' => {
                                       'BaseType' => '23111',
                                       'Name' => 'opj_tcd_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23224' => {
                                       'BaseType' => '23122',
                                       'Header' => 'tcd.h',
                                       'Line' => '176',
                                       'Name' => 'opj_tcd_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '2481' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '117',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PROG_UNKNOWN',
                                                           'value' => '-1'
                                                         },
                                                  '1' => {
                                                           'name' => 'LRCP',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'RLCP',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'RPCL',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'PCRL',
                                                           'value' => '3'
                                                         },
                                                  '5' => {
                                                           'name' => 'CPRL',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum PROG_ORDER',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2530' => {
                                      'BaseType' => '2481',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '124',
                                      'Name' => 'OPJ_PROG_ORDER',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2541' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '129',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'CLRSPC_UNKNOWN',
                                                           'value' => '-1'
                                                         },
                                                  '1' => {
                                                           'name' => 'CLRSPC_SRGB',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'CLRSPC_GRAY',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'CLRSPC_SYCC',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum COLOR_SPACE',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2578' => {
                                      'BaseType' => '2541',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '134',
                                      'Name' => 'OPJ_COLOR_SPACE',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2589' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '139',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'CODEC_UNKNOWN',
                                                           'value' => '-1'
                                                         },
                                                  '1' => {
                                                           'name' => 'CODEC_J2K',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'CODEC_JPT',
                                                           'value' => '1'
                                                         },
                                                  '3' => {
                                                           'name' => 'CODEC_JP2',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum CODEC_FORMAT',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2626' => {
                                      'BaseType' => '2589',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '144',
                                      'Name' => 'OPJ_CODEC_FORMAT',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2637' => {
                                      'BaseType' => '2648',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '157',
                                      'Name' => 'opj_msg_callback',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2648' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1858'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2670' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '168',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'error_handler',
                                                           'offset' => '0',
                                                           'type' => '2637'
                                                         },
                                                  '1' => {
                                                           'name' => 'warning_handler',
                                                           'offset' => '8',
                                                           'type' => '2637'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_handler',
                                                           'offset' => '16',
                                                           'type' => '2637'
                                                         }
                                                },
                                      'Name' => 'struct opj_event_mgr',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2719' => {
                                      'BaseType' => '2670',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '175',
                                      'Name' => 'opj_event_mgr_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '2730' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '187',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'resno0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'compno0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'layno1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'resno1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'compno1',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'prg',
                                                           'offset' => '20',
                                                           'type' => '2530'
                                                         },
                                                  '6' => {
                                                           'name' => 'tile',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'progorder',
                                                           'offset' => '28',
                                                           'type' => '1954'
                                                         }
                                                },
                                      'Name' => 'struct opj_poc',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '2839' => {
                                      'BaseType' => '2730',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '193',
                                      'Name' => 'opj_poc_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '2850' => {
                                      'BaseType' => '2839',
                                      'Name' => 'opj_poc_t[32]',
                                      'Size' => '1024',
                                      'Type' => 'Array'
                                    },
                          '2866' => {
                                      'BaseType' => '170',
                                      'Name' => 'float[100]',
                                      'Size' => '400',
                                      'Type' => 'Array'
                                    },
                          '2882' => {
                                      'BaseType' => '77',
                                      'Name' => 'int[33]',
                                      'Size' => '132',
                                      'Type' => 'Array'
                                    },
                          '28919' => {
                                       'BaseType' => '23224',
                                       'Name' => 'opj_tcd_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2898' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '375',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'event_mgr',
                                                           'offset' => '0',
                                                           'type' => '2990'
                                                         },
                                                  '1' => {
                                                           'name' => 'client_data',
                                                           'offset' => '8',
                                                           'type' => '148'
                                                         },
                                                  '2' => {
                                                           'name' => 'is_decompressor',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'codec_format',
                                                           'offset' => '20',
                                                           'type' => '2626'
                                                         },
                                                  '4' => {
                                                           'name' => 'j2k_handle',
                                                           'offset' => '24',
                                                           'type' => '148'
                                                         },
                                                  '5' => {
                                                           'name' => 'jp2_handle',
                                                           'offset' => '32',
                                                           'type' => '148'
                                                         }
                                                },
                                      'Name' => 'struct opj_common_struct',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '2990' => {
                                      'BaseType' => '2719',
                                      'Name' => 'opj_event_mgr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2996' => {
                                      'BaseType' => '2898',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '381',
                                      'Name' => 'opj_common_struct_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '3008' => {
                                      'BaseType' => '3020',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '383',
                                      'Name' => 'opj_common_ptr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3020' => {
                                      'BaseType' => '2996',
                                      'Name' => 'opj_common_struct_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3026' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '420',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3008'
                                                         },
                                                  '1' => {
                                                           'name' => 'openmode',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'buffer',
                                                           'offset' => '16',
                                                           'type' => '674'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'start',
                                                           'offset' => '32',
                                                           'type' => '674'
                                                         },
                                                  '5' => {
                                                           'name' => 'end',
                                                           'offset' => '40',
                                                           'type' => '674'
                                                         },
                                                  '6' => {
                                                           'name' => 'bp',
                                                           'offset' => '48',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_cio',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3136' => {
                                      'BaseType' => '3026',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '437',
                                      'Name' => 'opj_cio_t',
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '3148' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '448',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dx',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'dy',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'factor',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'data',
                                                            'offset' => '48',
                                                            'type' => '1941'
                                                          },
                                                  '2' => {
                                                           'name' => 'w',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'h',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'x0',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'y0',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'prec',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'bpp',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'sgnd',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'resno_decoded',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_image_comp',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3310' => {
                                      'BaseType' => '3148',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '473',
                                      'Name' => 'opj_image_comp_t',
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '3322' => {
                                      'Header' => 'openjpeg.h',
                                      'Line' => '478',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numcomps',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'color_space',
                                                           'offset' => '20',
                                                           'type' => '2578'
                                                         },
                                                  '6' => {
                                                           'name' => 'comps',
                                                           'offset' => '24',
                                                           'type' => '3423'
                                                         }
                                                },
                                      'Name' => 'struct opj_image',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3423' => {
                                      'BaseType' => '3310',
                                      'Name' => 'opj_image_comp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3429' => {
                                      'BaseType' => '3322',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '493',
                                      'Name' => 'opj_image_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '3441' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '109',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expn',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'mant',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_stepsize',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '3478' => {
                                      'BaseType' => '3441',
                                      'Header' => 'j2k.h',
                                      'Line' => '114',
                                      'Name' => 'opj_stepsize_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3489' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'csty',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'numresolutions',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'prcw',
                                                            'offset' => '812',
                                                            'type' => '2882'
                                                          },
                                                  '11' => {
                                                            'name' => 'prch',
                                                            'offset' => '944',
                                                            'type' => '2882'
                                                          },
                                                  '2' => {
                                                           'name' => 'cblkw',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'cblkh',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'cblksty',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'qmfbid',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'qntsty',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'stepsizes',
                                                           'offset' => '28',
                                                           'type' => '3651'
                                                         },
                                                  '8' => {
                                                           'name' => 'numgbits',
                                                           'offset' => '804',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'roishift',
                                                           'offset' => '808',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tccp',
                                      'Size' => '1076',
                                      'Type' => 'Struct'
                                    },
                          '3651' => {
                                      'BaseType' => '3478',
                                      'Name' => 'opj_stepsize_t[97]',
                                      'Size' => '776',
                                      'Type' => 'Array'
                                    },
                          '3667' => {
                                      'BaseType' => '3489',
                                      'Header' => 'j2k.h',
                                      'Line' => '144',
                                      'Name' => 'opj_tccp_t',
                                      'Size' => '1076',
                                      'Type' => 'Typedef'
                                    },
                          '3678' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '151',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'first',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'csty',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'ppt_data_first',
                                                            'offset' => '1464',
                                                            'type' => '674'
                                                          },
                                                  '11' => {
                                                            'name' => 'ppt',
                                                            'offset' => '1472',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'ppt_store',
                                                            'offset' => '1476',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'ppt_len',
                                                            'offset' => '1480',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'distoratio',
                                                            'offset' => '1484',
                                                            'type' => '2866'
                                                          },
                                                  '15' => {
                                                            'name' => 'tccps',
                                                            'offset' => '1888',
                                                            'type' => '3894'
                                                          },
                                                  '2' => {
                                                           'name' => 'prg',
                                                           'offset' => '8',
                                                           'type' => '2530'
                                                         },
                                                  '3' => {
                                                           'name' => 'numlayers',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'mct',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'rates',
                                                           'offset' => '20',
                                                           'type' => '2866'
                                                         },
                                                  '6' => {
                                                           'name' => 'numpocs',
                                                           'offset' => '420',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'POC',
                                                           'offset' => '424',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'pocs',
                                                           'offset' => '428',
                                                           'type' => '2850'
                                                         },
                                                  '9' => {
                                                           'name' => 'ppt_data',
                                                           'offset' => '1456',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcp',
                                      'Size' => '1896',
                                      'Type' => 'Struct'
                                    },
                          '37321' => {
                                       'BaseType' => '17905',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3894' => {
                                      'BaseType' => '3667',
                                      'Name' => 'opj_tccp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3900' => {
                                      'BaseType' => '3678',
                                      'Header' => 'j2k.h',
                                      'Line' => '184',
                                      'Name' => 'opj_tcp_t',
                                      'Size' => '1896',
                                      'Type' => 'Typedef'
                                    },
                          '3911' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '189',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'disto_alloc',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'fixed_alloc',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'comment',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          },
                                                  '11' => {
                                                            'name' => 'tw',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'th',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'tileno',
                                                            'offset' => '56',
                                                            'type' => '1941'
                                                          },
                                                  '14' => {
                                                            'name' => 'tileno_size',
                                                            'offset' => '64',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'ppm_data',
                                                            'offset' => '72',
                                                            'type' => '674'
                                                          },
                                                  '16' => {
                                                            'name' => 'ppm_data_first',
                                                            'offset' => '80',
                                                            'type' => '674'
                                                          },
                                                  '17' => {
                                                            'name' => 'ppm',
                                                            'offset' => '88',
                                                            'type' => '77'
                                                          },
                                                  '18' => {
                                                            'name' => 'ppm_store',
                                                            'offset' => '92',
                                                            'type' => '77'
                                                          },
                                                  '19' => {
                                                            'name' => 'ppm_previous',
                                                            'offset' => '96',
                                                            'type' => '77'
                                                          },
                                                  '2' => {
                                                           'name' => 'fixed_quality',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '20' => {
                                                            'name' => 'ppm_len',
                                                            'offset' => '100',
                                                            'type' => '77'
                                                          },
                                                  '21' => {
                                                            'name' => 'tcps',
                                                            'offset' => '104',
                                                            'type' => '4198'
                                                          },
                                                  '22' => {
                                                            'name' => 'matrice',
                                                            'offset' => '112',
                                                            'type' => '1941'
                                                          },
                                                  '3' => {
                                                           'name' => 'reduce',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'layer',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'index_on',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'tx0',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'ty0',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'tdx',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'tdy',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_cp',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '39891' => {
                                       'BaseType' => '19440',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4198' => {
                                      'BaseType' => '3900',
                                      'Name' => 'opj_tcp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4204' => {
                                      'BaseType' => '3911',
                                      'Header' => 'j2k.h',
                                      'Line' => '280',
                                      'Name' => 'opj_cp_t',
                                      'Size' => '120',
                                      'Type' => 'Typedef'
                                    },
                          '4216' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '285',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'start_pos',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'end_pos',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'disto',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         }
                                                },
                                      'Name' => 'struct opj_packet_info',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '42205' => {
                                       'BaseType' => '19332',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4269' => {
                                      'BaseType' => '4216',
                                      'Header' => 'j2k.h',
                                      'Line' => '292',
                                      'Name' => 'opj_packet_info_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '4281' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '297',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'thresh',
                                                           'offset' => '0',
                                                           'type' => '4455'
                                                         },
                                                  '1' => {
                                                           'name' => 'num_tile',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'nbpix',
                                                            'offset' => '560',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'distotile',
                                                            'offset' => '568',
                                                            'type' => '177'
                                                          },
                                                  '2' => {
                                                           'name' => 'start_pos',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'end_header',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'end_pos',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'pw',
                                                           'offset' => '24',
                                                           'type' => '2882'
                                                         },
                                                  '6' => {
                                                           'name' => 'ph',
                                                           'offset' => '156',
                                                           'type' => '2882'
                                                         },
                                                  '7' => {
                                                           'name' => 'pdx',
                                                           'offset' => '288',
                                                           'type' => '2882'
                                                         },
                                                  '8' => {
                                                           'name' => 'pdy',
                                                           'offset' => '420',
                                                           'type' => '2882'
                                                         },
                                                  '9' => {
                                                           'name' => 'packet',
                                                           'offset' => '552',
                                                           'type' => '4461'
                                                         }
                                                },
                                      'Name' => 'struct opj_tile_info',
                                      'Size' => '576',
                                      'Type' => 'Struct'
                                    },
                          '43850' => {
                                       'BaseType' => '21705',
                                       'Name' => 'opj_jpt_msg_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4455' => {
                                      'BaseType' => '177',
                                      'Name' => 'double*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4461' => {
                                      'BaseType' => '4269',
                                      'Name' => 'opj_packet_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4467' => {
                                      'BaseType' => '4281',
                                      'Header' => 'j2k.h',
                                      'Line' => '322',
                                      'Name' => 'opj_tile_info_t',
                                      'Size' => '576',
                                      'Type' => 'Typedef'
                                    },
                          '4479' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '327',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'index_on',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'D_max',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '10' => {
                                                            'name' => 'tile_Oy',
                                                            'offset' => '48',
                                                            'type' => '77'
                                                          },
                                                  '11' => {
                                                            'name' => 'tw',
                                                            'offset' => '52',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'th',
                                                            'offset' => '56',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'comp',
                                                            'offset' => '60',
                                                            'type' => '77'
                                                          },
                                                  '14' => {
                                                            'name' => 'layer',
                                                            'offset' => '64',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'decomposition',
                                                            'offset' => '68',
                                                            'type' => '77'
                                                          },
                                                  '16' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '72',
                                                            'type' => '77'
                                                          },
                                                  '17' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '76',
                                                            'type' => '77'
                                                          },
                                                  '18' => {
                                                            'name' => 'tile',
                                                            'offset' => '80',
                                                            'type' => '4738'
                                                          },
                                                  '2' => {
                                                           'name' => 'num',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'index_write',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'image_w',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'image_h',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'prog',
                                                           'offset' => '32',
                                                           'type' => '2530'
                                                         },
                                                  '7' => {
                                                           'name' => 'tile_x',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'tile_y',
                                                           'offset' => '40',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'tile_Ox',
                                                           'offset' => '44',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_image_info',
                                      'Size' => '88',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '212',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4738' => {
                                      'BaseType' => '4467',
                                      'Name' => 'opj_tile_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4744' => {
                                      'BaseType' => '4479',
                                      'Header' => 'j2k.h',
                                      'Line' => '366',
                                      'Name' => 'opj_image_info_t',
                                      'Size' => '88',
                                      'Type' => 'Typedef'
                                    },
                          '4756' => {
                                      'Header' => 'j2k.h',
                                      'Line' => '371',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3008'
                                                         },
                                                  '1' => {
                                                           'name' => 'state',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'image',
                                                            'offset' => '64',
                                                            'type' => '4957'
                                                          },
                                                  '11' => {
                                                            'name' => 'cp',
                                                            'offset' => '72',
                                                            'type' => '4963'
                                                          },
                                                  '12' => {
                                                            'name' => 'image_info',
                                                            'offset' => '80',
                                                            'type' => '4969'
                                                          },
                                                  '13' => {
                                                            'name' => 'cio',
                                                            'offset' => '88',
                                                            'type' => '4975'
                                                          },
                                                  '2' => {
                                                           'name' => 'curtileno',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'eot',
                                                           'offset' => '16',
                                                           'type' => '674'
                                                         },
                                                  '4' => {
                                                           'name' => 'sot_start',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'sod_start',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'pos_correction',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'tile_data',
                                                           'offset' => '40',
                                                           'type' => '4951'
                                                         },
                                                  '8' => {
                                                           'name' => 'tile_len',
                                                           'offset' => '48',
                                                           'type' => '1941'
                                                         },
                                                  '9' => {
                                                           'name' => 'default_tcp',
                                                           'offset' => '56',
                                                           'type' => '4198'
                                                         }
                                                },
                                      'Name' => 'struct opj_j2k',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '4951' => {
                                      'BaseType' => '674',
                                      'Name' => 'unsigned char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4957' => {
                                      'BaseType' => '3429',
                                      'Name' => 'opj_image_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4963' => {
                                      'BaseType' => '4204',
                                      'Name' => 'opj_cp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4969' => {
                                      'BaseType' => '4744',
                                      'Name' => 'opj_image_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4975' => {
                                      'BaseType' => '3136',
                                      'Name' => 'opj_cio_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4981' => {
                                      'BaseType' => '4756',
                                      'Header' => 'j2k.h',
                                      'Line' => '412',
                                      'Name' => 'opj_j2k_t',
                                      'Size' => '96',
                                      'Type' => 'Typedef'
                                    },
                          '4993' => {
                                      'Header' => 'jp2.h',
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'depth',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'sgnd',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'bpcc',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_jp2_comps',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '5042' => {
                                      'BaseType' => '4993',
                                      'Header' => 'jp2.h',
                                      'Line' => '62',
                                      'Name' => 'opj_jp2_comps_t',
                                      'Size' => '12',
                                      'Type' => 'Typedef'
                                    },
                          '5053' => {
                                      'Header' => 'jp2.h',
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cinfo',
                                                           'offset' => '0',
                                                           'type' => '3008'
                                                         },
                                                  '1' => {
                                                           'name' => 'j2k',
                                                           'offset' => '8',
                                                           'type' => '5299'
                                                         },
                                                  '10' => {
                                                            'name' => 'approx',
                                                            'offset' => '48',
                                                            'type' => '98'
                                                          },
                                                  '11' => {
                                                            'name' => 'enumcs',
                                                            'offset' => '52',
                                                            'type' => '98'
                                                          },
                                                  '12' => {
                                                            'name' => 'precedence',
                                                            'offset' => '56',
                                                            'type' => '98'
                                                          },
                                                  '13' => {
                                                            'name' => 'brand',
                                                            'offset' => '60',
                                                            'type' => '98'
                                                          },
                                                  '14' => {
                                                            'name' => 'minversion',
                                                            'offset' => '64',
                                                            'type' => '98'
                                                          },
                                                  '15' => {
                                                            'name' => 'numcl',
                                                            'offset' => '68',
                                                            'type' => '98'
                                                          },
                                                  '16' => {
                                                            'name' => 'cl',
                                                            'offset' => '72',
                                                            'type' => '5305'
                                                          },
                                                  '17' => {
                                                            'name' => 'comps',
                                                            'offset' => '80',
                                                            'type' => '5311'
                                                          },
                                                  '18' => {
                                                            'name' => 'j2k_codestream_offset',
                                                            'offset' => '88',
                                                            'type' => '98'
                                                          },
                                                  '19' => {
                                                            'name' => 'j2k_codestream_length',
                                                            'offset' => '92',
                                                            'type' => '98'
                                                          },
                                                  '2' => {
                                                           'name' => 'w',
                                                           'offset' => '16',
                                                           'type' => '98'
                                                         },
                                                  '3' => {
                                                           'name' => 'h',
                                                           'offset' => '20',
                                                           'type' => '98'
                                                         },
                                                  '4' => {
                                                           'name' => 'numcomps',
                                                           'offset' => '24',
                                                           'type' => '98'
                                                         },
                                                  '5' => {
                                                           'name' => 'bpc',
                                                           'offset' => '28',
                                                           'type' => '98'
                                                         },
                                                  '6' => {
                                                           'name' => 'C',
                                                           'offset' => '32',
                                                           'type' => '98'
                                                         },
                                                  '7' => {
                                                           'name' => 'UnkC',
                                                           'offset' => '36',
                                                           'type' => '98'
                                                         },
                                                  '8' => {
                                                           'name' => 'IPR',
                                                           'offset' => '40',
                                                           'type' => '98'
                                                         },
                                                  '9' => {
                                                           'name' => 'meth',
                                                           'offset' => '44',
                                                           'type' => '98'
                                                         }
                                                },
                                      'Name' => 'struct opj_jp2',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '50645' => {
                                       'BaseType' => '5317',
                                       'Name' => 'opj_jp2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5299' => {
                                      'BaseType' => '4981',
                                      'Name' => 'opj_j2k_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5305' => {
                                      'BaseType' => '98',
                                      'Name' => 'unsigned int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5311' => {
                                      'BaseType' => '5042',
                                      'Name' => 'opj_jp2_comps_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5317' => {
                                      'BaseType' => '5053',
                                      'Header' => 'jp2.h',
                                      'Line' => '90',
                                      'Name' => 'opj_jp2_t',
                                      'Size' => '96',
                                      'Type' => 'Typedef'
                                    },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '568' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '575' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '624'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '630'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '624' => {
                                     'BaseType' => '575',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '62470' => {
                                       'Header' => 'mqc.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'qeval',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'mps',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'nmps',
                                                            'offset' => '8',
                                                            'type' => '62531'
                                                          },
                                                   '3' => {
                                                            'name' => 'nlps',
                                                            'offset' => '16',
                                                            'type' => '62531'
                                                          }
                                                 },
                                       'Name' => 'struct opj_mqc_state',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '62531' => {
                                       'BaseType' => '62470',
                                       'Name' => 'struct opj_mqc_state*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62537' => {
                                       'BaseType' => '62470',
                                       'Header' => 'mqc.h',
                                       'Line' => '57',
                                       'Name' => 'opj_mqc_state_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '62548' => {
                                       'Header' => 'mqc.h',
                                       'Line' => '64',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'c',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'a',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'ct',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'bp',
                                                            'offset' => '16',
                                                            'type' => '674'
                                                          },
                                                   '4' => {
                                                            'name' => 'start',
                                                            'offset' => '24',
                                                            'type' => '674'
                                                          },
                                                   '5' => {
                                                            'name' => 'end',
                                                            'offset' => '32',
                                                            'type' => '674'
                                                          },
                                                   '6' => {
                                                            'name' => 'ctxs',
                                                            'offset' => '40',
                                                            'type' => '62653'
                                                          },
                                                   '7' => {
                                                            'name' => 'curctx',
                                                            'offset' => '296',
                                                            'type' => '62675'
                                                          }
                                                 },
                                       'Name' => 'struct opj_mqc',
                                       'Size' => '304',
                                       'Type' => 'Struct'
                                     },
                          '62653' => {
                                       'BaseType' => '62669',
                                       'Name' => 'opj_mqc_state_t*[32]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '62669' => {
                                       'BaseType' => '62537',
                                       'Name' => 'opj_mqc_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62675' => {
                                       'BaseType' => '62669',
                                       'Name' => 'opj_mqc_state_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62681' => {
                                       'BaseType' => '62548',
                                       'Header' => 'mqc.h',
                                       'Line' => '73',
                                       'Name' => 'opj_mqc_t',
                                       'Size' => '304',
                                       'Type' => 'Typedef'
                                     },
                          '62692' => {
                                       'BaseType' => '62681',
                                       'Name' => 'opj_mqc_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '630' => {
                                     'BaseType' => '184',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '636' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '652' => {
                                     'BaseType' => '568',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '658' => {
                                     'BaseType' => '84',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '66986' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '388',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_mgr',
                                                            'offset' => '0',
                                                            'type' => '2990'
                                                          },
                                                   '1' => {
                                                            'name' => 'client_data',
                                                            'offset' => '8',
                                                            'type' => '148'
                                                          },
                                                   '2' => {
                                                            'name' => 'is_decompressor',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'codec_format',
                                                            'offset' => '20',
                                                            'type' => '2626'
                                                          },
                                                   '4' => {
                                                            'name' => 'j2k_handle',
                                                            'offset' => '24',
                                                            'type' => '148'
                                                          },
                                                   '5' => {
                                                            'name' => 'jp2_handle',
                                                            'offset' => '32',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cinfo',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '67078' => {
                                       'BaseType' => '66986',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '392',
                                       'Name' => 'opj_cinfo_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '67090' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '397',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_mgr',
                                                            'offset' => '0',
                                                            'type' => '2990'
                                                          },
                                                   '1' => {
                                                            'name' => 'client_data',
                                                            'offset' => '8',
                                                            'type' => '148'
                                                          },
                                                   '2' => {
                                                            'name' => 'is_decompressor',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'codec_format',
                                                            'offset' => '20',
                                                            'type' => '2626'
                                                          },
                                                   '4' => {
                                                            'name' => 'j2k_handle',
                                                            'offset' => '24',
                                                            'type' => '148'
                                                          },
                                                   '5' => {
                                                            'name' => 'jp2_handle',
                                                            'offset' => '32',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dinfo',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '67182' => {
                                       'BaseType' => '67090',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '401',
                                       'Name' => 'opj_dinfo_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '674' => {
                                     'BaseType' => '91',
                                     'Name' => 'unsigned char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '680' => {
                                     'Header' => 'bio.h',
                                     'Line' => '47',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'start',
                                                          'offset' => '0',
                                                          'type' => '674'
                                                        },
                                                 '1' => {
                                                          'name' => 'end',
                                                          'offset' => '8',
                                                          'type' => '674'
                                                        },
                                                 '2' => {
                                                          'name' => 'bp',
                                                          'offset' => '16',
                                                          'type' => '674'
                                                        },
                                                 '3' => {
                                                          'name' => 'buf',
                                                          'offset' => '24',
                                                          'type' => '98'
                                                        },
                                                 '4' => {
                                                          'name' => 'ct',
                                                          'offset' => '28',
                                                          'type' => '77'
                                                        }
                                               },
                                     'Name' => 'struct opj_bio',
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '69729' => {
                                       'BaseType' => '67182',
                                       'Name' => 'opj_dinfo_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '70232' => {
                                       'BaseType' => '67078',
                                       'Name' => 'opj_cinfo_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7279' => {
                                      'Header' => 'tgt.h',
                                      'Line' => '48',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent',
                                                           'offset' => '0',
                                                           'type' => '7340'
                                                         },
                                                  '1' => {
                                                           'name' => 'value',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'low',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'known',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tgt_node',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '73020' => {
                                       'Header' => 'pi.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'pdy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'pw',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'ph',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_resolution',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '73079' => {
                                       'BaseType' => '73020',
                                       'Header' => 'pi.h',
                                       'Line' => '52',
                                       'Name' => 'opj_pi_resolution_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '73090' => {
                                       'Header' => 'pi.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '77'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'name' => 'resolutions',
                                                            'offset' => '16',
                                                            'type' => '73149'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_comp',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '73149' => {
                                       'BaseType' => '73079',
                                       'Name' => 'opj_pi_resolution_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73155' => {
                                       'BaseType' => '73090',
                                       'Header' => 'pi.h',
                                       'Line' => '62',
                                       'Name' => 'opj_pi_comp_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '73166' => {
                                       'Header' => 'pi.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'include',
                                                            'offset' => '0',
                                                            'type' => '73425'
                                                          },
                                                   '1' => {
                                                            'name' => 'step_l',
                                                            'offset' => '8',
                                                            'type' => '77'
                                                          },
                                                   '10' => {
                                                             'name' => 'poc',
                                                             'offset' => '44',
                                                             'type' => '2839'
                                                           },
                                                   '11' => {
                                                             'name' => 'numcomps',
                                                             'offset' => '76',
                                                             'type' => '77'
                                                           },
                                                   '12' => {
                                                             'name' => 'comps',
                                                             'offset' => '80',
                                                             'type' => '73431'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx0',
                                                             'offset' => '88',
                                                             'type' => '77'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '92',
                                                             'type' => '77'
                                                           },
                                                   '15' => {
                                                             'name' => 'tx1',
                                                             'offset' => '96',
                                                             'type' => '77'
                                                           },
                                                   '16' => {
                                                             'name' => 'ty1',
                                                             'offset' => '100',
                                                             'type' => '77'
                                                           },
                                                   '17' => {
                                                             'name' => 'x',
                                                             'offset' => '104',
                                                             'type' => '77'
                                                           },
                                                   '18' => {
                                                             'name' => 'y',
                                                             'offset' => '108',
                                                             'type' => '77'
                                                           },
                                                   '19' => {
                                                             'name' => 'dx',
                                                             'offset' => '112',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'step_r',
                                                            'offset' => '12',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'dy',
                                                             'offset' => '116',
                                                             'type' => '77'
                                                           },
                                                   '3' => {
                                                            'name' => 'step_c',
                                                            'offset' => '16',
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'name' => 'step_p',
                                                            'offset' => '20',
                                                            'type' => '77'
                                                          },
                                                   '5' => {
                                                            'name' => 'compno',
                                                            'offset' => '24',
                                                            'type' => '77'
                                                          },
                                                   '6' => {
                                                            'name' => 'resno',
                                                            'offset' => '28',
                                                            'type' => '77'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno',
                                                            'offset' => '32',
                                                            'type' => '77'
                                                          },
                                                   '8' => {
                                                            'name' => 'layno',
                                                            'offset' => '36',
                                                            'type' => '77'
                                                          },
                                                   '9' => {
                                                            'name' => 'first',
                                                            'offset' => '40',
                                                            'type' => '77'
                                                          }
                                                 },
                                       'Name' => 'struct opj_pi_iterator',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '7340' => {
                                      'BaseType' => '7279',
                                      'Name' => 'struct opj_tgt_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '73425' => {
                                       'BaseType' => '112',
                                       'Name' => 'short*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73431' => {
                                       'BaseType' => '73155',
                                       'Name' => 'opj_pi_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73437' => {
                                       'BaseType' => '73166',
                                       'Header' => 'pi.h',
                                       'Line' => '96',
                                       'Name' => 'opj_pi_iterator_t',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '7346' => {
                                      'BaseType' => '7279',
                                      'Header' => 'tgt.h',
                                      'Line' => '53',
                                      'Name' => 'opj_tgt_node_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7357' => {
                                      'Header' => 'tgt.h',
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numleafsh',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'numleafsv',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'numnodes',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'nodes',
                                                           'offset' => '16',
                                                           'type' => '7418'
                                                         }
                                                },
                                      'Name' => 'struct opj_tgt_tree',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '73729' => {
                                       'BaseType' => '73437',
                                       'Name' => 'opj_pi_iterator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7418' => {
                                      'BaseType' => '7346',
                                      'Name' => 'opj_tgt_node_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7424' => {
                                      'BaseType' => '7357',
                                      'Header' => 'tgt.h',
                                      'Line' => '63',
                                      'Name' => 'opj_tgt_tree_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7435' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '47',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '674'
                                                         },
                                                  '3' => {
                                                           'name' => 'maxpasses',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numnewpasses',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'newlen',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_seg',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '751' => {
                                     'BaseType' => '680',
                                     'Header' => 'bio.h',
                                     'Line' => '58',
                                     'Name' => 'opj_bio_t',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '7520' => {
                                      'BaseType' => '7435',
                                      'Header' => 'tcd.h',
                                      'Line' => '54',
                                      'Name' => 'opj_tcd_seg_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '7531' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '59',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rate',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'distortiondec',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '2' => {
                                                           'name' => 'term',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'len',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_pass',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7592' => {
                                      'BaseType' => '7531',
                                      'Header' => 'tcd.h',
                                      'Line' => '63',
                                      'Name' => 'opj_tcd_pass_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7603' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '68',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'disto',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '16',
                                                           'type' => '674'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_layer',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7664' => {
                                      'BaseType' => '7603',
                                      'Header' => 'tcd.h',
                                      'Line' => '73',
                                      'Name' => 'opj_tcd_layer_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7675' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '78',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '10' => {
                                                            'name' => 'segs',
                                                            'offset' => '40',
                                                            'type' => '7882'
                                                          },
                                                  '11' => {
                                                            'name' => 'data',
                                                            'offset' => '3240',
                                                            'type' => '7898'
                                                          },
                                                  '12' => {
                                                            'name' => 'numpassesinlayers',
                                                            'offset' => '11432',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'layers',
                                                            'offset' => '11440',
                                                            'type' => '7915'
                                                          },
                                                  '14' => {
                                                            'name' => 'totalpasses',
                                                            'offset' => '13840',
                                                            'type' => '77'
                                                          },
                                                  '15' => {
                                                            'name' => 'passes',
                                                            'offset' => '13848',
                                                            'type' => '7931'
                                                          },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numbps',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'numlenbits',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'len',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'numpasses',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'numnewpasses',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'numsegs',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_cblk',
                                      'Size' => '16248',
                                      'Type' => 'Struct'
                                    },
                          '77' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7882' => {
                                      'BaseType' => '7520',
                                      'Name' => 'opj_tcd_seg_t[100]',
                                      'Size' => '3200',
                                      'Type' => 'Array'
                                    },
                          '7898' => {
                                      'BaseType' => '91',
                                      'Name' => 'unsigned char[8192]',
                                      'Size' => '8192',
                                      'Type' => 'Array'
                                    },
                          '7915' => {
                                      'BaseType' => '7664',
                                      'Name' => 'opj_tcd_layer_t[100]',
                                      'Size' => '2400',
                                      'Type' => 'Array'
                                    },
                          '79237' => {
                                       'Header' => 'raw.h',
                                       'Line' => '46',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'c',
                                                            'offset' => '0',
                                                            'type' => '91'
                                                          },
                                                   '1' => {
                                                            'name' => 'ct',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'lenmax',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'len',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'bp',
                                                            'offset' => '16',
                                                            'type' => '674'
                                                          },
                                                   '5' => {
                                                            'name' => 'start',
                                                            'offset' => '24',
                                                            'type' => '674'
                                                          },
                                                   '6' => {
                                                            'name' => 'end',
                                                            'offset' => '32',
                                                            'type' => '674'
                                                          }
                                                 },
                                       'Name' => 'struct opj_raw',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '7931' => {
                                      'BaseType' => '7592',
                                      'Name' => 'opj_tcd_pass_t[100]',
                                      'Size' => '2400',
                                      'Type' => 'Array'
                                    },
                          '79330' => {
                                       'BaseType' => '79237',
                                       'Header' => 'raw.h',
                                       'Line' => '61',
                                       'Name' => 'opj_raw_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '79341' => {
                                       'BaseType' => '79330',
                                       'Name' => 'opj_raw_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7947' => {
                                      'BaseType' => '7675',
                                      'Header' => 'tcd.h',
                                      'Line' => '92',
                                      'Name' => 'opj_tcd_cblk_t',
                                      'Size' => '16248',
                                      'Type' => 'Typedef'
                                    },
                          '7958' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '97',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'cw',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'ch',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'cblks',
                                                           'offset' => '24',
                                                           'type' => '8073'
                                                         },
                                                  '7' => {
                                                           'name' => 'incltree',
                                                           'offset' => '32',
                                                           'type' => '8079'
                                                         },
                                                  '8' => {
                                                           'name' => 'imsbtree',
                                                           'offset' => '40',
                                                           'type' => '8079'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_precinct',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '8073' => {
                                      'BaseType' => '7947',
                                      'Name' => 'opj_tcd_cblk_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8079' => {
                                      'BaseType' => '7424',
                                      'Name' => 'opj_tgt_tree_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8085' => {
                                      'BaseType' => '7958',
                                      'Header' => 'tcd.h',
                                      'Line' => '103',
                                      'Name' => 'opj_tcd_precinct_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '809' => {
                                     'BaseType' => '751',
                                     'Name' => 'opj_bio_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '8096' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'bandno',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'precincts',
                                                           'offset' => '24',
                                                           'type' => '8201'
                                                         },
                                                  '6' => {
                                                           'name' => 'numbps',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'stepsize',
                                                           'offset' => '36',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_band',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8201' => {
                                      'BaseType' => '8085',
                                      'Name' => 'opj_tcd_precinct_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8207' => {
                                      'BaseType' => '8096',
                                      'Header' => 'tcd.h',
                                      'Line' => '114',
                                      'Name' => 'opj_tcd_band_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '8218' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'pw',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'ph',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'numbands',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'bands',
                                                           'offset' => '32',
                                                           'type' => '8321'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_resolution',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '83070' => {
                                       'Header' => 't1.h',
                                       'Line' => '94',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cinfo',
                                                            'offset' => '0',
                                                            'type' => '3008'
                                                          },
                                                   '1' => {
                                                            'name' => 'mqc',
                                                            'offset' => '8',
                                                            'type' => '62692'
                                                          },
                                                   '10' => {
                                                             'name' => 'lut_nmsedec_ref0',
                                                             'offset' => '24088',
                                                             'type' => '83315'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '24600',
                                                             'type' => '83265'
                                                           },
                                                   '12' => {
                                                             'name' => 'flags',
                                                             'offset' => '4218904',
                                                             'type' => '83355'
                                                           },
                                                   '2' => {
                                                            'name' => 'raw',
                                                            'offset' => '16',
                                                            'type' => '79341'
                                                          },
                                                   '3' => {
                                                            'name' => 'lut_ctxno_zc',
                                                            'offset' => '24',
                                                            'type' => '83265'
                                                          },
                                                   '4' => {
                                                            'name' => 'lut_ctxno_sc',
                                                            'offset' => '4120',
                                                            'type' => '83282'
                                                          },
                                                   '5' => {
                                                            'name' => 'lut_ctxno_mag',
                                                            'offset' => '5144',
                                                            'type' => '83298'
                                                          },
                                                   '6' => {
                                                            'name' => 'lut_spb',
                                                            'offset' => '21528',
                                                            'type' => '83282'
                                                          },
                                                   '7' => {
                                                            'name' => 'lut_nmsedec_sig',
                                                            'offset' => '22552',
                                                            'type' => '83315'
                                                          },
                                                   '8' => {
                                                            'name' => 'lut_nmsedec_sig0',
                                                            'offset' => '23064',
                                                            'type' => '83315'
                                                          },
                                                   '9' => {
                                                            'name' => 'lut_nmsedec_ref',
                                                            'offset' => '23576',
                                                            'type' => '83315'
                                                          }
                                                 },
                                       'Name' => 'struct opj_t1',
                                       'Size' => '8429608',
                                       'Type' => 'Struct'
                                     },
                          '8321' => {
                                      'BaseType' => '8207',
                                      'Name' => 'opj_tcd_band_t[3]',
                                      'Size' => '120',
                                      'Type' => 'Array'
                                    },
                          '83265' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[1024]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '83282' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[256]',
                                       'Size' => '1024',
                                       'Type' => 'Array'
                                     },
                          '83298' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[4096]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '83315' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[128]',
                                       'Size' => '512',
                                       'Type' => 'Array'
                                     },
                          '83355' => {
                                       'BaseType' => '77',
                                       'Name' => 'int[1026]',
                                       'Size' => '4104',
                                       'Type' => 'Array'
                                     },
                          '8337' => {
                                      'BaseType' => '8218',
                                      'Header' => 'tcd.h',
                                      'Line' => '124',
                                      'Name' => 'opj_tcd_resolution_t',
                                      'Size' => '152',
                                      'Type' => 'Typedef'
                                    },
                          '83379' => {
                                       'BaseType' => '83070',
                                       'Header' => 't1.h',
                                       'Line' => '115',
                                       'Name' => 'opj_t1_t',
                                       'Size' => '8429608',
                                       'Type' => 'Typedef'
                                     },
                          '8348' => {
                                      'Header' => 'tcd.h',
                                      'Line' => '129',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x0',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'y0',
                                                           'offset' => '4',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'x1',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'y1',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'numresolutions',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'resolutions',
                                                           'offset' => '24',
                                                           'type' => '8453'
                                                         },
                                                  '6' => {
                                                           'name' => 'data',
                                                           'offset' => '32',
                                                           'type' => '1941'
                                                         },
                                                  '7' => {
                                                           'name' => 'nbpix',
                                                           'offset' => '40',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct opj_tcd_tilecomp',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '83641' => {
                                       'BaseType' => '83379',
                                       'Name' => 'opj_t1_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8453' => {
                                      'BaseType' => '8337',
                                      'Name' => 'opj_tcd_resolution_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8459' => {
                                      'BaseType' => '8348',
                                      'Header' => 'tcd.h',
                                      'Line' => '135',
                                      'Name' => 'opj_tcd_tilecomp_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '8470' => {
                                      'BaseType' => '8459',
                                      'Name' => 'opj_tcd_tilecomp_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '91' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjpeg.so' => {
                                                        '_ITM_deregisterTMCloneTable' => 0,
                                                        '_ITM_registerTMCloneTable' => 0,
                                                        '_Jv_RegisterClasses' => 0,
                                                        '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                        '__gmon_start__' => 0,
                                                        'ceilf' => 0,
                                                        'fclose@GLIBC_2.2.5' => 0,
                                                        'floor' => 0,
                                                        'floorf' => 0,
                                                        'fopen@GLIBC_2.2.5' => 0,
                                                        'fprintf@GLIBC_2.2.5' => 0,
                                                        'fputc@GLIBC_2.2.5' => 0,
                                                        'free@GLIBC_2.2.5' => 0,
                                                        'fwrite@GLIBC_2.2.5' => 0,
                                                        'getrusage@GLIBC_2.2.5' => 0,
                                                        'malloc@GLIBC_2.2.5' => 0,
                                                        'memcpy@GLIBC_2.14' => 0,
                                                        'memset@GLIBC_2.2.5' => 0,
                                                        'pow' => 0,
                                                        'puts@GLIBC_2.2.5' => 0,
                                                        'realloc@GLIBC_2.2.5' => 0,
                                                        'strcpy@GLIBC_2.2.5' => 0,
                                                        'trunc' => 0,
                                                        'truncf' => 0,
                                                        'vsprintf@GLIBC_2.2.5' => 0
                                                      }
                                },
          'WordSize' => '8'
        };
