$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'openjpeg.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjp2.so.2.2.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'cio.c' => 1,
                         'image.c' => 1,
                         'openjpeg.c' => 1,
                         'thread.c' => 1
                       },
          'SymbolInfo' => {
                            '14395' => {
                                         'Header' => 'openjpeg.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'p_buffer_size',
                                                               'type' => '9029'
                                                             },
                                                      '1' => {
                                                               'name' => 'l_is_input',

                                                    'opj_get_cstr_info' => 1,
                                                    'opj_get_decoded_tile' => 1,
                                                    'opj_get_num_cpus' => 1,
                                                    'opj_has_thread_support' => 1,
                                                    'opj_image_create' => 1,
                                                    'opj_image_data_alloc' => 1,
                                                    'opj_image_data_free' => 1,
                                                    'opj_image_destroy' => 1,
                                                    'opj_image_tile_create' => 1,
                                                    'opj_read_header' => 1,
                                                    'opj_read_tile_header' => 1,
                                                    'opj_set_MCT' => 1,
                                                    'opj_set_decode_area' => 1,
                                                    'opj_set_decoded_resolution_factor' => 1,
                                                    'opj_set_default_decoder_parameters' => 1,
                                                    'opj_set_default_encoder_parameters' => 1,
                                                    'opj_set_error_handler' => 1,
                                                    'opj_set_info_handler' => 1,
                                                    'opj_set_warning_handler' => 1,
                                                    'opj_setup_decoder' => 1,
                                                    'opj_setup_encoder' => 1,
                                                    'opj_start_compress' => 1,
                                                    'opj_stream_create' => 1,
                                                    'opj_stream_create_default_file_stream' => 1,
                                                    'opj_stream_create_file_stream' => 1,
                                                    'opj_stream_default_create' => 1,
                                                    'opj_stream_destroy' => 1,
                                                    'opj_stream_set_read_function' => 1,
                                                    'opj_stream_set_seek_function' => 1,
                                                    'opj_stream_set_skip_function' => 1,
                                                    'opj_stream_set_user_data' => 1,
                                                    'opj_stream_set_user_data_length' => 1,
                                                    'opj_stream_set_write_function' => 1,
                                                    'opj_version' => 1,
                                                    'opj_write_tile' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11085' => {
                                       'BaseType' => '163',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '115',
                                       'Name' => 'OPJ_FLOAT32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11129' => {
                                       'BaseType' => '105',
                                       'Header' => 'stdint.h',
                                       'Line' => '40',
                                       'Name' => 'int64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11151' => {
                                       'BaseType' => '56',
                                       'Header' => 'stdint.h',
                                       'Line' => '55',
                                       'Name' => 'uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11184' => {
                                       'BaseType' => '11151',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '128',
                                       'Name' => 'OPJ_UINT64',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11195' => {
                                       'BaseType' => '11129',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '130',
                                       'Name' => 'OPJ_OFF_T',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '112' => {
                                     'BaseType' => '105',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '11217' => {
                                       'BaseType' => '11229',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '313',
                                       'Name' => 'opj_msg_callback',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11229' => {
                                       'Name' => 'void(*)(char const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '177'
                                                           },
                                                    '1' => {
                                                             'type' => '141'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11251' => {
                                       'BaseType' => '11263',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '594',
                                       'Name' => 'opj_stream_read_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11263' => {
                                       'Name' => 'OPJ_SIZE_T(*)(void*, OPJ_SIZE_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '141'
                                                           },
                                                    '1' => {
                                                             'type' => '9029'
                                                           },
                                                    '2' => {
                                                             'type' => '141'
                                                           }
                                                  },
                                       'Return' => '9029',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11294' => {
                                       'BaseType' => '11263',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '600',
                                       'Name' => 'opj_stream_write_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11306' => {
                                       'BaseType' => '11318',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '606',
                                       'Name' => 'opj_stream_skip_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11318' => {
                                       'Name' => 'OPJ_OFF_T(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11195'
                                                           },
                                                    '1' => {
                                                             'type' => '141'
                                                           }
                                                  },
                                       'Return' => '11195',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11344' => {
                                       'BaseType' => '11356',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '612',
                                       'Name' => 'opj_stream_seek_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11356' => {
                                       'Name' => 'OPJ_BOOL(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11195'
                                                           },
                                                    '1' => {
                                                             'type' => '141'
                                                           }
                                                  },
                                       'Return' => '694',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11382' => {
                                       'BaseType' => '705',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '618',
                                       'Name' => 'opj_stream_free_user_data_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11411' => {
                                       'BaseType' => '141',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '623',
                                       'Name' => 'opj_stream_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11809' => {
                                       'BaseType' => '11085',
                                       'Name' => 'OPJ_FLOAT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11815' => {
                                       'BaseType' => '9018',
                                       'Name' => 'OPJ_UINT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '123' => {
                                     'BaseType' => '105',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '141' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '143' => {
                                     'BaseType' => '149',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '14547' => {
                                       'BaseType' => '11411',
                                       'Name' => 'opj_stream_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '149' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '152283' => {
                                        'BaseType' => '60875',
                                        'Name' => 'opj_codestream_info_v2_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '170' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '177' => {
                                     'BaseType' => '183',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '18269' => {
                                       'BaseType' => '9007',
                                       'Name' => 'OPJ_INT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18281' => {
                                       'BaseType' => '9018',
                                       'Name' => 'OPJ_UINT32[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '183' => {
                                     'BaseType' => '149',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '188' => {
                                     'Header' => 'libio.h',
                                     'Line' => '245',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '98'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '143'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '80',
                                                           'type' => '143'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '88',
                                                           'type' => '143'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '96',
                                                           'type' => '644'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '104',
                                                           'type' => '650'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '112',
                                                           'type' => '98'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '116',
                                                           'type' => '98'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '120',
                                                           'type' => '112'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '128',
                                                           'type' => '70'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '130',
                                                           'type' => '84'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '131',
                                                           'type' => '656'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '16',
                                                          'type' => '143'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '136',
                                                           'type' => '672'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '144',
                                                           'type' => '123'
                                                         },
                                                 '22' => {
                                                           'name' => '__pad1',
                                                           'offset' => '152',
                                                           'type' => '141'
                                                         },
                                                 '23' => {
                                                           'name' => '__pad2',
                                                           'offset' => '160',
                                                           'type' => '141'
                                                         },
                                                 '24' => {
                                                           'name' => '__pad3',
                                                           'offset' => '168',
                                                           'type' => '141'
                                                         },
                                                 '25' => {
                                                           'name' => '__pad4',
                                                           'offset' => '176',
                                                           'type' => '141'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '184',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '192',
                                                           'type' => '98'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '196',
                                                           'type' => '678'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '24',
                                                          'type' => '143'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '32',
                                                          'type' => '143'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '40',
                                                          'type' => '143'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '48',
                                                          'type' => '143'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '56',
                                                          'type' => '143'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '64',
                                                          'type' => '143'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '72',
                                                          'type' => '143'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '203169' => {
                                        'Header' => 'openjpeg.h',
                                        'Line' => '292',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_CODEC_UNKNOWN',
                                                             'value' => '18446744073709551615'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CODEC_J2K',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CODEC_JPT',
                                                             'value' => '1'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CODEC_JP2',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'OPJ_CODEC_JPP',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'OPJ_CODEC_JPX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '203219' => {
                                        'BaseType' => '203169',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '299',
                                        'Name' => 'OPJ_CODEC_FORMAT',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '204976' => {
                                        'BaseType' => '141',
                                        'Header' => 'openjpeg.h',
                                        'Line' => '575',
                                        'Name' => 'opj_codec_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '213953' => {
                                        'BaseType' => '204976',
                                        'Name' => 'opj_codec_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '218279' => {
                                        'BaseType' => '58865',
                                        'Name' => 'opj_codestream_index_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '42015' => {
                                       'BaseType' => '149',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '114',
                                       'Name' => 'OPJ_CHAR',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '42070' => {
                                       'BaseType' => '70',
                                       'Header' => 'stdint.h',
                                       'Line' => '49',
                                       'Name' => 'uint16_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '42103' => {
                                       'BaseType' => '42070',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '124',
                                       'Name' => 'OPJ_UINT16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '42158' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '267',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_PROG_UNKNOWN',
                                                            'value' => '18446744073709551615'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_LRCP',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_RLCP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_RPCL',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_PCRL',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CPRL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '42208' => {
                                       'BaseType' => '42158',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '274',
                                       'Name' => 'OPJ_PROG_ORDER',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '42220' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '279',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_CLRSPC_UNKNOWN',
                                                            'value' => '18446744073709551615'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CLRSPC_UNSPECIFIED',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CLRSPC_SRGB',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CLRSPC_GRAY',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_CLRSPC_SYCC',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CLRSPC_EYCC',
                                                            'value' => '4'
                                                          },
                                                   '6' => {
                                                            'name' => 'OPJ_CLRSPC_CMYK',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '42276' => {
                                       'BaseType' => '42220',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '287',
                                       'Name' => 'OPJ_COLOR_SPACE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '42288' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '325',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'resno0',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'compno0',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '10' => {
                                                             'name' => 'progorder',
                                                             'offset' => '40',
                                                             'type' => '42768'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile',
                                                             'offset' => '48',
                                                             'type' => '9018'
                                                           },
                                                   '12' => {
                                                             'name' => 'tx0',
                                                             'offset' => '52',
                                                             'type' => '9007'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx1',
                                                             'offset' => '56',
                                                             'type' => '9007'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '60',
                                                             'type' => '9007'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty1',
                                                             'offset' => '64',
                                                             'type' => '9007'
                                                           },
                                                   '16' => {
                                                             'name' => 'layS',
                                                             'offset' => '68',
                                                             'type' => '9018'
                                                           },
                                                   '17' => {
                                                             'name' => 'resS',
                                                             'offset' => '72',
                                                             'type' => '9018'
                                                           },
                                                   '18' => {
                                                             'name' => 'compS',
                                                             'offset' => '76',
                                                             'type' => '9018'
                                                           },
                                                   '19' => {
                                                             'name' => 'prcS',
                                                             'offset' => '80',
                                                             'type' => '9018'
                                                           },
                                                   '2' => {
                                                            'name' => 'layno1',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '20' => {
                                                             'name' => 'layE',
                                                             'offset' => '84',
                                                             'type' => '9018'
                                                           },
                                                   '21' => {
                                                             'name' => 'resE',
                                                             'offset' => '88',
                                                             'type' => '9018'
                                                           },
                                                   '22' => {
                                                             'name' => 'compE',
                                                             'offset' => '92',
                                                             'type' => '9018'
                                                           },
                                                   '23' => {
                                                             'name' => 'prcE',
                                                             'offset' => '96',
                                                             'type' => '9018'
                                                           },
                                                   '24' => {
                                                             'name' => 'txS',
                                                             'offset' => '100',
                                                             'type' => '9018'
                                                           },
                                                   '25' => {
                                                             'name' => 'txE',
                                                             'offset' => '104',
                                                             'type' => '9018'
                                                           },
                                                   '26' => {
                                                             'name' => 'tyS',
                                                             'offset' => '108',
                                                             'type' => '9018'
                                                           },
                                                   '27' => {
                                                             'name' => 'tyE',
                                                             'offset' => '112',
                                                             'type' => '9018'
                                                           },
                                                   '28' => {
                                                             'name' => 'dx',
                                                             'offset' => '116',
                                                             'type' => '9018'
                                                           },
                                                   '29' => {
                                                             'name' => 'dy',
                                                             'offset' => '120',
                                                             'type' => '9018'
                                                           },
                                                   '3' => {
                                                            'name' => 'resno1',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '30' => {
                                                             'name' => 'lay_t',
                                                             'offset' => '124',
                                                             'type' => '9018'
                                                           },
                                                   '31' => {
                                                             'name' => 'res_t',
                                                             'offset' => '128',
                                                             'type' => '9018'
                                                           },
                                                   '32' => {
                                                             'name' => 'comp_t',
                                                             'offset' => '132',
                                                             'type' => '9018'
                                                           },
                                                   '33' => {
                                                             'name' => 'prc_t',
                                                             'offset' => '136',
                                                             'type' => '9018'
                                                           },
                                                   '34' => {
                                                             'name' => 'tx0_t',
                                                             'offset' => '140',
                                                             'type' => '9018'
                                                           },
                                                   '35' => {
                                                             'name' => 'ty0_t',
                                                             'offset' => '144',
                                                             'type' => '9018'
                                                           },
                                                   '4' => {
                                                            'name' => 'compno1',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'layno0',
                                                            'offset' => '20',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'precno0',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno1',
                                                            'offset' => '28',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'prg1',
                                                            'offset' => '32',
                                                            'type' => '42208'
                                                          },
                                                   '9' => {
                                                            'name' => 'prg',
                                                            'offset' => '36',
                                                            'type' => '42208'
                                                          }
                                                 },
                                       'Name' => 'struct opj_poc',
                                       'Size' => '148',
                                       'Type' => 'Struct'
                                     },
                          '42768' => {
                                       'BaseType' => '42015',
                                       'Name' => 'OPJ_CHAR[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '42784' => {
                                       'BaseType' => '42288',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '348',
                                       'Name' => 'opj_poc_t',
                                       'Size' => '148',
                                       'Type' => 'Typedef'
                                     },
                          '42796' => {
                                       'BaseType' => '42784',
                                       'Name' => 'opj_poc_t[32]',
                                       'Size' => '4736',
                                       'Type' => 'Array'
                                     },
                          '42812' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '634',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '10' => {
                                                             'name' => 'factor',
                                                             'offset' => '40',
                                                             'type' => '9018'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '48',
                                                             'type' => '18269'
                                                           },
                                                   '12' => {
                                                             'name' => 'alpha',
                                                             'offset' => '56',
                                                             'type' => '42103'
                                                           },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '9018'
                                                          },
                                                   '9' => {
                                                            'name' => 'resno_decoded',
                                                            'offset' => '36',
                                                            'type' => '9018'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comp',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '42993' => {
                                       'BaseType' => '42812',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '661',
                                       'Name' => 'opj_image_comp_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '43005' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '666',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'color_space',
                                                            'offset' => '20',
                                                            'type' => '42276'
                                                          },
                                                   '6' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '43132'
                                                          },
                                                   '7' => {
                                                            'name' => 'icc_profile_buf',
                                                            'offset' => '32',
                                                            'type' => '9040'
                                                          },
                                                   '8' => {
                                                            'name' => 'icc_profile_len',
                                                            'offset' => '40',
                                                            'type' => '9018'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '43132' => {
                                       'BaseType' => '42993',
                                       'Name' => 'opj_image_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43144' => {
                                       'BaseType' => '43005',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '685',
                                       'Name' => 'opj_image_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '43156' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '691',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '9018'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comptparm',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '43279' => {
                                       'BaseType' => '43156',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '710',
                                       'Name' => 'opj_image_cmptparm_t',
                                       'Size' => '36',
                                       'Type' => 'Typedef'
                                     },
                          '44971' => {
                                       'BaseType' => '43144',
                                       'Name' => 'opj_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '212',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '45817' => {
                                       'BaseType' => '43279',
                                       'Name' => 'opj_image_cmptparm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51050' => {
                                       'BaseType' => '188',
                                       'Header' => 'stdio.h',
                                       'Line' => '48',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '51760' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '246',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_STD_RSIZ',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K',
                                                            'value' => '3'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA4K',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_MCT',
                                                            'value' => '33024'
                                                          }
                                                 },
                                       'Name' => 'enum RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '51799' => {
                                       'BaseType' => '51760',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '251',
                                       'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '51810' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CINEMA2K_24',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CINEMA2K_48',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CINEMA4K_24',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '51848' => {
                                       'BaseType' => '51810',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '262',
                                       'Name' => 'OPJ_CINEMA_MODE',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '52532' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '353',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tile_size_on',
                                                            'offset' => '0',
                                                            'type' => '694'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_tx0',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '10' => {
                                                             'name' => 'csty',
                                                             'offset' => '48',
                                                             'type' => '98'
                                                           },
                                                   '11' => {
                                                             'name' => 'prog_order',
                                                             'offset' => '52',
                                                             'type' => '42208'
                                                           },
                                                   '12' => {
                                                             'name' => 'POC',
                                                             'offset' => '56',
                                                             'type' => '42796'
                                                           },
                                                   '13' => {
                                                             'name' => 'numpocs',
                                                             'offset' => '4792',
                                                             'type' => '9018'
                                                           },
                                                   '14' => {
                                                             'name' => 'tcp_numlayers',
                                                             'offset' => '4796',
                                                             'type' => '98'
                                                           },
                                                   '15' => {
                                                             'name' => 'tcp_rates',
                                                             'offset' => '4800',
                                                             'type' => '53396'
                                                           },
                                                   '16' => {
                                                             'name' => 'tcp_distoratio',
                                                             'offset' => '5200',
                                                             'type' => '53396'
                                                           },
                                                   '17' => {
                                                             'name' => 'numresolution',
                                                             'offset' => '5600',
                                                             'type' => '98'
                                                           },
                                                   '18' => {
                                                             'name' => 'cblockw_init',
                                                             'offset' => '5604',
                                                             'type' => '98'
                                                           },
                                                   '19' => {
                                                             'name' => 'cblockh_init',
                                                             'offset' => '5608',
                                                             'type' => '98'
                                                           },
                                                   '2' => {
                                                            'name' => 'cp_ty0',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '20' => {
                                                             'name' => 'mode',
                                                             'offset' => '5612',
                                                             'type' => '98'
                                                           },
                                                   '21' => {
                                                             'name' => 'irreversible',
                                                             'offset' => '5616',
                                                             'type' => '98'
                                                           },
                                                   '22' => {
                                                             'name' => 'roi_compno',
                                                             'offset' => '5620',
                                                             'type' => '98'
                                                           },
                                                   '23' => {
                                                             'name' => 'roi_shift',
                                                             'offset' => '5624',
                                                             'type' => '98'
                                                           },
                                                   '24' => {
                                                             'name' => 'res_spec',
                                                             'offset' => '5628',
                                                             'type' => '98'
                                                           },
                                                   '25' => {
                                                             'name' => 'prcw_init',
                                                             'offset' => '5632',
                                                             'type' => '53412'
                                                           },
                                                   '26' => {
                                                             'name' => 'prch_init',
                                                             'offset' => '5764',
                                                             'type' => '53412'
                                                           },
                                                   '27' => {
                                                             'name' => 'infile',
                                                             'offset' => '5896',
                                                             'type' => '53428'
                                                           },
                                                   '28' => {
                                                             'name' => 'outfile',
                                                             'offset' => '9992',
                                                             'type' => '53428'
                                                           },
                                                   '29' => {
                                                             'name' => 'index_on',
                                                             'offset' => '14088',
                                                             'type' => '98'
                                                           },
                                                   '3' => {
                                                            'name' => 'cp_tdx',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '30' => {
                                                             'name' => 'index',
                                                             'offset' => '14092',
                                                             'type' => '53428'
                                                           },
                                                   '31' => {
                                                             'name' => 'image_offset_x0',
                                                             'offset' => '18188',
                                                             'type' => '98'
                                                           },
                                                   '32' => {
                                                             'name' => 'image_offset_y0',
                                                             'offset' => '18192',
                                                             'type' => '98'
                                                           },
                                                   '33' => {
                                                             'name' => 'subsampling_dx',
                                                             'offset' => '18196',
                                                             'type' => '98'
                                                           },
                                                   '34' => {
                                                             'name' => 'subsampling_dy',
                                                             'offset' => '18200',
                                                             'type' => '98'
                                                           },
                                                   '35' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '18204',
                                                             'type' => '98'
                                                           },
                                                   '36' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '18208',
                                                             'type' => '98'
                                                           },
                                                   '37' => {
                                                             'name' => 'jpwl_epc_on',
                                                             'offset' => '18212',
                                                             'type' => '694'
                                                           },
                                                   '38' => {
                                                             'name' => 'jpwl_hprot_MH',
                                                             'offset' => '18216',
                                                             'type' => '98'
                                                           },
                                                   '39' => {
                                                             'name' => 'jpwl_hprot_TPH_tileno',
                                                             'offset' => '18220',
                                                             'type' => '53445'
                                                           },
                                                   '4' => {
                                                            'name' => 'cp_tdy',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '40' => {
                                                             'name' => 'jpwl_hprot_TPH',
                                                             'offset' => '18284',
                                                             'type' => '53445'
                                                           },
                                                   '41' => {
                                                             'name' => 'jpwl_pprot_tileno',
                                                             'offset' => '18348',
                                                             'type' => '53445'
                                                           },
                                                   '42' => {
                                                             'name' => 'jpwl_pprot_packno',
                                                             'offset' => '18412',
                                                             'type' => '53445'
                                                           },
                                                   '43' => {
                                                             'name' => 'jpwl_pprot',
                                                             'offset' => '18476',
                                                             'type' => '53445'
                                                           },
                                                   '44' => {
                                                             'name' => 'jpwl_sens_size',
                                                             'offset' => '18540',
                                                             'type' => '98'
                                                           },
                                                   '45' => {
                                                             'name' => 'jpwl_sens_addr',
                                                             'offset' => '18544',
                                                             'type' => '98'
                                                           },
                                                   '46' => {
                                                             'name' => 'jpwl_sens_range',
                                                             'offset' => '18548',
                                                             'type' => '98'
                                                           },
                                                   '47' => {
                                                             'name' => 'jpwl_sens_MH',
                                                             'offset' => '18552',
                                                             'type' => '98'
                                                           },
                                                   '48' => {
                                                             'name' => 'jpwl_sens_TPH_tileno',
                                                             'offset' => '18556',
                                                             'type' => '53445'
                                                           },
                                                   '49' => {
                                                             'name' => 'jpwl_sens_TPH',
                                                             'offset' => '18620',
                                                             'type' => '53445'
                                                           },
                                                   '5' => {
                                                            'name' => 'cp_disto_alloc',
                                                            'offset' => '20',
                                                            'type' => '98'
                                                          },
                                                   '50' => {
                                                             'name' => 'cp_cinema',
                                                             'offset' => '18684',
                                                             'type' => '51848'
                                                           },
                                                   '51' => {
                                                             'name' => 'max_comp_size',
                                                             'offset' => '18688',
                                                             'type' => '98'
                                                           },
                                                   '52' => {
                                                             'name' => 'cp_rsiz',
                                                             'offset' => '18692',
                                                             'type' => '51799'
                                                           },
                                                   '53' => {
                                                             'name' => 'tp_on',
                                                             'offset' => '18696',
                                                             'type' => '149'
                                                           },
                                                   '54' => {
                                                             'name' => 'tp_flag',
                                                             'offset' => '18697',
                                                             'type' => '149'
                                                           },
                                                   '55' => {
                                                             'name' => 'tcp_mct',
                                                             'offset' => '18698',
                                                             'type' => '149'
                                                           },
                                                   '56' => {
                                                             'name' => 'jpip_on',
                                                             'offset' => '18700',
                                                             'type' => '694'
                                                           },
                                                   '57' => {
                                                             'name' => 'mct_data',
                                                             'offset' => '18704',
                                                             'type' => '141'
                                                           },
                                                   '58' => {
                                                             'name' => 'max_cs_size',
                                                             'offset' => '18712',
                                                             'type' => '98'
                                                           },
                                                   '59' => {
                                                             'name' => 'rsiz',
                                                             'offset' => '18716',
                                                             'type' => '42103'
                                                           },
                                                   '6' => {
                                                            'name' => 'cp_fixed_alloc',
                                                            'offset' => '24',
                                                            'type' => '98'
                                                          },
                                                   '7' => {
                                                            'name' => 'cp_fixed_quality',
                                                            'offset' => '28',
                                                            'type' => '98'
                                                          },
                                                   '8' => {
                                                            'name' => 'cp_matrice',
                                                            'offset' => '32',
                                                            'type' => '53374'
                                                          },
                                                   '9' => {
                                                            'name' => 'cp_comment',
                                                            'offset' => '40',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct opj_cparameters',
                                       'Size' => '18720',
                                       'Type' => 'Struct'
                                     },
                          '53374' => {
                                       'BaseType' => '98',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53396' => {
                                       'BaseType' => '163',
                                       'Name' => 'float[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '53412' => {
                                       'BaseType' => '98',
                                       'Name' => 'int[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '53428' => {
                                       'BaseType' => '149',
                                       'Name' => 'char[4096]',
                                       'Size' => '4096',
                                       'Type' => 'Array'
                                     },
                          '53445' => {
                                       'BaseType' => '98',
                                       'Name' => 'int[16]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '53461' => {
                                       'BaseType' => '52532',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '501',
                                       'Name' => 'opj_cparameters_t',
                                       'Size' => '18720',
                                       'Type' => 'Typedef'
                                     },
                          '53473' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '509',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cp_reduce',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'cp_layer',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '10' => {
                                                             'name' => 'm_verbose',
                                                             'offset' => '8224',
                                                             'type' => '694'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile_index',
                                                             'offset' => '8228',
                                                             'type' => '9018'
                                                           },
                                                   '12' => {
                                                             'name' => 'nb_tile_to_decode',
                                                             'offset' => '8232',
                                                             'type' => '9018'
                                                           },
                                                   '13' => {
                                                             'name' => 'jpwl_correct',
                                                             'offset' => '8236',
                                                             'type' => '694'
                                                           },
                                                   '14' => {
                                                             'name' => 'jpwl_exp_comps',
                                                             'offset' => '8240',
                                                             'type' => '98'
                                                           },
                                                   '15' => {
                                                             'name' => 'jpwl_max_tiles',
                                                             'offset' => '8244',
                                                             'type' => '98'
                                                           },
                                                   '16' => {
                                                             'name' => 'flags',
                                                             'offset' => '8248',
                                                             'type' => '77'
                                                           },
                                                   '2' => {
                                                            'name' => 'infile',
                                                            'offset' => '8',
                                                            'type' => '53428'
                                                          },
                                                   '3' => {
                                                            'name' => 'outfile',
                                                            'offset' => '4104',
                                                            'type' => '53428'
                                                          },
                                                   '4' => {
                                                            'name' => 'decod_format',
                                                            'offset' => '8200',
                                                            'type' => '98'
                                                          },
                                                   '5' => {
                                                            'name' => 'cod_format',
                                                            'offset' => '8204',
                                                            'type' => '98'
                                                          },
                                                   '6' => {
                                                            'name' => 'DA_x0',
                                                            'offset' => '8208',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'DA_x1',
                                                            'offset' => '8212',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'DA_y0',
                                                            'offset' => '8216',
                                                            'type' => '9018'
                                                          },
                                                   '9' => {
                                                            'name' => 'DA_y1',
                                                            'offset' => '8220',
                                                            'type' => '9018'
                                                          }
                                                 },
                                       'Name' => 'struct opj_dparameters',
                                       'Size' => '8252',
                                       'Type' => 'Struct'
                                     },
                          '53723' => {
                                       'BaseType' => '53473',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '569',
                                       'Name' => 'opj_dparameters_t',
                                       'Size' => '8252',
                                       'Type' => 'Typedef'
                                     },
                          '54239' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '723',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '11195'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_ph_pos',
                                                            'offset' => '8',
                                                            'type' => '11195'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '11195'
                                                          },
                                                   '3' => {
                                                            'name' => 'disto',
                                                            'offset' => '24',
                                                            'type' => '170'
                                                          }
                                                 },
                                       'Name' => 'struct opj_packet_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '54305' => {
                                       'BaseType' => '54239',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '732',
                                       'Name' => 'opj_packet_info_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '54317' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '739',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '70'
                                                          },
                                                   '1' => {
                                                            'name' => 'pos',
                                                            'offset' => '8',
                                                            'type' => '11195'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct opj_marker_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54370' => {
                                       'BaseType' => '54317',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '746',
                                       'Name' => 'opj_marker_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54722' => {
                                       'BaseType' => '54305',
                                       'Name' => 'opj_packet_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54728' => {
                                       'BaseType' => '54370',
                                       'Name' => 'opj_marker_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55068' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '863',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'compno',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '10' => {
                                                             'name' => 'numgbits',
                                                             'offset' => '808',
                                                             'type' => '9018'
                                                           },
                                                   '11' => {
                                                             'name' => 'roishift',
                                                             'offset' => '812',
                                                             'type' => '9007'
                                                           },
                                                   '12' => {
                                                             'name' => 'prcw',
                                                             'offset' => '816',
                                                             'type' => '18281'
                                                           },
                                                   '13' => {
                                                             'name' => 'prch',
                                                             'offset' => '948',
                                                             'type' => '18281'
                                                           },
                                                   '2' => {
                                                            'name' => 'numresolutions',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'cblkw',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'cblkh',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'cblksty',
                                                            'offset' => '20',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'qmfbid',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'qntsty',
                                                            'offset' => '28',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'stepsizes_mant',
                                                            'offset' => '32',
                                                            'type' => '55270'
                                                          },
                                                   '9' => {
                                                            'name' => 'stepsizes_expn',
                                                            'offset' => '420',
                                                            'type' => '55270'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tccp_info',
                                       'Size' => '1080',
                                       'Type' => 'Struct'
                                     },
                          '55270' => {
                                       'BaseType' => '9018',
                                       'Name' => 'OPJ_UINT32[97]',
                                       'Size' => '388',
                                       'Type' => 'Array'
                                     },
                          '55302' => {
                                       'BaseType' => '55068',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '893',
                                       'Name' => 'opj_tccp_info_t',
                                       'Size' => '1080',
                                       'Type' => 'Typedef'
                                     },
                          '55314' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '898',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'csty',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '2' => {
                                                            'name' => 'prg',
                                                            'offset' => '8',
                                                            'type' => '42208'
                                                          },
                                                   '3' => {
                                                            'name' => 'numlayers',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'mct',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'tccp_info',
                                                            'offset' => '24',
                                                            'type' => '55406'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_v2_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '55406' => {
                                       'BaseType' => '55302',
                                       'Name' => 'opj_tccp_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55412' => {
                                       'BaseType' => '55314',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '914',
                                       'Name' => 'opj_tile_info_v2_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '55424' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '919',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tx0',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'ty0',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '2' => {
                                                            'name' => 'tdx',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'tdy',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'tw',
                                                            'offset' => '16',
                                                            'type' => '9018'
                                                          },
                                                   '5' => {
                                                            'name' => 'th',
                                                            'offset' => '20',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'nbcomps',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'm_default_tile_info',
                                                            'offset' => '32',
                                                            'type' => '55412'
                                                          },
                                                   '8' => {
                                                            'name' => 'tile_info',
                                                            'offset' => '64',
                                                            'type' => '55553'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_info_v2',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '55553' => {
                                       'BaseType' => '55412',
                                       'Name' => 'opj_tile_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55559' => {
                                       'BaseType' => '55424',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '943',
                                       'Name' => 'opj_codestream_info_v2_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '55571' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '949',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_pos',
                                                            'offset' => '0',
                                                            'type' => '11195'
                                                          },
                                                   '1' => {
                                                            'name' => 'end_header',
                                                            'offset' => '8',
                                                            'type' => '11195'
                                                          },
                                                   '2' => {
                                                            'name' => 'end_pos',
                                                            'offset' => '16',
                                                            'type' => '11195'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tp_index',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '55624' => {
                                       'BaseType' => '55571',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '957',
                                       'Name' => 'opj_tp_index_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '55636' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '962',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tileno',
                                                            'offset' => '0',
                                                            'type' => '9018'
                                                          },
                                                   '1' => {
                                                            'name' => 'nb_tps',
                                                            'offset' => '4',
                                                            'type' => '9018'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_nb_tps',
                                                            'offset' => '8',
                                                            'type' => '9018'
                                                          },
                                                   '3' => {
                                                            'name' => 'current_tpsno',
                                                            'offset' => '12',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'tp_index',
                                                            'offset' => '16',
                                                            'type' => '55780'
                                                          },
                                                   '5' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '54728'
                                                          },
                                                   '7' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '9018'
                                                          },
                                                   '8' => {
                                                            'name' => 'nb_packet',
                                                            'offset' => '44',
                                                            'type' => '9018'
                                                          },
                                                   '9' => {
                                                            'name' => 'packet_index',
                                                            'offset' => '48',
                                                            'type' => '54722'
                                                          }
                                                 },
                                       'Name' => 'struct opj_tile_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '55780' => {
                                       'BaseType' => '55624',
                                       'Name' => 'opj_tp_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55786' => {
                                       'BaseType' => '55636',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '989',
                                       'Name' => 'opj_tile_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '55798' => {
                                       'Header' => 'openjpeg.h',
                                       'Line' => '994',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'main_head_start',
                                                            'offset' => '0',
                                                            'type' => '11195'
                                                          },
                                                   '1' => {
                                                            'name' => 'main_head_end',
                                                            'offset' => '8',
                                                            'type' => '11195'
                                                          },
                                                   '2' => {
                                                            'name' => 'codestream_size',
                                                            'offset' => '16',
                                                            'type' => '11184'
                                                          },
                                                   '3' => {
                                                            'name' => 'marknum',
                                                            'offset' => '24',
                                                            'type' => '9018'
                                                          },
                                                   '4' => {
                                                            'name' => 'marker',
                                                            'offset' => '32',
                                                            'type' => '54728'
                                                          },
                                                   '5' => {
                                                            'name' => 'maxmarknum',
                                                            'offset' => '40',
                                                            'type' => '9018'
                                                          },
                                                   '6' => {
                                                            'name' => 'nb_of_tiles',
                                                            'offset' => '44',
                                                            'type' => '9018'
                                                          },
                                                   '7' => {
                                                            'name' => 'tile_index',
                                                            'offset' => '48',
                                                            'type' => '55916'
                                                          }
                                                 },
                                       'Name' => 'struct opj_codestream_index',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '55916' => {
                                       'BaseType' => '55786',
                                       'Name' => 'opj_tile_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55922' => {
                                       'BaseType' => '55798',
                                       'Header' => 'openjpeg.h',
                                       'Line' => '1017',
                                       'Name' => 'opj_codestream_index_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '588' => {
                                     'Header' => 'libio.h',
                                     'Line' => '154',
                                     'Name' => '_IO_lock_t',
                                     'Type' => 'Typedef'
                                   },
                          '58865' => {
                                       'BaseType' => '55922',
                                       'Name' => 'opj_codestream_index_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '595' => {
                                     'Header' => 'libio.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_next',
                                                          'offset' => '0',
                                                          'type' => '644'
                                                        },
                                                 '1' => {
                                                          'name' => '_sbuf',
                                                          'offset' => '8',
                                                          'type' => '650'
                                                        },
                                                 '2' => {
                                                          'name' => '_pos',
                                                          'offset' => '16',
                                                          'type' => '98'
                                                        }
                                               },
                                     'Name' => 'struct _IO_marker',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '60839' => {
                                       'BaseType' => '44971',
                                       'Name' => 'opj_image_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60845' => {
                                       'BaseType' => '694',
                                       'Name' => 'OPJ_BOOL*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60851' => {
                                       'BaseType' => '53723',
                                       'Name' => 'opj_dparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60863' => {
                                       'BaseType' => '53461',
                                       'Name' => 'opj_cparameters_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60869' => {
                                       'BaseType' => '51050',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60875' => {
                                       'BaseType' => '55559',
                                       'Name' => 'opj_codestream_info_v2_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '644' => {
                                     'BaseType' => '595',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '650' => {
                                     'BaseType' => '188',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '656' => {
                                     'BaseType' => '149',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '672' => {
                                     'BaseType' => '588',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '678' => {
                                     'BaseType' => '149',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '694' => {
                                     'BaseType' => '98',
                                     'Header' => 'openjpeg.h',
                                     'Line' => '110',
                                     'Name' => 'OPJ_BOOL',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '705' => {
                                     'Name' => 'void(*)(void*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '141'
                                                         }
                                                },
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '77' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '84' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8974' => {
                                      'BaseType' => '63',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '117',
                                      'Name' => 'OPJ_BYTE',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '8985' => {
                                      'BaseType' => '98',
                                      'Header' => 'stdint.h',
                                      'Line' => '38',
                                      'Name' => 'int32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8996' => {
                                      'BaseType' => '77',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9007' => {
                                      'BaseType' => '8985',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '125',
                                      'Name' => 'OPJ_INT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9018' => {
                                      'BaseType' => '8996',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '126',
                                      'Name' => 'OPJ_UINT32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9029' => {
                                      'BaseType' => '45',
                                      'Header' => 'openjpeg.h',
                                      'Line' => '133',
                                      'Name' => 'OPJ_SIZE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9040' => {
                                      'BaseType' => '8974',
                                      'Name' => 'OPJ_BYTE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '98' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjp2.so.2.2.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '_Jv_RegisterClasses' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'ceilf@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'floor@GLIBC_2.2.5' => 0,
                                                             'floorf@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fseeko@GLIBC_2.2.5' => 0,
                                                             'ftello@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'lrintf@GLIBC_2.2.5' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'posix_memalign@GLIBC_2.2.5' => 0,
                                                             'pow@GLIBC_2.2.5' => 0,
                                                             'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                             'pthread_attr_setdetachstate@GLIBC_2.2.5' => 0,
                                                             'pthread_cond_destroy@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_init@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_signal@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_wait@GLIBC_2.3.2' => 0,
                                                             'pthread_create@GLIBC_2.2.5' => 0,
                                                             'pthread_join@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'realloc@GLIBC_2.2.5' => 0,
                                                             'sqrt@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strcpy@GLIBC_2.2.5' => 0,
                                                             'strtol@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
