$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.15',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '9.4.0',
          'Headers' => {
                         'openjpeg.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libopenjp2.so.2.5.3',
          'LibraryVersion' => '2.5.3',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '112670' => {
                                          'Header' => 'openjpeg.h',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'numcmpts',
                                                                'type' => '9383'
                                                              },
                                                       '1' => {
                                                                'name' => 'cmptparms',
                                                                'type' => '112932'
                                                              },
                                                       '2' => {

                                                    'opj_get_decoded_tile' => 1,
                                                    'opj_get_num_cpus' => 1,
                                                    'opj_has_thread_support' => 1,
                                                    'opj_image_create' => 1,
                                                    'opj_image_data_alloc' => 1,
                                                    'opj_image_data_free' => 1,
                                                    'opj_image_destroy' => 1,
                                                    'opj_image_tile_create' => 1,
                                                    'opj_read_header' => 1,
                                                    'opj_read_tile_header' => 1,
                                                    'opj_set_MCT' => 1,
                                                    'opj_set_decode_area' => 1,
                                                    'opj_set_decoded_components' => 1,
                                                    'opj_set_decoded_resolution_factor' => 1,
                                                    'opj_set_default_decoder_parameters' => 1,
                                                    'opj_set_default_encoder_parameters' => 1,
                                                    'opj_set_error_handler' => 1,
                                                    'opj_set_info_handler' => 1,
                                                    'opj_set_warning_handler' => 1,
                                                    'opj_setup_decoder' => 1,
                                                    'opj_setup_encoder' => 1,
                                                    'opj_start_compress' => 1,
                                                    'opj_stream_create' => 1,
                                                    'opj_stream_create_default_file_stream' => 1,
                                                    'opj_stream_create_file_stream' => 1,
                                                    'opj_stream_default_create' => 1,
                                                    'opj_stream_destroy' => 1,
                                                    'opj_stream_set_read_function' => 1,
                                                    'opj_stream_set_seek_function' => 1,
                                                    'opj_stream_set_skip_function' => 1,
                                                    'opj_stream_set_user_data' => 1,
                                                    'opj_stream_set_user_data_length' => 1,
                                                    'opj_stream_set_write_function' => 1,
                                                    'opj_version' => 1,
                                                    'opj_write_tile' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '106' => {
                                     'BaseType' => '99',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Source' => undef,
                                     'SourceLine' => '152',
                                     'Type' => 'Typedef'
                                   },
                          '10949' => {
                                       'BaseType' => '99',
                                       'Name' => '__int64_t',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '44',
                                       'Type' => 'Typedef'
                                     },
                          '10961' => {
                                       'BaseType' => '66',
                                       'Name' => '__uint64_t',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '45',
                                       'Type' => 'Typedef'
                                     },
                          '110670' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dx',
                                                             'offset' => '0',
                                                             'type' => '9383'
                                                           },
                                                    '1' => {
                                                             'name' => 'dy',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '2' => {
                                                             'name' => 'w',
                                                             'offset' => '8',
                                                             'type' => '9383'
                                                           },
                                                    '3' => {
                                                             'name' => 'h',
                                                             'offset' => '12',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'x0',
                                                             'offset' => '16',
                                                             'type' => '9383'
                                                           },
                                                    '5' => {
                                                             'name' => 'y0',
                                                             'offset' => '20',
                                                             'type' => '9383'
                                                           },
                                                    '6' => {
                                                             'name' => 'prec',
                                                             'offset' => '24',
                                                             'type' => '9383'
                                                           },
                                                    '7' => {
                                                             'name' => 'bpp',
                                                             'offset' => '28',
                                                             'type' => '9383'
                                                           },
                                                    '8' => {
                                                             'name' => 'sgnd',
                                                             'offset' => '32',
                                                             'type' => '9383'
                                                           }
                                                  },
                                        'Name' => 'struct opj_image_comptparm',
                                        'Size' => '36',
                                        'Source' => undef,
                                        'SourceLine' => '736',
                                        'Type' => 'Struct'
                                      },
                          '110803' => {
                                        'BaseType' => '110670',
                                        'Name' => 'opj_image_cmptparm_t',
                                        'Size' => '36',
                                        'Source' => undef,
                                        'SourceLine' => '755',
                                        'Type' => 'Typedef'
                                      },
                          '112932' => {
                                        'BaseType' => '110803',
                                        'Name' => 'opj_image_cmptparm_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11636' => {
                                       'BaseType' => '10949',
                                       'Name' => 'int64_t',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '27',
                                       'Type' => 'Typedef'
                                     },
                          '11660' => {
                                       'BaseType' => '10961',
                                       'Name' => 'uint64_t',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '27',
                                       'Type' => 'Typedef'
                                     },
                          '11684' => {
                                       'BaseType' => '2340',
                                       'Name' => 'OPJ_FLOAT32',
                                       'Size' => '4',
                                       'Source' => undef,
                                       'SourceLine' => '121',
                                       'Type' => 'Typedef'
                                     },
                          '11737' => {
                                       'BaseType' => '11660',
                                       'Name' => 'OPJ_UINT64',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '134',
                                       'Type' => 'Typedef'
                                     },
                          '11749' => {
                                       'BaseType' => '11636',
                                       'Name' => 'OPJ_OFF_T',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '136',
                                       'Type' => 'Typedef'
                                     },
                          '11773' => {
                                       'BaseType' => '11786',
                                       'Name' => 'opj_msg_callback',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '351',
                                       'Type' => 'Typedef'
                                     },
                          '11786' => {
                                       'Name' => 'void(*)(char const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '162'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '118' => {
                                     'BaseType' => '99',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Source' => undef,
                                     'SourceLine' => '153',
                                     'Type' => 'Typedef'
                                   },
                          '11808' => {
                                       'BaseType' => '11821',
                                       'Name' => 'opj_stream_read_fn',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '639',
                                       'Type' => 'Typedef'
                                     },
                          '11821' => {
                                       'Name' => 'OPJ_SIZE_T(*)(void*, OPJ_SIZE_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '130'
                                                           },
                                                    '1' => {
                                                             'type' => '9395'
                                                           },
                                                    '2' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '9395',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11852' => {
                                       'BaseType' => '11821',
                                       'Name' => 'opj_stream_write_fn',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '645',
                                       'Type' => 'Typedef'
                                     },
                          '11865' => {
                                       'BaseType' => '11878',
                                       'Name' => 'opj_stream_skip_fn',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '651',
                                       'Type' => 'Typedef'
                                     },
                          '11878' => {
                                       'Name' => 'OPJ_OFF_T(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11749'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '11749',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11904' => {
                                       'BaseType' => '11917',
                                       'Name' => 'opj_stream_seek_fn',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '657',
                                       'Type' => 'Typedef'
                                     },
                          '11917' => {
                                       'Name' => 'OPJ_BOOL(*)(OPJ_OFF_T, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11749'
                                                           },
                                                    '1' => {
                                                             'type' => '130'
                                                           }
                                                  },
                                       'Return' => '2937',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11943' => {
                                       'BaseType' => '962',
                                       'Name' => 'opj_stream_free_user_data_fn',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '663',
                                       'Type' => 'Typedef'
                                     },
                          '11973' => {
                                       'BaseType' => '130',
                                       'Name' => 'opj_stream_t',
                                       'Size' => '8',
                                       'Source' => undef,
                                       'SourceLine' => '668',
                                       'Type' => 'Typedef'
                                     },
                          '120319' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_STD_RSIZ',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CINEMA2K',
                                                             'value' => '3'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CINEMA4K',
                                                             'value' => '4'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_MCT',
                                                             'value' => '33024'
                                                           }
                                                  },
                                        'Name' => 'enum RSIZ_CAPABILITIES',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '284',
                                        'Type' => 'Enum'
                                      },
                          '120364' => {
                                        'BaseType' => '120319',
                                        'Name' => 'OPJ_RSIZ_CAPABILITIES',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '289',
                                        'Type' => 'Typedef'
                                      },
                          '120377' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_OFF',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CINEMA2K_24',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CINEMA2K_48',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CINEMA4K_24',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum CINEMA_MODE',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '295',
                                        'Type' => 'Enum'
                                      },
                          '120421' => {
                                        'BaseType' => '120377',
                                        'Name' => 'OPJ_CINEMA_MODE',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '300',
                                        'Type' => 'Typedef'
                                      },
                          '121164' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tile_size_on',
                                                             'offset' => '0',
                                                             'type' => '2937'
                                                           },
                                                    '1' => {
                                                             'name' => 'cp_tx0',
                                                             'offset' => '4',
                                                             'type' => '87'
                                                           },
                                                    '10' => {
                                                              'name' => 'csty',
                                                              'offset' => '48',
                                                              'type' => '87'
                                                            },
                                                    '11' => {
                                                              'name' => 'prog_order',
                                                              'offset' => '52',
                                                              'type' => '19990'
                                                            },
                                                    '12' => {
                                                              'name' => 'POC',
                                                              'offset' => '56',
                                                              'type' => '20624'
                                                            },
                                                    '13' => {
                                                              'name' => 'numpocs',
                                                              'offset' => '4792',
                                                              'type' => '9383'
                                                            },
                                                    '14' => {
                                                              'name' => 'tcp_numlayers',
                                                              'offset' => '4796',
                                                              'type' => '87'
                                                            },
                                                    '15' => {
                                                              'name' => 'tcp_rates',
                                                              'offset' => '4800',
                                                              'type' => '122089'
                                                            },
                                                    '16' => {
                                                              'name' => 'tcp_distoratio',
                                                              'offset' => '5200',
                                                              'type' => '122089'
                                                            },
                                                    '17' => {
                                                              'name' => 'numresolution',
                                                              'offset' => '5600',
                                                              'type' => '87'
                                                            },
                                                    '18' => {
                                                              'name' => 'cblockw_init',
                                                              'offset' => '5604',
                                                              'type' => '87'
                                                            },
                                                    '19' => {
                                                              'name' => 'cblockh_init',
                                                              'offset' => '5608',
                                                              'type' => '87'
                                                            },
                                                    '2' => {
                                                             'name' => 'cp_ty0',
                                                             'offset' => '8',
                                                             'type' => '87'
                                                           },
                                                    '20' => {
                                                              'name' => 'mode',
                                                              'offset' => '5612',
                                                              'type' => '87'
                                                            },
                                                    '21' => {
                                                              'name' => 'irreversible',
                                                              'offset' => '5616',
                                                              'type' => '87'
                                                            },
                                                    '22' => {
                                                              'name' => 'roi_compno',
                                                              'offset' => '5620',
                                                              'type' => '87'
                                                            },
                                                    '23' => {
                                                              'name' => 'roi_shift',
                                                              'offset' => '5624',
                                                              'type' => '87'
                                                            },
                                                    '24' => {
                                                              'name' => 'res_spec',
                                                              'offset' => '5628',
                                                              'type' => '87'
                                                            },
                                                    '25' => {
                                                              'name' => 'prcw_init',
                                                              'offset' => '5632',
                                                              'type' => '122105'
                                                            },
                                                    '26' => {
                                                              'name' => 'prch_init',
                                                              'offset' => '5764',
                                                              'type' => '122105'
                                                            },
                                                    '27' => {
                                                              'name' => 'infile',
                                                              'offset' => '5896',
                                                              'type' => '122121'
                                                            },
                                                    '28' => {
                                                              'name' => 'outfile',
                                                              'offset' => '9992',
                                                              'type' => '122121'
                                                            },
                                                    '29' => {
                                                              'name' => 'index_on',
                                                              'offset' => '14088',
                                                              'type' => '87'
                                                            },
                                                    '3' => {
                                                             'name' => 'cp_tdx',
                                                             'offset' => '12',
                                                             'type' => '87'
                                                           },
                                                    '30' => {
                                                              'name' => 'index',
                                                              'offset' => '14092',
                                                              'type' => '122121'
                                                            },
                                                    '31' => {
                                                              'name' => 'image_offset_x0',
                                                              'offset' => '18188',
                                                              'type' => '87'
                                                            },
                                                    '32' => {
                                                              'name' => 'image_offset_y0',
                                                              'offset' => '18192',
                                                              'type' => '87'
                                                            },
                                                    '33' => {
                                                              'name' => 'subsampling_dx',
                                                              'offset' => '18196',
                                                              'type' => '87'
                                                            },
                                                    '34' => {
                                                              'name' => 'subsampling_dy',
                                                              'offset' => '18200',
                                                              'type' => '87'
                                                            },
                                                    '35' => {
                                                              'name' => 'decod_format',
                                                              'offset' => '18204',
                                                              'type' => '87'
                                                            },
                                                    '36' => {
                                                              'name' => 'cod_format',
                                                              'offset' => '18208',
                                                              'type' => '87'
                                                            },
                                                    '37' => {
                                                              'name' => 'jpwl_epc_on',
                                                              'offset' => '18212',
                                                              'type' => '2937'
                                                            },
                                                    '38' => {
                                                              'name' => 'jpwl_hprot_MH',
                                                              'offset' => '18216',
                                                              'type' => '87'
                                                            },
                                                    '39' => {
                                                              'name' => 'jpwl_hprot_TPH_tileno',
                                                              'offset' => '18220',
                                                              'type' => '122138'
                                                            },
                                                    '4' => {
                                                             'name' => 'cp_tdy',
                                                             'offset' => '16',
                                                             'type' => '87'
                                                           },
                                                    '40' => {
                                                              'name' => 'jpwl_hprot_TPH',
                                                              'offset' => '18284',
                                                              'type' => '122138'
                                                            },
                                                    '41' => {
                                                              'name' => 'jpwl_pprot_tileno',
                                                              'offset' => '18348',
                                                              'type' => '122138'
                                                            },
                                                    '42' => {
                                                              'name' => 'jpwl_pprot_packno',
                                                              'offset' => '18412',
                                                              'type' => '122138'
                                                            },
                                                    '43' => {
                                                              'name' => 'jpwl_pprot',
                                                              'offset' => '18476',
                                                              'type' => '122138'
                                                            },
                                                    '44' => {
                                                              'name' => 'jpwl_sens_size',
                                                              'offset' => '18540',
                                                              'type' => '87'
                                                            },
                                                    '45' => {
                                                              'name' => 'jpwl_sens_addr',
                                                              'offset' => '18544',
                                                              'type' => '87'
                                                            },
                                                    '46' => {
                                                              'name' => 'jpwl_sens_range',
                                                              'offset' => '18548',
                                                              'type' => '87'
                                                            },
                                                    '47' => {
                                                              'name' => 'jpwl_sens_MH',
                                                              'offset' => '18552',
                                                              'type' => '87'
                                                            },
                                                    '48' => {
                                                              'name' => 'jpwl_sens_TPH_tileno',
                                                              'offset' => '18556',
                                                              'type' => '122138'
                                                            },
                                                    '49' => {
                                                              'name' => 'jpwl_sens_TPH',
                                                              'offset' => '18620',
                                                              'type' => '122138'
                                                            },
                                                    '5' => {
                                                             'name' => 'cp_disto_alloc',
                                                             'offset' => '20',
                                                             'type' => '87'
                                                           },
                                                    '50' => {
                                                              'name' => 'cp_cinema',
                                                              'offset' => '18684',
                                                              'type' => '120421'
                                                            },
                                                    '51' => {
                                                              'name' => 'max_comp_size',
                                                              'offset' => '18688',
                                                              'type' => '87'
                                                            },
                                                    '52' => {
                                                              'name' => 'cp_rsiz',
                                                              'offset' => '18692',
                                                              'type' => '120364'
                                                            },
                                                    '53' => {
                                                              'name' => 'tp_on',
                                                              'offset' => '18696',
                                                              'type' => '138'
                                                            },
                                                    '54' => {
                                                              'name' => 'tp_flag',
                                                              'offset' => '18697',
                                                              'type' => '138'
                                                            },
                                                    '55' => {
                                                              'name' => 'tcp_mct',
                                                              'offset' => '18698',
                                                              'type' => '138'
                                                            },
                                                    '56' => {
                                                              'name' => 'jpip_on',
                                                              'offset' => '18700',
                                                              'type' => '2937'
                                                            },
                                                    '57' => {
                                                              'name' => 'mct_data',
                                                              'offset' => '18704',
                                                              'type' => '130'
                                                            },
                                                    '58' => {
                                                              'name' => 'max_cs_size',
                                                              'offset' => '18712',
                                                              'type' => '87'
                                                            },
                                                    '59' => {
                                                              'name' => 'rsiz',
                                                              'offset' => '18716',
                                                              'type' => '19859'
                                                            },
                                                    '6' => {
                                                             'name' => 'cp_fixed_alloc',
                                                             'offset' => '24',
                                                             'type' => '87'
                                                           },
                                                    '7' => {
                                                             'name' => 'cp_fixed_quality',
                                                             'offset' => '28',
                                                             'type' => '87'
                                                           },
                                                    '8' => {
                                                             'name' => 'cp_matrice',
                                                             'offset' => '32',
                                                             'type' => '122067'
                                                           },
                                                    '9' => {
                                                             'name' => 'cp_comment',
                                                             'offset' => '40',
                                                             'type' => '132'
                                                           }
                                                  },
                                        'Name' => 'struct opj_cparameters',
                                        'Size' => '18720',
                                        'Source' => undef,
                                        'SourceLine' => '395',
                                        'Type' => 'Struct'
                                      },
                          '122067' => {
                                        'BaseType' => '87',
                                        'Name' => 'int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '122089' => {
                                        'BaseType' => '2340',
                                        'Name' => 'float[100]',
                                        'Size' => '400',
                                        'Type' => 'Array'
                                      },
                          '122105' => {
                                        'BaseType' => '87',
                                        'Name' => 'int[33]',
                                        'Size' => '132',
                                        'Type' => 'Array'
                                      },
                          '122121' => {
                                        'BaseType' => '138',
                                        'Name' => 'char[4096]',
                                        'Size' => '4096',
                                        'Type' => 'Array'
                                      },
                          '122138' => {
                                        'BaseType' => '87',
                                        'Name' => 'int[16]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '122154' => {
                                        'BaseType' => '121164',
                                        'Name' => 'opj_cparameters_t',
                                        'Size' => '18720',
                                        'Source' => undef,
                                        'SourceLine' => '546',
                                        'Type' => 'Typedef'
                                      },
                          '122167' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cp_reduce',
                                                             'offset' => '0',
                                                             'type' => '9383'
                                                           },
                                                    '1' => {
                                                             'name' => 'cp_layer',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '10' => {
                                                              'name' => 'm_verbose',
                                                              'offset' => '8224',
                                                              'type' => '2937'
                                                            },
                                                    '11' => {
                                                              'name' => 'tile_index',
                                                              'offset' => '8228',
                                                              'type' => '9383'
                                                            },
                                                    '12' => {
                                                              'name' => 'nb_tile_to_decode',
                                                              'offset' => '8232',
                                                              'type' => '9383'
                                                            },
                                                    '13' => {
                                                              'name' => 'jpwl_correct',
                                                              'offset' => '8236',
                                                              'type' => '2937'
                                                            },
                                                    '14' => {
                                                              'name' => 'jpwl_exp_comps',
                                                              'offset' => '8240',
                                                              'type' => '87'
                                                            },
                                                    '15' => {
                                                              'name' => 'jpwl_max_tiles',
                                                              'offset' => '8244',
                                                              'type' => '87'
                                                            },
                                                    '16' => {
                                                              'name' => 'flags',
                                                              'offset' => '8248',
                                                              'type' => '59'
                                                            },
                                                    '2' => {
                                                             'name' => 'infile',
                                                             'offset' => '8',
                                                             'type' => '122121'
                                                           },
                                                    '3' => {
                                                             'name' => 'outfile',
                                                             'offset' => '4104',
                                                             'type' => '122121'
                                                           },
                                                    '4' => {
                                                             'name' => 'decod_format',
                                                             'offset' => '8200',
                                                             'type' => '87'
                                                           },
                                                    '5' => {
                                                             'name' => 'cod_format',
                                                             'offset' => '8204',
                                                             'type' => '87'
                                                           },
                                                    '6' => {
                                                             'name' => 'DA_x0',
                                                             'offset' => '8208',
                                                             'type' => '9383'
                                                           },
                                                    '7' => {
                                                             'name' => 'DA_x1',
                                                             'offset' => '8212',
                                                             'type' => '9383'
                                                           },
                                                    '8' => {
                                                             'name' => 'DA_y0',
                                                             'offset' => '8216',
                                                             'type' => '9383'
                                                           },
                                                    '9' => {
                                                             'name' => 'DA_y1',
                                                             'offset' => '8220',
                                                             'type' => '9383'
                                                           }
                                                  },
                                        'Name' => 'struct opj_dparameters',
                                        'Size' => '8252',
                                        'Source' => undef,
                                        'SourceLine' => '554',
                                        'Type' => 'Struct'
                                      },
                          '122435' => {
                                        'BaseType' => '122167',
                                        'Name' => 'opj_dparameters_t',
                                        'Size' => '8252',
                                        'Source' => undef,
                                        'SourceLine' => '614',
                                        'Type' => 'Typedef'
                                      },
                          '122983' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'start_pos',
                                                             'offset' => '0',
                                                             'type' => '11749'
                                                           },
                                                    '1' => {
                                                             'name' => 'end_ph_pos',
                                                             'offset' => '8',
                                                             'type' => '11749'
                                                           },
                                                    '2' => {
                                                             'name' => 'end_pos',
                                                             'offset' => '16',
                                                             'type' => '11749'
                                                           },
                                                    '3' => {
                                                             'name' => 'disto',
                                                             'offset' => '24',
                                                             'type' => '2347'
                                                           }
                                                  },
                                        'Name' => 'struct opj_packet_info',
                                        'Size' => '32',
                                        'Source' => undef,
                                        'SourceLine' => '768',
                                        'Type' => 'Struct'
                                      },
                          '123054' => {
                                        'BaseType' => '122983',
                                        'Name' => 'opj_packet_info_t',
                                        'Size' => '32',
                                        'Source' => undef,
                                        'SourceLine' => '777',
                                        'Type' => 'Typedef'
                                      },
                          '123067' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '52'
                                                           },
                                                    '1' => {
                                                             'name' => 'pos',
                                                             'offset' => '8',
                                                             'type' => '11749'
                                                           },
                                                    '2' => {
                                                             'name' => 'len',
                                                             'offset' => '16',
                                                             'type' => '87'
                                                           }
                                                  },
                                        'Name' => 'struct opj_marker_info',
                                        'Size' => '24',
                                        'Source' => undef,
                                        'SourceLine' => '784',
                                        'Type' => 'Struct'
                                      },
                          '123124' => {
                                        'BaseType' => '123067',
                                        'Name' => 'opj_marker_info_t',
                                        'Size' => '24',
                                        'Source' => undef,
                                        'SourceLine' => '791',
                                        'Type' => 'Typedef'
                                      },
                          '123502' => {
                                        'BaseType' => '123054',
                                        'Name' => 'opj_packet_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '123508' => {
                                        'BaseType' => '123124',
                                        'Name' => 'opj_marker_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '123873' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'compno',
                                                             'offset' => '0',
                                                             'type' => '9383'
                                                           },
                                                    '1' => {
                                                             'name' => 'csty',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '10' => {
                                                              'name' => 'numgbits',
                                                              'offset' => '808',
                                                              'type' => '9383'
                                                            },
                                                    '11' => {
                                                              'name' => 'roishift',
                                                              'offset' => '812',
                                                              'type' => '9371'
                                                            },
                                                    '12' => {
                                                              'name' => 'prcw',
                                                              'offset' => '816',
                                                              'type' => '21015'
                                                            },
                                                    '13' => {
                                                              'name' => 'prch',
                                                              'offset' => '948',
                                                              'type' => '21015'
                                                            },
                                                    '2' => {
                                                             'name' => 'numresolutions',
                                                             'offset' => '8',
                                                             'type' => '9383'
                                                           },
                                                    '3' => {
                                                             'name' => 'cblkw',
                                                             'offset' => '12',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'cblkh',
                                                             'offset' => '16',
                                                             'type' => '9383'
                                                           },
                                                    '5' => {
                                                             'name' => 'cblksty',
                                                             'offset' => '20',
                                                             'type' => '9383'
                                                           },
                                                    '6' => {
                                                             'name' => 'qmfbid',
                                                             'offset' => '24',
                                                             'type' => '9383'
                                                           },
                                                    '7' => {
                                                             'name' => 'qntsty',
                                                             'offset' => '28',
                                                             'type' => '9383'
                                                           },
                                                    '8' => {
                                                             'name' => 'stepsizes_mant',
                                                             'offset' => '32',
                                                             'type' => '124090'
                                                           },
                                                    '9' => {
                                                             'name' => 'stepsizes_expn',
                                                             'offset' => '420',
                                                             'type' => '124090'
                                                           }
                                                  },
                                        'Name' => 'struct opj_tccp_info',
                                        'Size' => '1080',
                                        'Source' => undef,
                                        'SourceLine' => '908',
                                        'Type' => 'Struct'
                                      },
                          '12409' => {
                                       'BaseType' => '11684',
                                       'Name' => 'OPJ_FLOAT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '124090' => {
                                        'BaseType' => '9383',
                                        'Name' => 'OPJ_UINT32[97]',
                                        'Size' => '388',
                                        'Type' => 'Array'
                                      },
                          '124122' => {
                                        'BaseType' => '123873',
                                        'Name' => 'opj_tccp_info_t',
                                        'Size' => '1080',
                                        'Source' => undef,
                                        'SourceLine' => '938',
                                        'Type' => 'Typedef'
                                      },
                          '124135' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tileno',
                                                             'offset' => '0',
                                                             'type' => '87'
                                                           },
                                                    '1' => {
                                                             'name' => 'csty',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '2' => {
                                                             'name' => 'prg',
                                                             'offset' => '8',
                                                             'type' => '19990'
                                                           },
                                                    '3' => {
                                                             'name' => 'numlayers',
                                                             'offset' => '12',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'mct',
                                                             'offset' => '16',
                                                             'type' => '9383'
                                                           },
                                                    '5' => {
                                                             'name' => 'tccp_info',
                                                             'offset' => '24',
                                                             'type' => '124234'
                                                           }
                                                  },
                                        'Name' => 'struct opj_tile_v2_info',
                                        'Size' => '32',
                                        'Source' => undef,
                                        'SourceLine' => '943',
                                        'Type' => 'Struct'
                                      },
                          '12415' => {
                                       'BaseType' => '9383',
                                       'Name' => 'OPJ_UINT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '124234' => {
                                        'BaseType' => '124122',
                                        'Name' => 'opj_tccp_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '124240' => {
                                        'BaseType' => '124135',
                                        'Name' => 'opj_tile_info_v2_t',
                                        'Size' => '32',
                                        'Source' => undef,
                                        'SourceLine' => '959',
                                        'Type' => 'Typedef'
                                      },
                          '124253' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tx0',
                                                             'offset' => '0',
                                                             'type' => '9383'
                                                           },
                                                    '1' => {
                                                             'name' => 'ty0',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '2' => {
                                                             'name' => 'tdx',
                                                             'offset' => '8',
                                                             'type' => '9383'
                                                           },
                                                    '3' => {
                                                             'name' => 'tdy',
                                                             'offset' => '12',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'tw',
                                                             'offset' => '16',
                                                             'type' => '9383'
                                                           },
                                                    '5' => {
                                                             'name' => 'th',
                                                             'offset' => '20',
                                                             'type' => '9383'
                                                           },
                                                    '6' => {
                                                             'name' => 'nbcomps',
                                                             'offset' => '24',
                                                             'type' => '9383'
                                                           },
                                                    '7' => {
                                                             'name' => 'm_default_tile_info',
                                                             'offset' => '32',
                                                             'type' => '124240'
                                                           },
                                                    '8' => {
                                                             'name' => 'tile_info',
                                                             'offset' => '64',
                                                             'type' => '124392'
                                                           }
                                                  },
                                        'Name' => 'struct opj_codestream_info_v2',
                                        'Size' => '72',
                                        'Source' => undef,
                                        'SourceLine' => '964',
                                        'Type' => 'Struct'
                                      },
                          '124392' => {
                                        'BaseType' => '124240',
                                        'Name' => 'opj_tile_info_v2_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '124398' => {
                                        'BaseType' => '124253',
                                        'Name' => 'opj_codestream_info_v2_t',
                                        'Size' => '72',
                                        'Source' => undef,
                                        'SourceLine' => '988',
                                        'Type' => 'Typedef'
                                      },
                          '124411' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'start_pos',
                                                             'offset' => '0',
                                                             'type' => '11749'
                                                           },
                                                    '1' => {
                                                             'name' => 'end_header',
                                                             'offset' => '8',
                                                             'type' => '11749'
                                                           },
                                                    '2' => {
                                                             'name' => 'end_pos',
                                                             'offset' => '16',
                                                             'type' => '11749'
                                                           }
                                                  },
                                        'Name' => 'struct opj_tp_index',
                                        'Size' => '24',
                                        'Source' => undef,
                                        'SourceLine' => '994',
                                        'Type' => 'Struct'
                                      },
                          '124468' => {
                                        'BaseType' => '124411',
                                        'Name' => 'opj_tp_index_t',
                                        'Size' => '24',
                                        'Source' => undef,
                                        'SourceLine' => '1002',
                                        'Type' => 'Typedef'
                                      },
                          '124481' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tileno',
                                                             'offset' => '0',
                                                             'type' => '9383'
                                                           },
                                                    '1' => {
                                                             'name' => 'nb_tps',
                                                             'offset' => '4',
                                                             'type' => '9383'
                                                           },
                                                    '2' => {
                                                             'name' => 'current_nb_tps',
                                                             'offset' => '8',
                                                             'type' => '9383'
                                                           },
                                                    '3' => {
                                                             'name' => 'current_tpsno',
                                                             'offset' => '12',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'tp_index',
                                                             'offset' => '16',
                                                             'type' => '124636'
                                                           },
                                                    '5' => {
                                                             'name' => 'marknum',
                                                             'offset' => '24',
                                                             'type' => '9383'
                                                           },
                                                    '6' => {
                                                             'name' => 'marker',
                                                             'offset' => '32',
                                                             'type' => '123508'
                                                           },
                                                    '7' => {
                                                             'name' => 'maxmarknum',
                                                             'offset' => '40',
                                                             'type' => '9383'
                                                           },
                                                    '8' => {
                                                             'name' => 'nb_packet',
                                                             'offset' => '44',
                                                             'type' => '9383'
                                                           },
                                                    '9' => {
                                                             'name' => 'packet_index',
                                                             'offset' => '48',
                                                             'type' => '123502'
                                                           }
                                                  },
                                        'Name' => 'struct opj_tile_index',
                                        'Size' => '56',
                                        'Source' => undef,
                                        'SourceLine' => '1007',
                                        'Type' => 'Struct'
                                      },
                          '124636' => {
                                        'BaseType' => '124468',
                                        'Name' => 'opj_tp_index_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '124642' => {
                                        'BaseType' => '124481',
                                        'Name' => 'opj_tile_index_t',
                                        'Size' => '56',
                                        'Source' => undef,
                                        'SourceLine' => '1034',
                                        'Type' => 'Typedef'
                                      },
                          '124655' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'main_head_start',
                                                             'offset' => '0',
                                                             'type' => '11749'
                                                           },
                                                    '1' => {
                                                             'name' => 'main_head_end',
                                                             'offset' => '8',
                                                             'type' => '11749'
                                                           },
                                                    '2' => {
                                                             'name' => 'codestream_size',
                                                             'offset' => '16',
                                                             'type' => '11737'
                                                           },
                                                    '3' => {
                                                             'name' => 'marknum',
                                                             'offset' => '24',
                                                             'type' => '9383'
                                                           },
                                                    '4' => {
                                                             'name' => 'marker',
                                                             'offset' => '32',
                                                             'type' => '123508'
                                                           },
                                                    '5' => {
                                                             'name' => 'maxmarknum',
                                                             'offset' => '40',
                                                             'type' => '9383'
                                                           },
                                                    '6' => {
                                                             'name' => 'nb_of_tiles',
                                                             'offset' => '44',
                                                             'type' => '9383'
                                                           },
                                                    '7' => {
                                                             'name' => 'tile_index',
                                                             'offset' => '48',
                                                             'type' => '124782'
                                                           }
                                                  },
                                        'Name' => 'struct opj_codestream_index',
                                        'Size' => '56',
                                        'Source' => undef,
                                        'SourceLine' => '1039',
                                        'Type' => 'Struct'
                                      },
                          '124782' => {
                                        'BaseType' => '124642',
                                        'Name' => 'opj_tile_index_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '124788' => {
                                        'BaseType' => '124655',
                                        'Name' => 'opj_codestream_index_t',
                                        'Size' => '56',
                                        'Source' => undef,
                                        'SourceLine' => '1062',
                                        'Type' => 'Typedef'
                                      },
                          '128266' => {
                                        'BaseType' => '124788',
                                        'Name' => 'opj_codestream_index_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '130707' => {
                                        'BaseType' => '22922',
                                        'Name' => 'opj_image_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130713' => {
                                        'BaseType' => '122435',
                                        'Name' => 'opj_dparameters_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130725' => {
                                        'BaseType' => '19900',
                                        'Name' => 'OPJ_UINT32 const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130731' => {
                                        'BaseType' => '122154',
                                        'Name' => 'opj_cparameters_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130737' => {
                                        'BaseType' => '168',
                                        'Name' => 'char const*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130743' => {
                                        'BaseType' => '124398',
                                        'Name' => 'opj_codestream_info_v2_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132' => {
                                     'BaseType' => '138',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '138' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '145' => {
                                     'BaseType' => '138',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '150' => {
                                     'BaseType' => '66',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Source' => undef,
                                     'SourceLine' => '209',
                                     'Type' => 'Typedef'
                                   },
                          '15773' => {
                                       'BaseType' => '11973',
                                       'Name' => 'opj_stream_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '162' => {
                                     'BaseType' => '145',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '168' => {
                                     'BaseType' => '162',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '18954' => {
                                       'BaseType' => '52',
                                       'Name' => '__uint16_t',
                                       'Size' => '2',
                                       'Source' => undef,
                                       'SourceLine' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '19753' => {
                                       'BaseType' => '18954',
                                       'Name' => 'uint16_t',
                                       'Size' => '2',
                                       'Source' => undef,
                                       'SourceLine' => '25',
                                       'Type' => 'Typedef'
                                     },
                          '19801' => {
                                       'BaseType' => '138',
                                       'Name' => 'OPJ_CHAR',
                                       'Size' => '1',
                                       'Source' => undef,
                                       'SourceLine' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '19859' => {
                                       'BaseType' => '19753',
                                       'Name' => 'OPJ_UINT16',
                                       'Size' => '2',
                                       'Source' => undef,
                                       'SourceLine' => '130',
                                       'Type' => 'Typedef'
                                     },
                          '19900' => {
                                       'BaseType' => '9383',
                                       'Name' => 'OPJ_UINT32 const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '19934' => {
                                       'Header' => 'openjpeg.h',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_PROG_UNKNOWN',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_LRCP',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_RLCP',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_RPCL',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_PCRL',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CPRL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum PROG_ORDER',
                                       'Size' => '4',
                                       'Source' => undef,
                                       'SourceLine' => '305',
                                       'Type' => 'Enum'
                                     },
                          '19990' => {
                                       'BaseType' => '19934',
                                       'Name' => 'OPJ_PROG_ORDER',
                                       'Size' => '4',
                                       'Source' => undef,
                                       'SourceLine' => '312',
                                       'Type' => 'Typedef'
                                     },
                          '20003' => {
                                       'Header' => 'openjpeg.h',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPJ_CLRSPC_UNKNOWN',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPJ_CLRSPC_UNSPECIFIED',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'OPJ_CLRSPC_SRGB',
                                                            'value' => '1'
                                                          },
                                                   '3' => {
                                                            'name' => 'OPJ_CLRSPC_GRAY',
                                                            'value' => '2'
                                                          },
                                                   '4' => {
                                                            'name' => 'OPJ_CLRSPC_SYCC',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'OPJ_CLRSPC_EYCC',
                                                            'value' => '4'
                                                          },
                                                   '6' => {
                                                            'name' => 'OPJ_CLRSPC_CMYK',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum COLOR_SPACE',
                                       'Size' => '4',
                                       'Source' => undef,
                                       'SourceLine' => '317',
                                       'Type' => 'Enum'
                                     },
                          '20065' => {
                                       'BaseType' => '20003',
                                       'Name' => 'OPJ_COLOR_SPACE',
                                       'Size' => '4',
                                       'Source' => undef,
                                       'SourceLine' => '325',
                                       'Type' => 'Typedef'
                                     },
                          '20078' => {
                                       'Header' => 'openjpeg.h',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'resno0',
                                                            'offset' => '0',
                                                            'type' => '9383'
                                                          },
                                                   '1' => {
                                                            'name' => 'compno0',
                                                            'offset' => '4',
                                                            'type' => '9383'
                                                          },
                                                   '10' => {
                                                             'name' => 'progorder',
                                                             'offset' => '40',
                                                             'type' => '20595'
                                                           },
                                                   '11' => {
                                                             'name' => 'tile',
                                                             'offset' => '48',
                                                             'type' => '9383'
                                                           },
                                                   '12' => {
                                                             'name' => 'tx0',
                                                             'offset' => '52',
                                                             'type' => '9371'
                                                           },
                                                   '13' => {
                                                             'name' => 'tx1',
                                                             'offset' => '56',
                                                             'type' => '9371'
                                                           },
                                                   '14' => {
                                                             'name' => 'ty0',
                                                             'offset' => '60',
                                                             'type' => '9371'
                                                           },
                                                   '15' => {
                                                             'name' => 'ty1',
                                                             'offset' => '64',
                                                             'type' => '9371'
                                                           },
                                                   '16' => {
                                                             'name' => 'layS',
                                                             'offset' => '68',
                                                             'type' => '9383'
                                                           },
                                                   '17' => {
                                                             'name' => 'resS',
                                                             'offset' => '72',
                                                             'type' => '9383'
                                                           },
                                                   '18' => {
                                                             'name' => 'compS',
                                                             'offset' => '76',
                                                             'type' => '9383'
                                                           },
                                                   '19' => {
                                                             'name' => 'prcS',
                                                             'offset' => '80',
                                                             'type' => '9383'
                                                           },
                                                   '2' => {
                                                            'name' => 'layno1',
                                                            'offset' => '8',
                                                            'type' => '9383'
                                                          },
                                                   '20' => {
                                                             'name' => 'layE',
                                                             'offset' => '84',
                                                             'type' => '9383'
                                                           },
                                                   '21' => {
                                                             'name' => 'resE',
                                                             'offset' => '88',
                                                             'type' => '9383'
                                                           },
                                                   '22' => {
                                                             'name' => 'compE',
                                                             'offset' => '92',
                                                             'type' => '9383'
                                                           },
                                                   '23' => {
                                                             'name' => 'prcE',
                                                             'offset' => '96',
                                                             'type' => '9383'
                                                           },
                                                   '24' => {
                                                             'name' => 'txS',
                                                             'offset' => '100',
                                                             'type' => '9383'
                                                           },
                                                   '25' => {
                                                             'name' => 'txE',
                                                             'offset' => '104',
                                                             'type' => '9383'
                                                           },
                                                   '26' => {
                                                             'name' => 'tyS',
                                                             'offset' => '108',
                                                             'type' => '9383'
                                                           },
                                                   '27' => {
                                                             'name' => 'tyE',
                                                             'offset' => '112',
                                                             'type' => '9383'
                                                           },
                                                   '28' => {
                                                             'name' => 'dx',
                                                             'offset' => '116',
                                                             'type' => '9383'
                                                           },
                                                   '29' => {
                                                             'name' => 'dy',
                                                             'offset' => '120',
                                                             'type' => '9383'
                                                           },
                                                   '3' => {
                                                            'name' => 'resno1',
                                                            'offset' => '12',
                                                            'type' => '9383'
                                                          },
                                                   '30' => {
                                                             'name' => 'lay_t',
                                                             'offset' => '124',
                                                             'type' => '9383'
                                                           },
                                                   '31' => {
                                                             'name' => 'res_t',
                                                             'offset' => '128',
                                                             'type' => '9383'
                                                           },
                                                   '32' => {
                                                             'name' => 'comp_t',
                                                             'offset' => '132',
                                                             'type' => '9383'
                                                           },
                                                   '33' => {
                                                             'name' => 'prc_t',
                                                             'offset' => '136',
                                                             'type' => '9383'
                                                           },
                                                   '34' => {
                                                             'name' => 'tx0_t',
                                                             'offset' => '140',
                                                             'type' => '9383'
                                                           },
                                                   '35' => {
                                                             'name' => 'ty0_t',
                                                             'offset' => '144',
                                                             'type' => '9383'
                                                           },
                                                   '4' => {
                                                            'name' => 'compno1',
                                                            'offset' => '16',
                                                            'type' => '9383'
                                                          },
                                                   '5' => {
                                                            'name' => 'layno0',
                                                            'offset' => '20',
                                                            'type' => '9383'
                                                          },
                                                   '6' => {
                                                            'name' => 'precno0',
                                                            'offset' => '24',
                                                            'type' => '9383'
                                                          },
                                                   '7' => {
                                                            'name' => 'precno1',
                                                            'offset' => '28',
                                                            'type' => '9383'
                                                          },
                                                   '8' => {
                                                            'name' => 'prg1',
                                                            'offset' => '32',
                                                            'type' => '19990'
                                                          },
                                                   '9' => {
                                                            'name' => 'prg',
                                                            'offset' => '36',
                                                            'type' => '19990'
                                                          }
                                                 },
                                       'Name' => 'struct opj_poc',
                                       'Size' => '148',
                                       'Source' => undef,
                                       'SourceLine' => '367',
                                       'Type' => 'Struct'
                                     },
                          '20595' => {
                                       'BaseType' => '19801',
                                       'Name' => 'OPJ_CHAR[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '20611' => {
                                       'BaseType' => '20078',
                                       'Name' => 'opj_poc_t',
                                       'Size' => '148',
                                       'Source' => undef,
                                       'SourceLine' => '390',
                                       'Type' => 'Typedef'
                                     },
                          '20624' => {
                                       'BaseType' => '20611',
                                       'Name' => 'opj_poc_t[32]',
                                       'Size' => '4736',
                                       'Type' => 'Array'
                                     },
                          '20640' => {
                                       'Header' => 'openjpeg.h',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dx',
                                                            'offset' => '0',
                                                            'type' => '9383'
                                                          },
                                                   '1' => {
                                                            'name' => 'dy',
                                                            'offset' => '4',
                                                            'type' => '9383'
                                                          },
                                                   '10' => {
                                                             'name' => 'factor',
                                                             'offset' => '40',
                                                             'type' => '9383'
                                                           },
                                                   '11' => {
                                                             'name' => 'data',
                                                             'offset' => '48',
                                                             'type' => '20829'
                                                           },
                                                   '12' => {
                                                             'name' => 'alpha',
                                                             'offset' => '56',
                                                             'type' => '19859'
                                                           },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '8',
                                                            'type' => '9383'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '12',
                                                            'type' => '9383'
                                                          },
                                                   '4' => {
                                                            'name' => 'x0',
                                                            'offset' => '16',
                                                            'type' => '9383'
                                                          },
                                                   '5' => {
                                                            'name' => 'y0',
                                                            'offset' => '20',
                                                            'type' => '9383'
                                                          },
                                                   '6' => {
                                                            'name' => 'prec',
                                                            'offset' => '24',
                                                            'type' => '9383'
                                                          },
                                                   '7' => {
                                                            'name' => 'bpp',
                                                            'offset' => '28',
                                                            'type' => '9383'
                                                          },
                                                   '8' => {
                                                            'name' => 'sgnd',
                                                            'offset' => '32',
                                                            'type' => '9383'
                                                          },
                                                   '9' => {
                                                            'name' => 'resno_decoded',
                                                            'offset' => '36',
                                                            'type' => '9383'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image_comp',
                                       'Size' => '64',
                                       'Source' => undef,
                                       'SourceLine' => '679',
                                       'Type' => 'Struct'
                                     },
                          '20829' => {
                                       'BaseType' => '9371',
                                       'Name' => 'OPJ_INT32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20840' => {
                                       'BaseType' => '20640',
                                       'Name' => 'opj_image_comp_t',
                                       'Size' => '64',
                                       'Source' => undef,
                                       'SourceLine' => '706',
                                       'Type' => 'Typedef'
                                     },
                          '20853' => {
                                       'Header' => 'openjpeg.h',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x0',
                                                            'offset' => '0',
                                                            'type' => '9383'
                                                          },
                                                   '1' => {
                                                            'name' => 'y0',
                                                            'offset' => '4',
                                                            'type' => '9383'
                                                          },
                                                   '2' => {
                                                            'name' => 'x1',
                                                            'offset' => '8',
                                                            'type' => '9383'
                                                          },
                                                   '3' => {
                                                            'name' => 'y1',
                                                            'offset' => '12',
                                                            'type' => '9383'
                                                          },
                                                   '4' => {
                                                            'name' => 'numcomps',
                                                            'offset' => '16',
                                                            'type' => '9383'
                                                          },
                                                   '5' => {
                                                            'name' => 'color_space',
                                                            'offset' => '20',
                                                            'type' => '20065'
                                                          },
                                                   '6' => {
                                                            'name' => 'comps',
                                                            'offset' => '24',
                                                            'type' => '20990'
                                                          },
                                                   '7' => {
                                                            'name' => 'icc_profile_buf',
                                                            'offset' => '32',
                                                            'type' => '9407'
                                                          },
                                                   '8' => {
                                                            'name' => 'icc_profile_len',
                                                            'offset' => '40',
                                                            'type' => '9383'
                                                          }
                                                 },
                                       'Name' => 'struct opj_image',
                                       'Size' => '48',
                                       'Source' => undef,
                                       'SourceLine' => '711',
                                       'Type' => 'Struct'
                                     },
                          '20990' => {
                                       'BaseType' => '20840',
                                       'Name' => 'opj_image_comp_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21002' => {
                                       'BaseType' => '20853',
                                       'Name' => 'opj_image_t',
                                       'Size' => '48',
                                       'Source' => undef,
                                       'SourceLine' => '730',
                                       'Type' => 'Typedef'
                                     },
                          '21015' => {
                                       'BaseType' => '9383',
                                       'Name' => 'OPJ_UINT32[33]',
                                       'Size' => '132',
                                       'Type' => 'Array'
                                     },
                          '22922' => {
                                       'BaseType' => '21002',
                                       'Name' => 'opj_image_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2340' => {
                                      'Name' => 'float',
                                      'Size' => '4',
                                      'Type' => 'Intrinsic'
                                    },
                          '2347' => {
                                      'Name' => 'double',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '2367' => {
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '87'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '132'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '132'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '132'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '2783'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '2789'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '87'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '87'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '106'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '52'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '73'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '2795'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '132'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '2811'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '118'
                                                          },
                                                  '22' => {
                                                            'name' => '_codecvt',
                                                            'offset' => '152',
                                                            'type' => '2822'
                                                          },
                                                  '23' => {
                                                            'name' => '_wide_data',
                                                            'offset' => '160',
                                                            'type' => '2833'
                                                          },
                                                  '24' => {
                                                            'name' => '_freeres_list',
                                                            'offset' => '168',
                                                            'type' => '2789'
                                                          },
                                                  '25' => {
                                                            'name' => '_freeres_buf',
                                                            'offset' => '176',
                                                            'type' => '130'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '150'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '87'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '2839'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '132'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '132'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '132'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '132'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '132'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '132'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '132'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Source' => undef,
                                      'SourceLine' => '49',
                                      'Type' => 'Struct'
                                    },
                          '25225' => {
                                       'BaseType' => '2937',
                                       'Name' => 'OPJ_BOOL*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2758' => {
                                      'BaseType' => '2367',
                                      'Name' => 'FILE',
                                      'Size' => '216',
                                      'Source' => undef,
                                      'SourceLine' => '7',
                                      'Type' => 'Typedef'
                                    },
                          '2770' => {
                                      'Name' => '_IO_lock_t',
                                      'Source' => undef,
                                      'SourceLine' => '43',
                                      'Type' => 'Typedef'
                                    },
                          '2778' => {
                                      'Name' => 'struct _IO_marker',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '2783' => {
                                      'BaseType' => '2778',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2789' => {
                                      'BaseType' => '2367',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2795' => {
                                      'BaseType' => '138',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '2811' => {
                                      'BaseType' => '2770',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2817' => {
                                      'Name' => 'struct _IO_codecvt',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '2822' => {
                                      'BaseType' => '2817',
                                      'Name' => 'struct _IO_codecvt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2828' => {
                                      'Name' => 'struct _IO_wide_data',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '2833' => {
                                      'BaseType' => '2828',
                                      'Name' => 'struct _IO_wide_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2839' => {
                                      'BaseType' => '138',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '2867' => {
                                      'BaseType' => '2758',
                                      'Name' => 'FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2937' => {
                                      'BaseType' => '87',
                                      'Name' => 'OPJ_BOOL',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '116',
                                      'Type' => 'Typedef'
                                    },
                          '297991' => {
                                        'Header' => 'openjpeg.h',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'OPJ_CODEC_UNKNOWN',
                                                             'value' => '18446744073709551615 (-1)'
                                                           },
                                                    '1' => {
                                                             'name' => 'OPJ_CODEC_J2K',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'OPJ_CODEC_JPT',
                                                             'value' => '1'
                                                           },
                                                    '3' => {
                                                             'name' => 'OPJ_CODEC_JP2',
                                                             'value' => '2'
                                                           },
                                                    '4' => {
                                                             'name' => 'OPJ_CODEC_JPP',
                                                             'value' => '3'
                                                           },
                                                    '5' => {
                                                             'name' => 'OPJ_CODEC_JPX',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum CODEC_FORMAT',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '330',
                                        'Type' => 'Enum'
                                      },
                          '298047' => {
                                        'BaseType' => '297991',
                                        'Name' => 'OPJ_CODEC_FORMAT',
                                        'Size' => '4',
                                        'Source' => undef,
                                        'SourceLine' => '337',
                                        'Type' => 'Typedef'
                                      },
                          '299925' => {
                                        'BaseType' => '130',
                                        'Name' => 'opj_codec_t',
                                        'Size' => '8',
                                        'Source' => undef,
                                        'SourceLine' => '620',
                                        'Type' => 'Typedef'
                                      },
                          '303952' => {
                                        'BaseType' => '128266',
                                        'Name' => 'opj_codestream_index_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '304054' => {
                                        'BaseType' => '299925',
                                        'Name' => 'opj_codec_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '304145' => {
                                        'BaseType' => '130743',
                                        'Name' => 'opj_codestream_info_v2_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '73' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8647' => {
                                      'BaseType' => '87',
                                      'Name' => '__int32_t',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '41',
                                      'Type' => 'Typedef'
                                    },
                          '8659' => {
                                      'BaseType' => '59',
                                      'Name' => '__uint32_t',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '42',
                                      'Type' => 'Typedef'
                                    },
                          '87' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '9323' => {
                                      'BaseType' => '8647',
                                      'Name' => 'int32_t',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '26',
                                      'Type' => 'Typedef'
                                    },
                          '9335' => {
                                      'BaseType' => '8659',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '26',
                                      'Type' => 'Typedef'
                                    },
                          '9359' => {
                                      'BaseType' => '45',
                                      'Name' => 'OPJ_BYTE',
                                      'Size' => '1',
                                      'Source' => undef,
                                      'SourceLine' => '123',
                                      'Type' => 'Typedef'
                                    },
                          '9371' => {
                                      'BaseType' => '9323',
                                      'Name' => 'OPJ_INT32',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '131',
                                      'Type' => 'Typedef'
                                    },
                          '9383' => {
                                      'BaseType' => '9335',
                                      'Name' => 'OPJ_UINT32',
                                      'Size' => '4',
                                      'Source' => undef,
                                      'SourceLine' => '132',
                                      'Type' => 'Typedef'
                                    },
                          '9395' => {
                                      'BaseType' => '150',
                                      'Name' => 'OPJ_SIZE_T',
                                      'Size' => '8',
                                      'Source' => undef,
                                      'SourceLine' => '139',
                                      'Type' => 'Typedef'
                                    },
                          '9407' => {
                                      'BaseType' => '9359',
                                      'Name' => 'OPJ_BYTE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '962' => {
                                     'Name' => 'void(*)(void*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '130'
                                                         }
                                                },
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '99' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libopenjp2.so.2.5.3' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             'calloc@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'fseeko@GLIBC_2.2.5' => 0,
                                                             'ftello@GLIBC_2.2.5' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'lrintf@GLIBC_2.2.5' => 0,
                                                             'malloc@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memmove@GLIBC_2.2.5' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'posix_memalign@GLIBC_2.2.5' => 0,
                                                             'pow@GLIBC_2.29' => 0,
                                                             'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                             'pthread_attr_setdetachstate@GLIBC_2.2.5' => 0,
                                                             'pthread_cond_destroy@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_init@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_signal@GLIBC_2.3.2' => 0,
                                                             'pthread_cond_wait@GLIBC_2.3.2' => 0,
                                                             'pthread_create@GLIBC_2.2.5' => 0,
                                                             'pthread_join@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                             'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                             'qsort@GLIBC_2.2.5' => 0,
                                                             'realloc@GLIBC_2.2.5' => 0,
                                                             'sqrt@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strcpy@GLIBC_2.2.5' => 0,
                                                             'strtol@GLIBC_2.2.5' => 0,
                                                             'sysconf@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
